// BlueprintGeneratedClass Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C
// Size: 0x1370 (Inherited: 0x1242)
struct AAbility_Phoenix_X_SelfRes_Production_C : AAbility_Equipped_Base_C {
	char pad_1242[0x6]; // 0x1242(0x06)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1248(0x08)
	struct UUltimateVOComponent_C* UltimateVOComponent; // 0x1250(0x08)
	struct UReloadWeapons_StateComponent_C* SelfResReloadState; // 0x1258(0x08)
	struct UStateComponent_CapsuleSweepForGround_C* StateComponent_CapsuleSweepForGround; // 0x1260(0x08)
	struct USetOwnerAsContextActor_StateComponent_C* SetOwnerAsContextActor_StateComponent; // 0x1268(0x08)
	struct UTimedStateComponent* SelfResTimeoutState; // 0x1270(0x08)
	struct UTimedStateComponent* SelfResDeathState; // 0x1278(0x08)
	struct UTeleportStateComponent* SelfResTeleportState; // 0x1280(0x08)
	struct UEQSStateComponent* SelfResFindTeleportLocationState; // 0x1288(0x08)
	struct UForceReequip_StateComponent_C* ForceReequipTimeoutState; // 0x1290(0x08)
	struct UStateComponent_FindSpawnSpotOnGround_C* StateComponent_FindSpawnSpotOnGround; // 0x1298(0x08)
	struct UTimedStateComponent* SelfResRespawnState; // 0x12a0(0x08)
	struct USyncStateMachineStateComponent* SyncStateMachineState; // 0x12a8(0x08)
	struct UScriptStateComponent* IdleState; // 0x12b0(0x08)
	struct UEquippableStateMachineComponent* SelfResStateMachine; // 0x12b8(0x08)
	struct UUnequipStateComponent* FinalUnequipState; // 0x12c0(0x08)
	struct UForceReequip_StateComponent_C* ForceReequipDeathState; // 0x12c8(0x08)
	struct USpawnActorStateComponent* SpawnAshesState; // 0x12d0(0x08)
	struct UConsumeResourcesStateComponent* ResConsumeResourcesState; // 0x12d8(0x08)
	struct UPreventDeath_StateComponent_C* PreventDeathState; // 0x12e0(0x08)
	struct UConsumeResourcesStateComponent* CastConsumeResourcesState; // 0x12e8(0x08)
	struct UUltPointsComponent* UltPoints; // 0x12f0(0x08)
	struct AGameObject_Phoenix_X_ResTarget_Production_C* ResTarget; // 0x12f8(0x08)
	struct FActiveGameplayEffectHandle SelfResBuffHandle; // 0x1300(0x08)
	struct FActiveGameplayEffectHandle DeathBuffHandle; // 0x1308(0x08)
	bool ShouldConsumePoints; // 0x1310(0x01)
	char pad_1311[0x7]; // 0x1311(0x07)
	struct UComp_PlayerCharacter_KillTracker_C* KillTracker; // 0x1318(0x08)
	struct FActiveGameplayEffectHandle PreventFiringHandle; // 0x1320(0x08)
	struct FDestructionSettings DoNothingDestructionOverride; // 0x1328(0x20)
	struct UEquippableEventBase* Ultimate Started Equippable Event; // 0x1348(0x08)
	struct UEquippableEventBase* Ultimate Ended Equippable Event; // 0x1350(0x08)
	struct UAresGameplayBuff* Prevent Firing Buff; // 0x1358(0x08)
	struct UAresGameplayBuff* Self Res Buff; // 0x1360(0x08)
	struct UAresGameplayBuff* Death Buff; // 0x1368(0x08)

	void Auth Emit Ultimate Ended(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth Emit Ultimate Ended // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth Emit Ultimate Started(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth Emit Ultimate Started // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth Try To Consume Ult Points(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth Try To Consume Ult Points // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth Update Context To Res Position(struct UScriptStateComponent* State); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth Update Context To Res Position // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth On Respawn End(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth On Respawn End // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth On Respawn Begin(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth On Respawn Begin // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth RegisterEquippableEvents(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth RegisterEquippableEvents // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Reset Collision(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Reset Collision // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth On End Self Res(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth On End Self Res // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth On Begin Self Res(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth On Begin Self Res // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth Toggle Destruction Immunity(bool IsImmune); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth Toggle Destruction Immunity // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Auth Add Kill Tracker(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Auth Add Kill Tracker // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Setup Equippable States(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Setup Equippable States // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Setup Self Res States(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Setup Self Res States // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Add States to Self Res State Machine(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.Add States to Self Res State Machine // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	bool GetCanEquipWhenSlotDisabled(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.GetCanEquipWhenSlotDisabled // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x19be2f0
	struct FTransform AdjustTransformForSpawn(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.AdjustTransformForSpawn // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void ReceiveBeginPlay(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__PreventDeathState_K2Node_ComponentBoundEvent_7_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__PreventDeathState_K2Node_ComponentBoundEvent_7_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__PreventDeathState_K2Node_ComponentBoundEvent_8_OnStateExitSignature__DelegateSignature(struct UScriptStateComponent* ExitedState, struct UStateTransitionContext* StateTransitionContext); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__PreventDeathState_K2Node_ComponentBoundEvent_8_OnStateExitSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SpawnAshesState_K2Node_ComponentBoundEvent_0_OnSpawnActor__DelegateSignature(struct USpawnActorStateComponent* SpawnState, struct AActor* SpawnedActor); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__SpawnAshesState_K2Node_ComponentBoundEvent_0_OnSpawnActor__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SpawnAshesState_K2Node_ComponentBoundEvent_0_OnStateExitSignature__DelegateSignature(struct UScriptStateComponent* ExitedState, struct UStateTransitionContext* StateTransitionContext); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__SpawnAshesState_K2Node_ComponentBoundEvent_0_OnStateExitSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SelfResEndState_K2Node_ComponentBoundEvent_2_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__SelfResEndState_K2Node_ComponentBoundEvent_2_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__EquipDelayState_K2Node_ComponentBoundEvent_0_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__EquipDelayState_K2Node_ComponentBoundEvent_0_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SelfResEndStateInvulnerable_K2Node_ComponentBoundEvent_3_OnStateExitSignature__DelegateSignature(struct UScriptStateComponent* ExitedState, struct UStateTransitionContext* StateTransitionContext); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__SelfResEndStateInvulnerable_K2Node_ComponentBoundEvent_3_OnStateExitSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__IdleState_K2Node_ComponentBoundEvent_2_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__IdleState_K2Node_ComponentBoundEvent_2_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void OnInactiveStateEnter(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.OnInactiveStateEnter // (BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SelfResDeathState_K2Node_ComponentBoundEvent_1_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__SelfResDeathState_K2Node_ComponentBoundEvent_1_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SelfResDeathState_K2Node_ComponentBoundEvent_3_OnStateExitSignature__DelegateSignature(struct UScriptStateComponent* ExitedState, struct UStateTransitionContext* StateTransitionContext); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__SelfResDeathState_K2Node_ComponentBoundEvent_3_OnStateExitSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SelfResTeleportState_K2Node_ComponentBoundEvent_4_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__SelfResTeleportState_K2Node_ComponentBoundEvent_4_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SelfResTeleportState_K2Node_ComponentBoundEvent_11_OnStateExitSignature__DelegateSignature(struct UScriptStateComponent* ExitedState, struct UStateTransitionContext* StateTransitionContext); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__SelfResTeleportState_K2Node_ComponentBoundEvent_11_OnStateExitSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__CheckResourcesState_K2Node_ComponentBoundEvent_4_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__CheckResourcesState_K2Node_ComponentBoundEvent_4_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__PreventDeathState_K2Node_ComponentBoundEvent_6_AuthOnDeathPrevented__DelegateSignature(); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__PreventDeathState_K2Node_ComponentBoundEvent_6_AuthOnDeathPrevented__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__Ability_Phoenix_X_SelfRes_Production_ForceReequipTimeoutState_K2Node_ComponentBoundEvent_9_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__Ability_Phoenix_X_SelfRes_Production_ForceReequipTimeoutState_K2Node_ComponentBoundEvent_9_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__Ability_Phoenix_X_SelfRes_Production_ForceReequipTimeoutState_K2Node_ComponentBoundEvent_10_OnStateExitSignature__DelegateSignature(struct UScriptStateComponent* ExitedState, struct UStateTransitionContext* StateTransitionContext); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__Ability_Phoenix_X_SelfRes_Production_ForceReequipTimeoutState_K2Node_ComponentBoundEvent_10_OnStateExitSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__Ability_Phoenix_X_SelfRes_Production_ForceReequipDeathState_K2Node_ComponentBoundEvent_12_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__Ability_Phoenix_X_SelfRes_Production_ForceReequipDeathState_K2Node_ComponentBoundEvent_12_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__Ability_Phoenix_X_SelfRes_Production_ForceReequipDeathState_K2Node_ComponentBoundEvent_13_OnStateExitSignature__DelegateSignature(struct UScriptStateComponent* ExitedState, struct UStateTransitionContext* StateTransitionContext); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__Ability_Phoenix_X_SelfRes_Production_ForceReequipDeathState_K2Node_ComponentBoundEvent_13_OnStateExitSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__Ability_Phoenix_X_SelfRes_Production_SelfResFindTeleportLocationState_K2Node_ComponentBoundEvent_14_OnStateEnterSignature__DelegateSignature(struct UScriptStateComponent* EnteredState, struct UStateTransitionContext* StateTransitionContext, float StartTimeOffset); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__Ability_Phoenix_X_SelfRes_Production_SelfResFindTeleportLocationState_K2Node_ComponentBoundEvent_14_OnStateEnterSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__Ability_Phoenix_X_SelfRes_Production_SelfResFindTeleportLocationState_K2Node_ComponentBoundEvent_15_OnStateExitSignature__DelegateSignature(struct UScriptStateComponent* ExitedState, struct UStateTransitionContext* StateTransitionContext); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.BndEvt__Ability_Phoenix_X_SelfRes_Production_SelfResFindTeleportLocationState_K2Node_ComponentBoundEvent_15_OnStateExitSignature__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void ExecuteUbergraph_Ability_Phoenix_X_SelfRes_Production(int32_t EntryPoint); // Function Ability_Phoenix_X_SelfRes_Production.Ability_Phoenix_X_SelfRes_Production_C.ExecuteUbergraph_Ability_Phoenix_X_SelfRes_Production // (Final|UbergraphFunction|HasDefaults) // @ game+0x19be2f0
};

