// BlueprintGeneratedClass AudBasePawnVOComponent.AudBasePawnVOComponent_C
// Size: 0xa99 (Inherited: 0x1d0)
struct UAudBasePawnVOComponent_C : UBaseVOComponent_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1d0(0x08)
	struct TArray<double> EmoteCooldownChargeTimestamps; // 0x1d8(0x10)
	double EmoteCooldownSeconds; // 0x1e8(0x08)
	double VO Emote Required Range; // 0x1f0(0x08)
	double VO Critical Required Range; // 0x1f8(0x08)
	bool KillStreakAliveCheck; // 0x200(0x01)
	bool LastManStanding; // 0x201(0x01)
	char pad_202[0x2]; // 0x202(0x02)
	int32_t ClutchPlayRoundNumber; // 0x204(0x04)
	struct TMap<enum class MatchVOEnum, struct UAkAudioEvent*> MatchVO; // 0x208(0x50)
	struct TMap<enum class CharacterRelationMatchVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificMatchVO; // 0x258(0x50)
	struct TMap<enum class MapRelationMatchVOEnum, struct FMapRelationshipInstance> MapSpecificMatchVO; // 0x2a8(0x50)
	struct TMap<enum class EmoteVOEnum, struct UAkAudioEvent*> EmoteVO; // 0x2f8(0x50)
	struct TMap<enum class CharacterRelationEmoteVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificEmoteVO; // 0x348(0x50)
	struct TMap<enum class RoundStartVOEnum, struct UAkAudioEvent*> RoundStartVO; // 0x398(0x50)
	struct TMap<enum class CharacterRelationRoundStartVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificRoundStartVO; // 0x3e8(0x50)
	struct TMap<enum class BubbleDownVOEnum, struct UAkAudioEvent*> BubbleDownVO; // 0x438(0x50)
	struct TMap<enum class CharacterRelationBubbleDownVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificBubbleDownVO; // 0x488(0x50)
	struct TMap<enum class EffortVOEnum, struct UAkAudioEvent*> EffortVO; // 0x4d8(0x50)
	struct TMap<enum class TacticalVOEnum, struct UAkAudioEvent*> TacticalVO; // 0x528(0x50)
	struct TMap<enum class RoundEndVOEnum, struct UAkAudioEvent*> RoundEndVO; // 0x578(0x50)
	struct TMap<enum class CharacterRelationRoundEndVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificRoundEndVO; // 0x5c8(0x50)
	struct TMap<enum class KillsVOEnum, struct UAkAudioEvent*> KillsVO; // 0x618(0x50)
	struct TMap<enum class CharacterRelationKillsVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificKillVO; // 0x668(0x50)
	struct TMap<enum class AbilitiesVOEnum, struct UAkAudioEvent*> AbilitiesVO; // 0x6b8(0x50)
	struct TMap<struct UGameplayEffect*, struct UAkAudioEvent*> GameplayEffectKillEvents; // 0x708(0x50)
	struct TMap<struct UDamageType*, struct UAkAudioEvent*> DmgTypeKillEvents; // 0x758(0x50)
	struct TMap<enum class TagAllianceVOEnum, struct FTagInstance> CharacterTagRoundStartEvents; // 0x7a8(0x50)
	struct TMap<struct FName, struct UAkAudioEvent*> CharacterTagKillEvents; // 0x7f8(0x50)
	struct TMap<struct FName, struct UAkAudioEvent*> CharacterTagLastKillEvents; // 0x848(0x50)
	struct TMap<enum class CharacterRelationMatchVOEnum, struct FTagInstance> CharacterTagMatchStartEvents; // 0x898(0x50)
	struct TMap<enum class CharacterRelationBubbleDownVOEnum, struct FTagInstance> CharacterTagBubbleDownEvents; // 0x8e8(0x50)
	struct TMap<enum class CharacterRelationRoundStartVOEnum, struct FTagInstance> TagCommendRoundStartVO; // 0x938(0x50)
	struct TMap<enum class CharacterConvoVOEnum, struct FCharacterRelationshipInstance> CharacterConvoMatchStartVO; // 0x988(0x50)
	double EffortLastPlayedTime; // 0x9d8(0x08)
	double EffortCooldownSeconds; // 0x9e0(0x08)
	struct FTimerHandle HealingReliefVOTimer; // 0x9e8(0x08)
	struct TMap<enum class DeathMatchVOEnum, struct UAkAudioEvent*> DeathMatchVO; // 0x9f0(0x50)
	bool HealingOnCooldown; // 0xa40(0x01)
	bool IsBeingHealed; // 0xa41(0x01)
	char pad_A42[0x6]; // 0xa42(0x06)
	struct TMap<struct UBlindConfig_Base_C*, struct UAkAudioEvent*> BlindKillEvents; // 0xa48(0x50)
	bool SuppressKillVO; // 0xa98(0x01)

	void OnAuth_Char_AbilityEKill(); // Function AudBasePawnVOComponent.AudBasePawnVOComponent_C.OnAuth_Char_AbilityEKill // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnAuth_Char_AbilityEExpire(); // Function AudBasePawnVOComponent.AudBasePawnVOComponent_C.OnAuth_Char_AbilityEExpire // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnAuth_Char_AbilityEDeactivated(); // Function AudBasePawnVOComponent.AudBasePawnVOComponent_C.OnAuth_Char_AbilityEDeactivated // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnAuth_Char_AbilityQActivated(); // Function AudBasePawnVOComponent.AudBasePawnVOComponent_C.OnAuth_Char_AbilityQActivated // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
