// BlueprintGeneratedClass BombGameMode.BombGameMode_C
// Size: 0x10a8 (Inherited: 0xbe9)
struct ABombGameMode_C : ABaseGameMode_C {
	char pad_BE9[0x7]; // 0xbe9(0x07)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xbf0(0x08)
	struct UComp_GameMode_DelayableFinishers_C* Comp_GameMode_DelayableFinishers; // 0xbf8(0x08)
	struct UTimeGameStateComponent* GameStateTimeoutCountdown; // 0xc00(0x08)
	struct UComp_Actor_MultiTargetHandler_Buff_C* Comp_Actor_MultiTargetHandler_Buff_TimeoutFreeze; // 0xc08(0x08)
	struct UBaseGameStateComponent* GameStateTimeoutQueued; // 0xc10(0x08)
	struct UTimeGameStateComponent* GameStateTimeout; // 0xc18(0x08)
	struct UBaseGameStateComponent* GameStateTimeoutInactive; // 0xc20(0x08)
	struct UStateMachineComponent* TimeoutStateMachine; // 0xc28(0x08)
	struct UComp_MatchResults_StayedInSpawn_C* Comp_MatchResults_StayedInSpawn; // 0xc30(0x08)
	struct UComp_BombRoundStateLog_C* Comp_BombRoundStateLog; // 0xc38(0x08)
	struct UGameStateVoteComponent_C* GameStateVoteComponent; // 0xc40(0x08)
	struct UComp_GameMode_OvertimeDrawVotes_C* Comp_GameMode_OvertimeDrawVotes; // 0xc48(0x08)
	struct UComp_GameMode_GrantPurchasables_C* Comp_GameMode_GrantPurchasables; // 0xc50(0x08)
	struct UComp_MatchResults_RoundCeremony_C* Comp_MatchResults_RoundCeremony; // 0xc58(0x08)
	struct UComp_MatchResults_PlayerScores_C* Comp_MatchResults_PlayerScores; // 0xc60(0x08)
	struct UComp_MatchResults_Penalites_C* Comp_MatchResults_Penalites; // 0xc68(0x08)
	struct UComp_MatchResults_Kill_C* Comp_MatchResults_Kill; // 0xc70(0x08)
	struct UComp_MatchResults_Economy_C* Comp_MatchResults_Economy; // 0xc78(0x08)
	struct UComp_MatchResults_Damage_C* Comp_MatchResults_Damage; // 0xc80(0x08)
	struct UComp_MatchResults_Bomb_C* Comp_MatchResults_Bomb; // 0xc88(0x08)
	struct UComp_MatchResults_Abilities_C* Comp_MatchResults_Abilities; // 0xc90(0x08)
	struct UTimeGameStateComponent* GameStateBuyPhase; // 0xc98(0x08)
	struct UTimeGameStateComponent* GameStateBombPlanted; // 0xca0(0x08)
	struct UBaseGameStateComponent* GameStateTeamSwitch; // 0xca8(0x08)
	struct UTimeGameStateComponent* GameStatePostRound; // 0xcb0(0x08)
	struct UTimeGameStateComponent* GameStateRound; // 0xcb8(0x08)
	struct FTransform BombSpawnTransform; // 0xcc0(0x60)
	struct APlantedBomb_C* BombPlantedObject; // 0xd20(0x08)
	double MatchTimerWarning; // 0xd28(0x08)
	bool HasPlayedMatchTimerWarning; // 0xd30(0x01)
	char pad_D31[0x7]; // 0xd31(0x07)
	double BombPlantedMatchTimerWarning; // 0xd38(0x08)
	struct FAresGameRewardMultiplier BombPlantTeamMateMultiplier; // 0xd40(0x24)
	int32_t WinSpread; // 0xd64(0x04)
	int32_t WinningDirection; // 0xd68(0x04)
	char pad_D6C[0x4]; // 0xd6c(0x04)
	struct TArray<double> CloseLossBonuses; // 0xd70(0x10)
	struct UBaseTeamComponent* L_LosingTeam; // 0xd80(0x08)
	double EscalatingMoney; // 0xd88(0x08)
	double PerRoundEscalationMoney; // 0xd90(0x08)
	struct FName L_RewardName; // 0xd98(0x0c)
	char pad_DA4[0x4]; // 0xda4(0x04)
	double PerRoundEscalationEnergy; // 0xda8(0x08)
	double EscalatingEnergy; // 0xdb0(0x08)
	int32_t EscalatingWinEnergy; // 0xdb8(0x04)
	int32_t PerRoundWinEnergyEscalation; // 0xdbc(0x04)
	int32_t StartingEnergy; // 0xdc0(0x04)
	char pad_DC4[0x4]; // 0xdc4(0x04)
	struct TArray<struct FRoundEndRewards> RoundEndRewards; // 0xdc8(0x10)
	double KillMoneyEscalation; // 0xdd8(0x08)
	struct AActor* SensorTowerMarker; // 0xde0(0x08)
	int32_t UltimatePointsGrantedOnKill; // 0xde8(0x04)
	char pad_DEC[0x4]; // 0xdec(0x04)
	struct TArray<struct AOwnerExclusivePlayerInfo*> RedPlayersWhoGotUltimate; // 0xdf0(0x10)
	struct TArray<struct AOwnerExclusivePlayerInfo*> BluePlayersWhoGotUltimate; // 0xe00(0x10)
	int32_t UltimatePointsGrantedOnDeath; // 0xe10(0x04)
	int32_t DeadWinners; // 0xe14(0x04)
	int32_t CloseLossKillBonus; // 0xe18(0x04)
	char pad_E1C[0x4]; // 0xe1c(0x04)
	struct TArray<struct FInsuranceRewards> InsuranceRewards; // 0xe20(0x10)
	struct FString Close Loss Reward Name; // 0xe30(0x10)
	int32_t ComputedUltimatePointsForKill; // 0xe40(0x04)
	char pad_E44[0x4]; // 0xe44(0x04)
	struct ABombDetonationActor_C* BombDetonationActor; // 0xe48(0x08)
	struct FMulticastInlineDelegate OnDefendersWipe; // 0xe50(0x10)
	struct FMulticastInlineDelegate OnAttackersWipe; // 0xe60(0x10)
	struct UAudBombGameModeVOComponent_C* AudBombGameModeVOComponent; // 0xe70(0x08)
	double InitialEquippableCooldownOnRoundStart; // 0xe78(0x08)
	int32_t BombPlanterUltimatePointReward; // 0xe80(0x04)
	int32_t BombDefuserUltimatePointReward; // 0xe84(0x04)
	struct FMulticastInlineDelegate AuthSideSwitchEvent; // 0xe88(0x10)
	double New Time Out Time; // 0xe98(0x08)
	bool IsFirstRoundOnSide; // 0xea0(0x01)
	bool IsGameserverLoggingEnabled; // 0xea1(0x01)
	char pad_EA2[0x6]; // 0xea2(0x06)
	struct UBaseAudioComponent_C* Aud_BombGameMode; // 0xea8(0x08)
	struct TArray<struct AGameObject*> BuyDomes; // 0xeb0(0x10)
	struct ABaseCeremony_C* AceCeremony; // 0xec0(0x08)
	struct TSoftClassPtr<UObject> BasePistolClass; // 0xec8(0x30)
	struct TArray<struct AAresItem*> DroppedBasePistols; // 0xef8(0x10)
	int32_t MaxOnGroundBasePistols; // 0xf08(0x04)
	char pad_F0C[0x4]; // 0xf0c(0x04)
	struct FClassInclusionExclusionFilter DeletableOnGroundEquippable; // 0xf10(0x50)
	struct FMulticastInlineDelegate BuyPhaseStarted; // 0xf60(0x10)
	char DefaultTickRate; // 0xf70(0x01)
	char PreRoundTickRate; // 0xf71(0x01)
	bool IsRedTeamAllAFK; // 0xf72(0x01)
	bool IsBlueTeamAllAFK; // 0xf73(0x01)
	char pad_F74[0x4]; // 0xf74(0x04)
	struct TArray<struct AShooterPlayerState*> LightArmorGrantsForDisconnects; // 0xf78(0x10)
	struct TMap<struct UBaseTeamComponent*, int32_t> UltOrbGrantsForDisconnects; // 0xf88(0x50)
	bool HasPendingDisconnectGrants; // 0xfd8(0x01)
	bool BombPlantPhaseStarted; // 0xfd9(0x01)
	bool IsStoreEnabled; // 0xfda(0x01)
	bool ShouldSpawnBomb; // 0xfdb(0x01)
	bool ShouldTrackPistolDropsForDeletion; // 0xfdc(0x01)
	char pad_FDD[0x3]; // 0xfdd(0x03)
	double MatchTimeoutQueued; // 0xfe0(0x08)
	struct UBaseTeamComponent* LastRoundWinningTeam; // 0xfe8(0x08)
	struct ABombEquippable_C* BombEquippableActor; // 0xff0(0x08)
	struct FMulticastInlineDelegate InitializeTimeoutStateMachine; // 0xff8(0x10)
	struct FMulticastInlineDelegate QueueTimeout; // 0x1008(0x10)
	struct AShooterPlayerState* MatchTimeoutCallingPlayer; // 0x1018(0x08)
	struct FMulticastInlineDelegate CancelTimeout; // 0x1020(0x10)
	bool MatchTimeoutWasStoreEnabled; // 0x1030(0x01)
	bool NewVar_1; // 0x1031(0x01)
	bool SwitchingSide_VO; // 0x1032(0x01)
	bool MatchPoint_VO; // 0x1033(0x01)
	char pad_1034[0x4]; // 0x1034(0x04)
	struct FTimerHandle OvertimeCheatTimerHandle; // 0x1038(0x08)
	struct FTimerHandle AdvanceNumRoundsCheatTimerHandle; // 0x1040(0x08)
	int32_t AdvanceNumRoundsCheatTotalStartPoints; // 0x1048(0x04)
	bool DisableVandalRound2; // 0x104c(0x01)
	char pad_104D[0x3]; // 0x104d(0x03)
	struct TArray<struct TSoftClassPtr<UObject>> AllowedWeapons; // 0x1050(0x10)
	struct FMulticastInlineDelegate OnPostRoundEnded; // 0x1060(0x10)
	struct FMulticastInlineDelegate OnPostRoundPreExit; // 0x1070(0x10)
	struct UInteractableUserComponent* FurthestProgressCharacter; // 0x1080(0x08)
	struct FName RoundWinReasonAttacker; // 0x1088(0x0c)
	struct FName RoundWinReasonDefender; // 0x1094(0x0c)
	double MinTimeRemainingForDisplayOnDefuse; // 0x10a0(0x08)

	void Clean Up Round(enum class EAresRoundOutcome RoundResult, struct UBaseTeamComponent* WinningTeam, struct FName Reason); // Function BombGameMode.BombGameMode_C.Clean Up Round // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Bomb Defused Round Cleanup(struct AShooterCharacter* DefusingCharacter, bool& BombStateSet); // Function BombGameMode.BombGameMode_C.Bomb Defused Round Cleanup // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	bool Did Bomb Defuser Die(); // Function BombGameMode.BombGameMode_C.Did Bomb Defuser Die // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void CheatAdvanceRoundsEnd(struct FTimerHandle TickTimerToInvalidate); // Function BombGameMode.BombGameMode_C.CheatAdvanceRoundsEnd // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
