// AnimBlueprintGeneratedClass Gun_Core_AnimGraph.Gun_Core_AnimGraph_C
// Size: 0xdc8 (Inherited: 0x650)
struct UGun_Core_AnimGraph_C : UAresEquippableAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x650(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x658(0x3c)
	char pad_694[0x4]; // 0x694(0x04)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x698(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x6a0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x6a8(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6c8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x710(0x50)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x760(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x788(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x7b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x7d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x800(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x828(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x850(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x878(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x8a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x8c8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x8f0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x938(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x958(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x9a0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x9c0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xa08(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xa28(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xa50(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xa98(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xab8(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb00(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xb20(0x100)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xc20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xc48(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xc70(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xc90(0x20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xcb0(0x100)
	struct FRotator Mag Rotator; // 0xdb0(0x18)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_726F55D849CAB9F2A220028F7BA34583(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_726F55D849CAB9F2A220028F7BA34583 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_58C9D93647361ED4692365A1B7A41E28(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_58C9D93647361ED4692365A1B7A41E28 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_A72B59154A8B2EB81A13E2936FD8F66E(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_A72B59154A8B2EB81A13E2936FD8F66E // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_2788A6924E95629BD64503A579686CF1(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_2788A6924E95629BD64503A579686CF1 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_67946DB844AB61D55E44788C36AFB620(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_67946DB844AB61D55E44788C36AFB620 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_43001C0443F069826F4CEFA06FD3F618(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_43001C0443F069826F4CEFA06FD3F618 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_1AA5BACA4DE468EF0D6720BCADBB2A89(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_1AA5BACA4DE468EF0D6720BCADBB2A89 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_6C93831C4669CF5EB2FB0CA5FC3FE0D6(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_6C93831C4669CF5EB2FB0CA5FC3FE0D6 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_62052FB4451E181A0BB0589D5369EEE7(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_62052FB4451E181A0BB0589D5369EEE7 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_D6AAAC8B48AD5CF7EF6EEEBFF7945E9D(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_D6AAAC8B48AD5CF7EF6EEEBFF7945E9D // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_C08E10B94EF91C96D68296B576FF1887(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_C08E10B94EF91C96D68296B576FF1887 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_EEAEAD544AF8176A5844A3BCFEBF7617(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_EEAEAD544AF8176A5844A3BCFEBF7617 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_928D2B1843F8C149C20CFCB0732A1CFC(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_928D2B1843F8C149C20CFCB0732A1CFC // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_53F520A046EEE557E0D36EAECCB78E13(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_53F520A046EEE557E0D36EAECCB78E13 // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_6E49144E4628E9C630857FB8EBD7BCFD(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_6E49144E4628E9C630857FB8EBD7BCFD // (BlueprintEvent) // @ game+0x19be2f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_C80A33EF412C68E180B5D2A8FD073655(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_C80A33EF412C68E180B5D2A8FD073655 // (BlueprintEvent) // @ game+0x19be2f0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void ExecuteUbergraph_Gun_Core_AnimGraph(int32_t EntryPoint); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.ExecuteUbergraph_Gun_Core_AnimGraph // (Final|UbergraphFunction) // @ game+0x19be2f0
};

