// WidgetBlueprintGeneratedClass PlayerFacingPerfGraphGroup.PlayerFacingPerfGraphGroup_C
// Size: 0x540 (Inherited: 0x318)
struct UPlayerFacingPerfGraphGroup_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* ATB; // 0x320(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* AvailablePhysicalMemory; // 0x328(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* ClientFPS; // 0x330(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* ClientIncomingMoveProcessingDelay; // 0x338(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* ConsecutiveForwardPredictions; // 0x340(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* CPUTime; // 0x348(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* DownloadBytes; // 0x350(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* FiringandMovementShotError; // 0x358(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* FrameCount; // 0x360(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* FullEndtoEndLatency; // 0x368(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* GPURenderTime; // 0x370(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* GPUTime; // 0x378(0x08)
	struct USizeBox* GraphBox11; // 0x380(0x08)
	struct USizeBox* GraphBox12; // 0x388(0x08)
	struct USizeBox* GraphBox21; // 0x390(0x08)
	struct USizeBox* GraphBox22; // 0x398(0x08)
	struct USizeBox* GraphBox31; // 0x3a0(0x08)
	struct USizeBox* GraphBox32; // 0x3a8(0x08)
	struct USizeBox* GraphBox41; // 0x3b0(0x08)
	struct USizeBox* GraphBox42; // 0x3b8(0x08)
	struct USizeBox* GraphBox51; // 0x3c0(0x08)
	struct USizeBox* GraphBox52; // 0x3c8(0x08)
	struct USizeBox* GraphBox61; // 0x3d0(0x08)
	struct USizeBox* GraphBox62; // 0x3d8(0x08)
	struct USizeBox* GraphBox71; // 0x3e0(0x08)
	struct USizeBox* GraphBox72; // 0x3e8(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* IdleFrameTime; // 0x3f0(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* IncomingPacketLossPercent; // 0x3f8(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* IncomingPacketSizeAvg+Max; // 0x400(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* InputLatencyCPU; // 0x408(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* InputLatencyCPU+GPU; // 0x410(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* InputLatencyGPU; // 0x418(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* InputLatencyPresentDelay; // 0x420(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* MoveCorrectionDistance; // 0x428(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* MoveTimelineShiftMs; // 0x430(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* NetworkJitter; // 0x438(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* NetworkRTT; // 0x440(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* OutgoingInputQueueLength_6; // 0x448(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* OutgoingMoveQueueLength; // 0x450(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* OutgoingPacketLossPercent; // 0x458(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* OutgoingPacketSizeAvg+Max; // 0x460(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* PacketLossPercent; // 0x468(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* PacketsLost; // 0x470(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* PacketsLostIncoming; // 0x478(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* PacketsLostOutgoing; // 0x480(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* QueuedRemoteMoves; // 0x488(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* ReceivedEquippableCorrection; // 0x490(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* ReceivedPackets; // 0x498(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* RemoteInterpDelay; // 0x4a0(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* RenderWaitTime; // 0x4a8(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* RHITime; // 0x4b0(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* SentPackets; // 0x4b8(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* ServerFPS; // 0x4c0(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* ServerIncomingMoveProcessingDelay; // 0x4c8(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* TotalFrameTime; // 0x4d0(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* TotalLatencyMs; // 0x4d8(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* TotalSlopMs; // 0x4e0(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* TotalTransferredBytes; // 0x4e8(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* TotalWorkMs; // 0x4f0(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* UploadBytes; // 0x4f8(0x08)
	struct UPlayerFacingPerfGraphWrapper_C* UsedPhysicalMemory; // 0x500(0x08)
	struct TArray<struct USizeBox*> Boxes; // 0x508(0x10)
	bool Debug Show All; // 0x518(0x01)
	char pad_519[0x7]; // 0x519(0x07)
	struct TArray<struct UPlayerFacingPerfGraphWrapper_C*> AllGraphs; // 0x520(0x10)
	struct TArray<struct UPlayerFacingPerfGraphWrapper_C*> ActiveGraphs; // 0x530(0x10)

	void Update All Graph Settings(struct TArray<struct UPlayerFacingPerfGraph_C*>& Enabled Graphs); // Function PlayerFacingPerfGraphGroup.PlayerFacingPerfGraphGroup_C.Update All Graph Settings // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void SetGraphIsEnabled(struct UAresSettingsManager* SettingsManager, enum class EAresIntSettingName SettingsName, struct UPlayerFacingPerfGraph_C* Graph, bool& Is Enabled); // Function PlayerFacingPerfGraphGroup.PlayerFacingPerfGraphGroup_C.SetGraphIsEnabled // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnSettingsChanged(enum class EAresIntSettingName Setting, int32_t Old Value, int32_t New Value); // Function PlayerFacingPerfGraphGroup.PlayerFacingPerfGraphGroup_C.OnSettingsChanged // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Fill Boxes(); // Function PlayerFacingPerfGraphGroup.PlayerFacingPerfGraphGroup_C.Fill Boxes // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnInitialized(); // Function PlayerFacingPerfGraphGroup.PlayerFacingPerfGraphGroup_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void ExecuteUbergraph_PlayerFacingPerfGraphGroup(int32_t EntryPoint); // Function PlayerFacingPerfGraphGroup.PlayerFacingPerfGraphGroup_C.ExecuteUbergraph_PlayerFacingPerfGraphGroup // (Final|UbergraphFunction|HasDefaults) // @ game+0x19be2f0
};

