// WidgetBlueprintGeneratedClass PurchaseConfirm.PurchaseConfirm_C
// Size: 0x5c8 (Inherited: 0x318)
struct UPurchaseConfirm_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UWidgetAnimation* Intro; // 0x320(0x08)
	struct UCurrencyAmountWidgetLarge_C* ActualPrice; // 0x328(0x08)
	struct UTextBlock* AdditionalInfoText; // 0x330(0x08)
	struct UImage* ArrowLeft_2; // 0x338(0x08)
	struct UImage* ArrowRight_2; // 0x340(0x08)
	struct UImage* Background; // 0x348(0x08)
	struct USharedBackButton_C* BrowserCloseButton; // 0x350(0x08)
	struct UBundlePreviewWidget_C* BundlePreviewWidget; // 0x358(0x08)
	struct USizeBox* BundleSizeBox; // 0x360(0x08)
	struct UHorizontalBox* BundleWarningBox; // 0x368(0x08)
	struct UHorizontalBox* BundleWarningBox_2; // 0x370(0x08)
	struct USharedClickableCheckboxButton_C* BundleWarningCheckbox; // 0x378(0x08)
	struct USharedClickableCheckboxButton_C* BundleWarningCheckbox_2; // 0x380(0x08)
	struct UTextBlock* BundleWarningText; // 0x388(0x08)
	struct UTextBlock* BundleWarningText_2; // 0x390(0x08)
	struct UOverlay* ConfirmOverlay; // 0x398(0x08)
	struct UVerticalBox* ContractLevelPreviewBox; // 0x3a0(0x08)
	struct UTextBlock* ContractUnlockPreview; // 0x3a8(0x08)
	struct UCurrencyAmountWidgetLarge_C* CostAmount; // 0x3b0(0x08)
	struct UOverlay* CostBox; // 0x3b8(0x08)
	struct USpacer* CostSpacer; // 0x3c0(0x08)
	struct UTextBlock* CostText; // 0x3c8(0x08)
	struct UImage* DecoLeft; // 0x3d0(0x08)
	struct UImage* DecoRight; // 0x3d8(0x08)
	struct UImage* Diamond; // 0x3e0(0x08)
	struct UTextBlock* Discount; // 0x3e8(0x08)
	struct UCurrencyAmountWidgetLarge_C* DiscountAmount; // 0x3f0(0x08)
	struct UOverlay* DiscountWidgets; // 0x3f8(0x08)
	struct UOverlay* DivideLine; // 0x400(0x08)
	struct UImage* Divider; // 0x408(0x08)
	struct UImage* DotLeft; // 0x410(0x08)
	struct UImage* DotRight; // 0x418(0x08)
	struct UTextBlock* DoughLimitText; // 0x420(0x08)
	struct UHorizontalBox* DoughLimitWarning; // 0x428(0x08)
	struct UHorizontalBox* DoughWarningBox; // 0x430(0x08)
	struct USharedClickableCheckboxButton_C* DoughWarningCheckbox; // 0x438(0x08)
	struct URichTextBlock* DoughWarningTextbox; // 0x440(0x08)
	struct UImage* Exclamation; // 0x448(0x08)
	struct UImage* ExclamationAdd; // 0x450(0x08)
	struct UCurrencyAmountWidgetLarge_C* FinalBalanceAmount; // 0x458(0x08)
	struct UHorizontalBox* FinalBalanceBox; // 0x460(0x08)
	struct UTextBlock* FinalBalanceText; // 0x468(0x08)
	struct UImage* FocusTint; // 0x470(0x08)
	struct UHighlightedRewards_C* HighlightedRewards; // 0x478(0x08)
	struct UImage* Image_281; // 0x480(0x08)
	struct UTextBlock* InsufficientAPTextLarge; // 0x488(0x08)
	struct UHorizontalBox* InsufficientFundWarning; // 0x490(0x08)
	struct UVerticalBox* ItemUnlockContainer; // 0x498(0x08)
	struct UTextBlock* ItemUnlockPreview; // 0x4a0(0x08)
	struct UCurrencyAmountWidgetLarge_C* MissingCurrencyAmount; // 0x4a8(0x08)
	struct UWidgetSwitcher* PreviewSwitcher; // 0x4b0(0x08)
	struct UOverlay* Price; // 0x4b8(0x08)
	struct UPurchaseConfirmButtons_C* PurchaseConfirmButtons; // 0x4c0(0x08)
	struct UOverlay* RefundPolicyInfoOverlay; // 0x4c8(0x08)
	struct UTextBlock* RefundPolicyInfoText; // 0x4d0(0x08)
	struct USharedHyperlinkButon_C* RefundPolicyLinkButton; // 0x4d8(0x08)
	struct URewardPreviewWidget_C* RewardPreviewWidget; // 0x4e0(0x08)
	struct URichTextBlock* RichTextBlock_207; // 0x4e8(0x08)
	struct USharedBackButton_C* SharedBackButton; // 0x4f0(0x08)
	struct USizeBox* SingleItemSizeBox; // 0x4f8(0x08)
	struct UStorepopupBacking_C* StorepopupBacking; // 0x500(0x08)
	struct UWidgetSwitcher* Switcher; // 0x508(0x08)
	struct UHorizontalBox* TermsAndConditionsBox; // 0x510(0x08)
	struct USharedHyperlinkButon_C* TermsAndConditionsButton; // 0x518(0x08)
	struct USharedClickableCheckboxButton_C* TermsAndConditionsCheckbox; // 0x520(0x08)
	struct UImage* TierBgLeft; // 0x528(0x08)
	struct UImage* TierBgRight; // 0x530(0x08)
	struct UTierIcon_C* TierIcon; // 0x538(0x08)
	struct UHorizontalBox* TierInfo; // 0x540(0x08)
	struct UImage* unlockIcon; // 0x548(0x08)
	struct UImage* UpgradeCurrencyImage; // 0x550(0x08)
	struct UOverlay* UpgradeCurrencyPreview; // 0x558(0x08)
	struct UTextBlock* UpgradeCurrencyText; // 0x560(0x08)
	struct UWidgetSwitcher* WarningSwitcher; // 0x568(0x08)
	struct UWBP_DigitalGoodLicenseText_C* WBP_DigitalGoodLicenseText; // 0x570(0x08)
	struct UOverlay* WebBrowserOverlay; // 0x578(0x08)
	struct UWebBrowser* WebBrowserWidget; // 0x580(0x08)
	struct FMulticastInlineDelegate OnUnlockClicked; // 0x588(0x10)
	struct FMulticastInlineDelegate OnCancelClicked; // 0x598(0x10)
	struct UPurchaseModalViewModel* ViewModel; // 0x5a8(0x08)
	struct UPurchaseModalViewController* ViewController; // 0x5b0(0x08)
	struct UMaterialInstanceDynamic* ExclamationAddMaterial; // 0x5b8(0x08)
	struct UMaterialInstanceDynamic* TierIconAdditiveMaterial; // 0x5c0(0x08)

	void SequenceEvent__ENTRYPOINTPurchaseConfirm(); // Function PurchaseConfirm.PurchaseConfirm_C.SequenceEvent__ENTRYPOINTPurchaseConfirm // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void ShouldShowRefundPolicy(bool& ShouldShow); // Function PurchaseConfirm.PurchaseConfirm_C.ShouldShowRefundPolicy // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void ShowCheckboxesIfConditionsMet(); // Function PurchaseConfirm.PurchaseConfirm_C.ShowCheckboxesIfConditionsMet // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void CollapseAllCheckboxes(); // Function PurchaseConfirm.PurchaseConfirm_C.CollapseAllCheckboxes // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void ShouldShowFinalBalanceWarning(bool& ShouldShowFinalBalanceWarning); // Function PurchaseConfirm.PurchaseConfirm_C.ShouldShowFinalBalanceWarning // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void PreviewContractLevelsPurchase(); // Function PurchaseConfirm.PurchaseConfirm_C.PreviewContractLevelsPurchase // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void ShouldShowDoughConfirmation(bool& PurchaseForDough); // Function PurchaseConfirm.PurchaseConfirm_C.ShouldShowDoughConfirmation // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void UpdatePurchaseTermsAccepted(); // Function PurchaseConfirm.PurchaseConfirm_C.UpdatePurchaseTermsAccepted // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void DisplaySkinlineUI(struct UEquippableSkinHandle* SkinHandle); // Function PurchaseConfirm.PurchaseConfirm_C.DisplaySkinlineUI // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void AreTermsAndConditionsEnabled(bool& TermsAndConditionsEnabled); // Function PurchaseConfirm.PurchaseConfirm_C.AreTermsAndConditionsEnabled // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void IsBundlePurchase(bool& IsBundlePurchase); // Function PurchaseConfirm.PurchaseConfirm_C.IsBundlePurchase // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void UpdatePurchaseButtonHeaderOverlay(); // Function PurchaseConfirm.PurchaseConfirm_C.UpdatePurchaseButtonHeaderOverlay // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void HandleConfigUpdate(struct FName& InName); // Function PurchaseConfirm.PurchaseConfirm_C.HandleConfigUpdate // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void IsPurchasingWithValorantPoints(bool& IsValorantPointPurchase); // Function PurchaseConfirm.PurchaseConfirm_C.IsPurchasingWithValorantPoints // (Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void ArePurchaseTermsAccepted(bool& TermsAccepted); // Function PurchaseConfirm.PurchaseConfirm_C.ArePurchaseTermsAccepted // (Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void GetWalletBalance(int32_t& RemainingWalletBalance, bool& PlayerHasSufficientFunds); // Function PurchaseConfirm.PurchaseConfirm_C.GetWalletBalance // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void SequenceEvent_1(); // Function PurchaseConfirm.PurchaseConfirm_C.SequenceEvent_1 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void PreviewCost(); // Function PurchaseConfirm.PurchaseConfirm_C.PreviewCost // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void PreviewDiscount(); // Function PurchaseConfirm.PurchaseConfirm_C.PreviewDiscount // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnStorefrontItemLoaded(struct UStorefrontItemHandle* StorefrontItem); // Function PurchaseConfirm.PurchaseConfirm_C.OnStorefrontItemLoaded // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void PreviewPurchase(); // Function PurchaseConfirm.PurchaseConfirm_C.PreviewPurchase // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnWalletUpdated(); // Function PurchaseConfirm.PurchaseConfirm_C.OnWalletUpdated // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	int32_t GetCostAmount(); // Function PurchaseConfirm.PurchaseConfirm_C.GetCostAmount // (Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x19be2f0
	void Initialize(struct UPurchaseModalViewModel* ViewModel, struct UPurchaseModalViewController* ViewController); // Function PurchaseConfirm.PurchaseConfirm_C.Initialize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Construct(); // Function PurchaseConfirm.PurchaseConfirm_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void PreConstruct(bool IsDesignTime); // Function PurchaseConfirm.PurchaseConfirm_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SharedBackButton_K2Node_ComponentBoundEvent_2_OnBackRequested__DelegateSignature(); // Function PurchaseConfirm.PurchaseConfirm_C.BndEvt__SharedBackButton_K2Node_ComponentBoundEvent_2_OnBackRequested__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__BundleWarningCheckbox_K2Node_ComponentBoundEvent_1_OnCheckedChanged__DelegateSignature(bool NewState); // Function PurchaseConfirm.PurchaseConfirm_C.BndEvt__BundleWarningCheckbox_K2Node_ComponentBoundEvent_1_OnCheckedChanged__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__TermsAndConditionsButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(); // Function PurchaseConfirm.PurchaseConfirm_C.BndEvt__TermsAndConditionsButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__BrowserCloseButton_K2Node_ComponentBoundEvent_5_OnBackRequested__DelegateSignature(); // Function PurchaseConfirm.PurchaseConfirm_C.BndEvt__BrowserCloseButton_K2Node_ComponentBoundEvent_5_OnBackRequested__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__TermsAndConditionsCheckbox_K2Node_ComponentBoundEvent_6_OnCheckedChanged__DelegateSignature(bool NewState); // Function PurchaseConfirm.PurchaseConfirm_C.BndEvt__TermsAndConditionsCheckbox_K2Node_ComponentBoundEvent_6_OnCheckedChanged__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void OnAnyConfigUpdated(struct FName& ConfigName); // Function PurchaseConfirm.PurchaseConfirm_C.OnAnyConfigUpdated // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnUnlockedClicked(); // Function PurchaseConfirm.PurchaseConfirm_C.OnUnlockedClicked // (BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__PurchaseConfirm_DoughWarningCheckbox_K2Node_ComponentBoundEvent_0_OnCheckedChanged__DelegateSignature(bool NewState); // Function PurchaseConfirm.PurchaseConfirm_C.BndEvt__PurchaseConfirm_DoughWarningCheckbox_K2Node_ComponentBoundEvent_0_OnCheckedChanged__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void ExecuteUbergraph_PurchaseConfirm(int32_t EntryPoint); // Function PurchaseConfirm.PurchaseConfirm_C.ExecuteUbergraph_PurchaseConfirm // (Final|UbergraphFunction) // @ game+0x19be2f0
	void OnCancelClicked__DelegateSignature(); // Function PurchaseConfirm.PurchaseConfirm_C.OnCancelClicked__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnUnlockClicked__DelegateSignature(); // Function PurchaseConfirm.PurchaseConfirm_C.OnUnlockClicked__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
};

