// WidgetBlueprintGeneratedClass SettingsListV2.SettingsListV2_C
// Size: 0x6c0 (Inherited: 0x318)
struct USettingsListV2_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UWidgetAnimation* floatAbout; // 0x320(0x08)
	struct USizeBox* ADSSizeBox; // 0x328(0x08)
	struct USharedNavButton_C* AudioNavButton; // 0x330(0x08)
	struct UBorder* AudioSettingsContainer; // 0x338(0x08)
	struct UWidgetSwitcher* AudioWidgetSwitcher; // 0x340(0x08)
	struct UImage* BGCopyPrimaryCrosshair; // 0x348(0x08)
	struct UCharacterSettingsSelectorWidgetV2_C* CharacterSettingsSelectorWidgetV2; // 0x350(0x08)
	struct UBorder* CommandsContainer; // 0x358(0x08)
	struct USharedNavButton_C* CommandsNavButton; // 0x360(0x08)
	struct UOverlay* CommandsNavButtonGroup; // 0x368(0x08)
	struct UConflictsNotificationWidget_C* ConflictsNotificationWidget; // 0x370(0x08)
	struct UBorder* ControlsContainer; // 0x378(0x08)
	struct USharedNavButton_C* ControlsNavButton; // 0x380(0x08)
	struct UOverlay* ControlsNavButtonGroup; // 0x388(0x08)
	struct UControlsSettings_C* ControlsSettings; // 0x390(0x08)
	struct UBoolSettingsWidget_C* CopyPrimaryCrosshair; // 0x398(0x08)
	struct UOverlay* CopyPrimaryCrosshairOverlay; // 0x3a0(0x08)
	struct UCrosshair_ProfilesBar_C* Crosshair_ProfilesBar; // 0x3a8(0x08)
	struct UCrosshairSettingsTabWidget_C* CrosshairADSSettingsTabWidget; // 0x3b0(0x08)
	struct UButton* CrosshairAlignmentButton; // 0x3b8(0x08)
	struct UMenuAnchor* CrosshairAlignmentTooltip; // 0x3c0(0x08)
	struct USharedNavButton_C* CrosshairNavButton; // 0x3c8(0x08)
	struct UOverlay* CrosshairNavButtonGroup; // 0x3d0(0x08)
	struct UImage* crosshairPreviewBackground; // 0x3d8(0x08)
	struct UCrosshairPreviewCardWidget_C* CrosshairPreviewCardWidget; // 0x3e0(0x08)
	struct UCrosshairPreviewCardWidget_ADS_C* CrosshairPreviewCardWidget_ADS; // 0x3e8(0x08)
	struct UCrosshairPreviewCardWidget_SniperScope_C* CrosshairPreviewCardWidget_SniperScope; // 0x3f0(0x08)
	struct USharedTertiaryButtonText_C* CrosshairResetToDefaultButton; // 0x3f8(0x08)
	struct UBorder* CrosshairSettingsContainer; // 0x400(0x08)
	struct UCrosshairSettingsTab_General_C* CrosshairSettingsTab_General; // 0x408(0x08)
	struct UCrosshairSettingsTab_SniperScope_C* CrosshairSettingsTab_SniperScope; // 0x410(0x08)
	struct UCrosshairSettingsTabWidget_C* CrosshairSettingsTabWidget; // 0x418(0x08)
	struct UWidgetSwitcher* CrosshairSettingsWidgetSwitcher; // 0x420(0x08)
	struct UOverlay* CrosshairSubMenuOverlay; // 0x428(0x08)
	struct USharedNavButton_C* GameplayNavButton; // 0x430(0x08)
	struct UOverlay* GameplayNavButtonGroup; // 0x438(0x08)
	struct UGameplaySettingsTabWidget_C* GameplaySettingsTabWidget; // 0x440(0x08)
	struct UBorder* GameSettingsContainer; // 0x448(0x08)
	struct UWidgetSwitcher* GameSettingsWidgetSwitcher; // 0x450(0x08)
	struct UVerticalBox* GeneralAudioSettingsContainer; // 0x458(0x08)
	struct UGeneralAudioSettingsTabWidget_C* GeneralAudioSettingsTabWidget; // 0x460(0x08)
	struct UVerticalBox* GeneralVideoContainer; // 0x468(0x08)
	struct UGeneralVideoSettingsTabWidget_C* GeneralVideoSettingsTabWidget; // 0x470(0x08)
	struct UVerticalBox* GeneralViewingSettingsContainer; // 0x478(0x08)
	struct USharedTertiaryButtonText_C* ImportPrimarySettingsButton; // 0x480(0x08)
	struct UKeybindCategoryErrorIndicatorWidget_C* InterfaceControlsCategeryErrorIcon; // 0x488(0x08)
	struct UOverlay* LHSPreviewOverlay; // 0x490(0x08)
	struct UImage* Line; // 0x498(0x08)
	struct UMenuOrnament_C* MenuOrnament; // 0x4a0(0x08)
	struct UBorder* ModifiersContainer; // 0x4a8(0x08)
	struct USharedNavButton_C* ModifiersNavButton; // 0x4b0(0x08)
	struct UOverlay* ModifiersNavButtonGroup; // 0x4b8(0x08)
	struct UModifiersScreen_C* ModifiersScreen; // 0x4c0(0x08)
	struct UNamedSlot* NamedSlot; // 0x4c8(0x08)
	struct UNamedSlot* NamedSlot_1; // 0x4d0(0x08)
	struct UNamedSlot* NamedSlot_2; // 0x4d8(0x08)
	struct UNamedSlot* NamedSlot_3; // 0x4e0(0x08)
	struct UOverlay* NamedSlotGroup; // 0x4e8(0x08)
	struct USharedTertiaryButtonText_C* PauseButton; // 0x4f0(0x08)
	struct UVerticalBox* QualityVideoContainer; // 0x4f8(0x08)
	struct UQualityVideoSettingsTabWidget_C* QualityVideoSettingsTabWidget; // 0x500(0x08)
	struct UOverlay* RHSPreviewOverlay; // 0x508(0x08)
	struct USharedNavButton_C* SettingsCrosshairADSNavButton; // 0x510(0x08)
	struct USharedNavButton_C* SettingsCrosshairGeneralNavButton; // 0x518(0x08)
	struct USharedNavButton_C* SettingsCrosshairPrimaryNavButton; // 0x520(0x08)
	struct USharedNavButton_C* SettingsCrosshairSniperNavButton; // 0x528(0x08)
	struct UHorizontalBox* SettingsNavigationButtons; // 0x530(0x08)
	struct USharedNavButton_C* SettingsSound1NavButton; // 0x538(0x08)
	struct USharedNavButton_C* SettingsSound2NavButton; // 0x540(0x08)
	struct USharedNavButton_C* SettingsVideo1NavButton; // 0x548(0x08)
	struct USharedNavButton_C* SettingsVideo2NavButton; // 0x550(0x08)
	struct USharedNavButton_C* SettingsVideo3NavButton; // 0x558(0x08)
	struct USharedNavButton_C* SettingsViewingControlsSubheaderButton; // 0x560(0x08)
	struct USharedNavButton_C* SettingsViewingGeneralSubheaderButton; // 0x568(0x08)
	struct UWidgetSwitcher* SettingWindow; // 0x570(0x08)
	struct USharedNavButton_C* SharedNavButton_C_140; // 0x578(0x08)
	struct USizeBox* SniperSizeBox; // 0x580(0x08)
	struct UVerticalBox* StatsVideoContainer; // 0x588(0x08)
	struct UStatsVideoSettingsTabWidget_C* StatsVideoSettingsTabWidget; // 0x590(0x08)
	struct USharedNavButton_C* TeamNavButton; // 0x598(0x08)
	struct UOverlay* TeamNavButtonGroup; // 0x5a0(0x08)
	struct UBorder* TeamSettingsContainer; // 0x5a8(0x08)
	struct UTeamSocialSettings_C* TeamSocialSettings; // 0x5b0(0x08)
	struct UUtilityMenuButton_C* UtilityMenuButton; // 0x5b8(0x08)
	struct USharedNavButton_C* VideoNavButton; // 0x5c0(0x08)
	struct UOverlay* VideoNavButtonGroup; // 0x5c8(0x08)
	struct UBorder* VideoSettingsContainer; // 0x5d0(0x08)
	struct UWidgetSwitcher* VideoWidgetSwitcher; // 0x5d8(0x08)
	struct UVerticalBox* ViewingControlsSettingsContainer; // 0x5e0(0x08)
	struct UViewingControlsSettingsTabWidget_C* ViewingControlsSettingsTabWidget; // 0x5e8(0x08)
	struct USharedNavButton_C* ViewingNavButton; // 0x5f0(0x08)
	struct UOverlay* ViewingNavButtonGroup; // 0x5f8(0x08)
	struct UBorder* ViewingSettingsContainer; // 0x600(0x08)
	struct UViewingSettingsTabWidget_C* ViewingSettingsTabWidget; // 0x608(0x08)
	struct UWidgetSwitcher* ViewingWidgetSwitcher; // 0x610(0x08)
	struct USharedButtonMaster_C* VoiceChatControlsLink; // 0x618(0x08)
	struct UVerticalBox* VoiceChatSettingsContainer; // 0x620(0x08)
	struct UVoiceChatSettingsTabWidget_C* VoiceChatSettingsTabWidget; // 0x628(0x08)
	struct USharedNavButton_C* VoiceChatSubheaderButton; // 0x630(0x08)
	struct UVerticalBox* VoiceoverSettingsContainer; // 0x638(0x08)
	struct UVoiceoverSettingsTabWidget_C* VoiceoverSettingsTabWidget; // 0x640(0x08)
	bool bIsPaused; // 0x648(0x01)
	char pad_649[0x7]; // 0x649(0x07)
	struct TMap<struct USharedNavButton_C*, struct UWidget*> CategoryToScreen; // 0x650(0x50)
	struct UConfirmResolutionSettingsModal_C* ResolutionConfirmationPopup; // 0x6a0(0x08)
	struct TArray<struct USharedNavButton_C*> NavButtonArray; // 0x6a8(0x10)
	struct USharedNavButton_C* LastSectionVisited; // 0x6b8(0x08)

	void OnConflictStatesUpdated(); // Function SettingsListV2.SettingsListV2_C.OnConflictStatesUpdated // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void SelectSpawnedCharacterForSettings(); // Function SettingsListV2.SettingsListV2_C.SelectSpawnedCharacterForSettings // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnUsePrimaryCrosshairForADSChanged(enum class EAresBoolSettingName SettingName, bool OldValue, bool NewValue); // Function SettingsListV2.SettingsListV2_C.OnUsePrimaryCrosshairForADSChanged // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void UpdateCopyPrimaryCrosshairSettingsButtonVisibility(); // Function SettingsListV2.SettingsListV2_C.UpdateCopyPrimaryCrosshairSettingsButtonVisibility // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void CopyPrimarySettingsToADS(); // Function SettingsListV2.SettingsListV2_C.CopyPrimarySettingsToADS // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnUseAdvancedOptionChanged(enum class EAresBoolSettingName SettingName, bool OldValue, bool NewValue); // Function SettingsListV2.SettingsListV2_C.OnUseAdvancedOptionChanged // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void ResetCrosshairSettingsToDefault(int32_t Index); // Function SettingsListV2.SettingsListV2_C.ResetCrosshairSettingsToDefault // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void UpdateCrosshairPreviewWidgetBox(int32_t SwitcherIndex); // Function SettingsListV2.SettingsListV2_C.UpdateCrosshairPreviewWidgetBox // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Should Show Crosshair Settings V2(bool& ShowUpdate); // Function SettingsListV2.SettingsListV2_C.Should Show Crosshair Settings V2 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void HandleRoamingFailure(); // Function SettingsListV2.SettingsListV2_C.HandleRoamingFailure // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	struct UWidget* On_CrosshairAlignmentTooltip_GetMenuContent_1(); // Function SettingsListV2.SettingsListV2_C.On_CrosshairAlignmentTooltip_GetMenuContent_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void DisableCommandButton(); // Function SettingsListV2.SettingsListV2_C.DisableCommandButton // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void DisableVoiceIfNeeded(); // Function SettingsListV2.SettingsListV2_C.DisableVoiceIfNeeded // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void SetNavButtonActive(struct USharedNavButton_C* PressedButton); // Function SettingsListV2.SettingsListV2_C.SetNavButtonActive // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void DisableNonGameFeatures(); // Function SettingsListV2.SettingsListV2_C.DisableNonGameFeatures // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void ShowModifiers(bool bHasModifiers); // Function SettingsListV2.SettingsListV2_C.ShowModifiers // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void InitModifiers(); // Function SettingsListV2.SettingsListV2_C.InitModifiers // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void InitButtonMap(); // Function SettingsListV2.SettingsListV2_C.InitButtonMap // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void SelectCategory(struct USharedNavButton_C* Button); // Function SettingsListV2.SettingsListV2_C.SelectCategory // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void UpdatePauseButtonText(bool bIsGamePaused); // Function SettingsListV2.SettingsListV2_C.UpdatePauseButtonText // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void SetDefaultBtnEnabled(); // Function SettingsListV2.SettingsListV2_C.SetDefaultBtnEnabled // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void RevertTempSettings(); // Function SettingsListV2.SettingsListV2_C.RevertTempSettings // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function SettingsListV2.SettingsListV2_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SharedTertiaryButtonText_K2Node_ComponentBoundEvent_698_OnClicked__DelegateSignature(struct USharedTertiaryButtonText_C* TextButton); // Function SettingsListV2.SettingsListV2_C.BndEvt__SharedTertiaryButtonText_K2Node_ComponentBoundEvent_698_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void OnInitialized(); // Function SettingsListV2.SettingsListV2_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__GameplayNavButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__GameplayNavButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__TeamNavButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__TeamNavButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__ControlsNavButton_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__ControlsNavButton_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__CrosshairNavButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__CrosshairNavButton_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__VideoNavButton_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__VideoNavButton_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__CommandsNavButton_K2Node_ComponentBoundEvent_13_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__CommandsNavButton_K2Node_ComponentBoundEvent_13_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__ModifiersNavButton_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__ModifiersNavButton_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__CrosshairResetToDefaultButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(struct USharedTertiaryButtonText_C* TextButton); // Function SettingsListV2.SettingsListV2_C.BndEvt__CrosshairResetToDefaultButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsVideo1NavButton_K2Node_ComponentBoundEvent_33_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsVideo1NavButton_K2Node_ComponentBoundEvent_33_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsVideo2NavButton_K2Node_ComponentBoundEvent_35_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsVideo2NavButton_K2Node_ComponentBoundEvent_35_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsSound1NavButton_K2Node_ComponentBoundEvent_37_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsSound1NavButton_K2Node_ComponentBoundEvent_37_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsVideo3NavButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsVideo3NavButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsSound2NavButton_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsSound2NavButton_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsSound3NavButton_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsSound3NavButton_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__VoiceChatControlsLink_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__VoiceChatControlsLink_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void On Opened(); // Function SettingsListV2.SettingsListV2_C.On Opened // (BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__AudioNavButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__AudioNavButton_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__DoneButton1_K2Node_ComponentBoundEvent_245_OnButtonPressedEvent__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__DoneButton1_K2Node_ComponentBoundEvent_245_OnButtonPressedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void Construct(); // Function SettingsListV2.SettingsListV2_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__Button_532_K2Node_ComponentBoundEvent_23_OnButtonHoverEvent__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__Button_532_K2Node_ComponentBoundEvent_23_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__CrosshairAlignmentButton_K2Node_ComponentBoundEvent_25_OnButtonHoverEvent__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__CrosshairAlignmentButton_K2Node_ComponentBoundEvent_25_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsCrosshairPrimaryNavButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsCrosshairPrimaryNavButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsCrosshairGeneralNavButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsCrosshairGeneralNavButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsCrosshairADSNavButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsCrosshairADSNavButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsCrosshairSniperNavButton_K2Node_ComponentBoundEvent_15_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsCrosshairSniperNavButton_K2Node_ComponentBoundEvent_15_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void SwitchToCrosshairPrimaryTab(); // Function SettingsListV2.SettingsListV2_C.SwitchToCrosshairPrimaryTab // (BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__ImportPrimarySettingsButton_K2Node_ComponentBoundEvent_21_OnPressed__DelegateSignature(struct USharedTertiaryButtonText_C* TextButton); // Function SettingsListV2.SettingsListV2_C.BndEvt__ImportPrimarySettingsButton_K2Node_ComponentBoundEvent_21_OnPressed__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void Destruct(); // Function SettingsListV2.SettingsListV2_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__CharacterSettingsSelectorWidgetV2_K2Node_ComponentBoundEvent_18_OnCharacterSelected__DelegateSignature(struct UCharacterHandle* CharacterHandle); // Function SettingsListV2.SettingsListV2_C.BndEvt__CharacterSettingsSelectorWidgetV2_K2Node_ComponentBoundEvent_18_OnCharacterSelected__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsListV2_ViewingNavButton_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsListV2_ViewingNavButton_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsListV2_SettingsViewingGeneralSubheaderButton_K2Node_ComponentBoundEvent_17_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsListV2_SettingsViewingGeneralSubheaderButton_K2Node_ComponentBoundEvent_17_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__SettingsListV2_SettingsViewingControlsSubheaderButton_K2Node_ComponentBoundEvent_19_OnClicked__DelegateSignature(); // Function SettingsListV2.SettingsListV2_C.BndEvt__SettingsListV2_SettingsViewingControlsSubheaderButton_K2Node_ComponentBoundEvent_19_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void ExecuteUbergraph_SettingsListV2(int32_t EntryPoint); // Function SettingsListV2.SettingsListV2_C.ExecuteUbergraph_SettingsListV2 // (Final|UbergraphFunction|HasDefaults) // @ game+0x19be2f0
};

