// Enum ShooterGame.EActionChordTapHoldType
enum class EActionChordTapHoldType : uint8 {
	None = 0,
	Tap = 1,
	Hold = 2,
	DoubleTap = 3,
	Count = 4,
	EActionChordTapHoldType_MAX = 5
};

// Enum ShooterGame.EActionTraitSettingConsoleWidgetSwitcherIndex
enum class EActionTraitSettingConsoleWidgetSwitcherIndex : uint8 {
	ActionChordWidget = 0,
	TextWidget = 1,
	Count = 2,
	EActionTraitSettingConsoleWidgetSwitcherIndex_MAX = 3
};

// Enum ShooterGame.EActionTraitSettingTexture
enum class EActionTraitSettingTexture : uint8 {
	CustomBindingTexture = 0,
	WarningTexture = 1,
	DangerTexture = 2,
	LockedTexture = 3,
	Count = 4,
	EActionTraitSettingTexture_MAX = 5
};

// Enum ShooterGame.ECharacterPortraitScreenEnum
enum class ECharacterPortraitScreenEnum : uint8 {
	None = 0,
	AgentsScreen = 1,
	AgentAbilities = 2,
	AgentPurchaseConfirmScreen = 3,
	AgentPurchaseCompleteScreen = 4,
	Invalid = 5,
	Count = 5,
	ECharacterPortraitScreenEnum_MAX = 6
};

// Enum ShooterGame.EAresTouchState
enum class EAresTouchState : uint8 {
	Unknown = 0,
	Pressed = 1,
	Active = 2,
	Released = 3,
	Entered = 4,
	Exited = 5,
	EAresTouchState_MAX = 6
};

// Enum ShooterGame.EAresBoolSettingName
enum class EAresBoolSettingName : uint8 {
	MouseInverted = 0,
	MouseWheelWrapsInventory = 1,
	MouseWheelIncludesLevelSlot = 2,
	ClientMuted = 3,
	RawMouseEnabled = 4,
	MinimapRotates = 5,
	MinimapFixedRotation = 6,
	MinimapTranslates = 7,
	EnableMinimapVisionCones = 8,
	EnableInstabilityIndicators = 9,
	ShowBulletTracers = 10,
	ImproveClarity = 11,
	AdaptiveSharpenEnabled = 12,
	DisableDistortion = 13,
	ShadowsEnabled = 14,
	VoiceChatEnabled = 15,
	TeamVoiceChatEnabled = 16,
	CustomPartyVoiceChatEnabled = 17,
	VoiceChat_ChannelToggle_MicEnabled = 18,
	VoiceChat_ChannelToggle_MicTeamEnabled = 19,
	VoiceChat_ChannelToggle_MicPartyEnabled = 20,
	VoiceChat_ChannelToggle_SpeakerEnabled = 21,
	VoiceChat_ChannelToggle_SpeakerTeamEnabled = 22,
	VoiceChat_ChannelToggle_SpeakerPartyEnabled = 23,
	LoopbackTestEnabled = 24,
	PushToTalkEnabled = 25,
	DisableEnhanced3DAudio = 26,
	GameplayVoiceEnabled = 27,
	CharacterVoiceEnabled = 28,
	TacticalCalloutsEnabled = 29,
	AutomatedTacticalCalloutsEnabled = 30,
	AllyAbilityEquipAudioEnabled = 31,
	VocalEmotesEnabled = 32,
	AnnouncerEnabled = 33,
	VignetteEnabled = 34,
	AutoRescopeSniper = 35,
	HoldInputForADS = 36,
	HoldInputForSniperScopes = 37,
	CycleThroughSniperZoomLevels = 38,
	SniperToggleHoldInputCycles = 39,
	LimitFramerateOnBattery = 40,
	LimitFramerateInMenu = 41,
	LimitFramerateInBackground = 42,
	LimitFramerateAlways = 43,
	DisplayFPS = 44,
	ShowSpecatedPlayerCrosshair = 45,
	FadeCrosshairWithFiringError = 46,
	ShowBlood = 47,
	ShowCorpses = 48,
	ToggleCrouch = 49,
	ToggleWalk = 50,
	DefaultToWalk = 51,
	VoipDucksMusicVolume = 52,
	VoipDucksVOFlavor = 53,
	MuteMusicOnAppWindowDeactivate = 54,
	EnableHRTF = 55,
	EnableForceFeedback = 56,
	ShootingRangeBotArmorEnabled = 57,
	ShootingRangeBotStrafeEnabled = 58,
	ShootingRangeBotInfiniteAmmoEnabled = 59,
	ShootingRangePracticeModeEnabled = 60,
	ShootingRangeTargetPracticeBotEnabled = 61,
	SpectatorCountWidgetVisible = 62,
	ToggleReturnToStrongestWeapon = 63,
	AutoEquipPrioritizeStrongest = 64,
	AutoEquipSkipsMelee = 65,
	ToggleLiveDiagnostics = 66,
	AESWheelHoldEnabled = 67,
	CrosshairHasOutline = 68,
	CrosshairDisplayCenterDot = 69,
	CrosshairUseCustomColor = 70,
	CrosshairFixMinErrorAcrossWeapons = 71,
	CrosshairUseAdvancedOptions = 72,
	CrosshairScaleToResolution = 73,
	CrosshairInnerLinesShowMovementError = 74,
	CrosshairInnerLinesShowShootingError = 75,
	CrosshairInnerLinesShowMinError = 76,
	CrosshairInnerLinesShowLines = 77,
	CrosshairInnerLinesAllowVertScaling = 78,
	CrosshairOuterLinesShowMovementError = 79,
	CrosshairOuterLinesShowShootingError = 80,
	CrosshairOuterLinesShowMinError = 81,
	CrosshairOuterLinesShowLines = 82,
	CrosshairOuterLinesAllowVertScaling = 83,
	CrosshairUseCustomCrosshairOnAllPrimary = 84,
	CrosshairUsePrimaryCrosshairForADS = 85,
	CrosshairADSHasOutline = 86,
	CrosshairADSDisplayCenterDot = 87,
	CrosshairADSUseCustomColor = 88,
	CrosshairADSFixMinErrorAcrossWeapons = 89,
	CrosshairADSInnerLinesShowMovementError = 90,
	CrosshairADSInnerLinesShowShootingError = 91,
	CrosshairADSInnerLinesShowMinError = 92,
	CrosshairADSInnerLinesShowLines = 93,
	CrosshairADSInnerLinesAllowVertScaling = 94,
	CrosshairADSOuterLinesShowMovementError = 95,
	CrosshairADSOuterLinesShowShootingError = 96,
	CrosshairADSOuterLinesShowMinError = 97,
	CrosshairADSOuterLinesShowLines = 98,
	CrosshairADSOuterLinesAllowVertScaling = 99,
	CrosshairUsePrimaryCrosshairForFocusMode = 100,
	CrosshairFocusModeHasOutline = 101,
	CrosshairFocusModeDisplayCenterDot = 102,
	CrosshairFocusModeUseCustomColor = 103,
	CrosshairFocusModeFixMinErrorAcrossWeapons = 104,
	CrosshairFocusModeInnerLinesShowMovementError = 105,
	CrosshairFocusModeInnerLinesShowShootingError = 106,
	CrosshairFocusModeInnerLinesShowMinError = 107,
	CrosshairFocusModeInnerLinesShowLines = 108,
	CrosshairFocusModeInnerLinesAllowVertScaling = 109,
	CrosshairFocusModeOuterLinesShowMovementError = 110,
	CrosshairFocusModeOuterLinesShowShootingError = 111,
	CrosshairFocusModeOuterLinesShowMinError = 112,
	CrosshairFocusModeOuterLinesShowLines = 113,
	CrosshairFocusModeOuterLinesAllowVertScaling = 114,
	CrosshairSniperDisplayCenterDot = 115,
	CrosshairSniperUseCustomColor = 116,
	AlwaysShowInventoryWidgets = 117,
	LeftHanded = 118,
	TeamColorCrosshair = 119,
	AllyLoadoutInfoAlwaysVisibile = 120,
	TacticalCalloutsInChat = 121,
	TouchCustomAbilityUI = 122,
	TouchAbilityRestoreLastEquippable = 123,
	TouchUseSprintToggle = 124,
	TouchUseHalfScreenMovementArea = 125,
	TouchMovementUncrouchOnRun = 126,
	TouchAbilityMapRotation = 127,
	TouchEnableAutoRun = 128,
	TouchAutoRunEquipsKnife = 129,
	TouchSprintInputFromBottomOnly = 130,
	TouchRunBuffer = 131,
	TouchMarshalCycleZoomOnHold = 132,
	TouchQuickCastingEnabled = 133,
	GamepadInvertLookStickY = 134,
	GamepadInvertLookStickX = 135,
	GamepadEnablePartialAnalogSquareRemapping = 136,
	GamepadMapControlsInvertLookStickY = 137,
	GamepadMapControlsInvertLookStickX = 138,
	GamepadToggleDropSpikeHold = 139,
	StanceIndicatorEnabled = 140,
	GamepadTapToCycleIncompleteInventory = 141,
	GamepadJettAutomaticGlide = 142,
	GamepadForceWalkWhileFocusedOrZoomed = 143,
	GamepadUseAgentAbilitySensMultipliers = 144,
	GamepadUseAdvancedAimSensitivity = 145,
	GamepadDampenShootingSensitivity = 146,
	GamepadNeonSlideBoundToAbility = 147,
	MultithreadedRenderingEnabled = 148,
	HasEverStartedAMatch = 149,
	HasAcceptedCodeOfConduct = 150,
	HasSeenNewPlayerSettings = 151,
	HasSeenNPEContractTutorial = 152,
	HasSeenUPWTutorial = 153,
	HasSeenSettingsTutorial = 154,
	HasSeenWelcomeScreen = 155,
	HasSeenMenuTutorial = 156,
	HasSeenPhotoSensitivityWarning = 157,
	HasSeenInitSelectPresetScreen = 158,
	HasSeenTournamentsScreen = 159,
	HasSeenXGPActivationModal = 160,
	HasSeenTrainingPrompt = 161,
	HasSeenBTEModal = 162,
	HasAcceptedVoiceRecordingTerms = 163,
	HasSeenMFAPrelaunchScreen = 164,
	CollectionShowOwnedOnly = 165,
	IncognitoHideMatchmadePlayerNames = 166,
	IncognitoRejectFriendRequests = 167,
	IncognitoRejectPartyInvitesByDisplayName = 168,
	IncognitoHideTextChatBox = 169,
	PlayerBehavior_MuteEnemyTextChat = 170,
	PlayerBehavior_MuteObserverTextChat = 171,
	HideUI = 172,
	HideCrosshair = 173,
	Hide1P = 174,
	HideOutlinesAndFresnel = 175,
	ObserversSeeBlinds = 176,
	TeamColorAffectsHUD = 177,
	ShowKeybindsOnMinimap = 178,
	ShowKeybindsOnMegamap = 179,
	FullscreenMegamap = 180,
	HandednessByTeam = 181,
	HideSpectatedAgentPortrait = 182,
	ObserverToggleScoreboard = 183,
	HasEverAppliedRoamingSettings = 184,
	HasEverAppliedRoamingSettingsGamepad = 185,
	ShowColoredMuzzleFlashes = 186,
	MaxbotGameplayVO = 187,
	MaxbotFlavorVO = 188,
	RGIInputLatencyEnabled = 189,
	VoiceSelfMuteEnabled = 190,
	MatureContentFilter = 191,
	ShowBloodVisual = 192,
	ShowCorpsesVisual = 193,
	AllowCrossPlay = 194,
	ShowCrossPlayWarning = 195,
	ShowNewPlayerTips = 196,
	ContextAwareModuleComplete = 197,
	EnableToggleableUsables = 198,
	GamepadRiftCosmicDivideOffset = 199,
	GamepadClayAutomatedBackthrow = 200,
	GamepadHapticsEnabled = 201,
	ShowReplayTimeInMs = 202,
	ShowKeyboardShortcutsOnButtons = 203,
	ShowFinalStatsInScoreboard = 204,
	HasSeenReplayAnnouncementMessaging = 205,
	HasAcknowledgedReplay = 206,
	HasCompletedAGameWithReplaysAvailable = 207,
	ShowDeathMarkersOnTimeline = 208,
	ShowUltimateMarkersOnTimeline = 209,
	NvidiaReflexLatewarpSetting = 210,
	PremierTeamForceRenameNoticeShown = 211,
	AllyLoadoutInfoAlwaysVisibleInReplays = 212,
	Count = 213,
	EAresBoolSettingName_MAX = 214
};

// Enum ShooterGame.EAresCommonButtonVisibleState
enum class EAresCommonButtonVisibleState : uint8 {
	Default = 0,
	Disabled = 1,
	Pressed = 2,
	Hovered = 3,
	Selected = 4,
	SelectedHovered = 5,
	Max = 6,
	EAresCommonButtonVisibleState_MAX = 7
};

// Enum ShooterGame.EAresFriendRequestResponseErrors
enum class EAresFriendRequestResponseErrors : uint8 {
	NoGameNameAndTagLineProvided = 0,
	InvalidNameTagFormatting = 1,
	RequestSentToFriend = 2,
	RequestSentToBlockedPlayer = 3,
	RequestSentToBlockingPlayer = 4,
	RequestSentToSelf = 5,
	RequestedPlayerNotFound = 6,
	FriendListFull = 7,
	MaxOutgoingInvites = 8,
	MaxIncomingInvites = 9,
	InternalError = 10,
	EAresFriendRequestResponseErrors_MAX = 11
};

// Enum ShooterGame.EAresFriendRequestDeclineErrors
enum class EAresFriendRequestDeclineErrors : uint8 {
	RequestNotFound = 0,
	InternalError = 1,
	EAresFriendRequestDeclineErrors_MAX = 2
};

// Enum ShooterGame.EAresFriendRequestResponse
enum class EAresFriendRequestResponse : uint8 {
	None = 0,
	Accept = 1,
	Decline = 2,
	EAresFriendRequestResponse_MAX = 3
};

// Enum ShooterGame.EAresTouchSwipeDirection
enum class EAresTouchSwipeDirection : uint8 {
	Up = 0,
	Down = 1,
	Left = 2,
	Right = 3,
	EAresTouchSwipeDirection_MAX = 4
};

// Enum ShooterGame.EAresTouchSwipeType
enum class EAresTouchSwipeType : uint8 {
	None = 0,
	Up = 1,
	Down = 2,
	Left = 3,
	Right = 4,
	EAresTouchSwipeType_MAX = 5
};

// Enum ShooterGame.EVisualizedSoundTypes
enum class EVisualizedSoundTypes : uint8 {
	None = 0,
	FootSteps = 1,
	JumpLaunch = 2,
	JumpLand = 3,
	BombPlant = 4,
	BombTick = 5,
	BombDefuse = 6,
	BombDrop = 7,
	Orb = 8,
	BasePistolFire = 9,
	SlimPistolFire = 10,
	AutoPistolFire = 11,
	LugerPistolFire = 12,
	RevolverPistolFire = 13,
	VectorSMGFire = 14,
	MP5SMGFire = 15,
	PumpShotgunFire = 16,
	AutoShotgunFire = 17,
	BurstRifleFire = 18,
	DMRRifleFire = 19,
	CarbineRifleFire = 20,
	AKRifleFire = 21,
	LeverSniperFire = 22,
	BoltSniperFire = 23,
	LMGFire = 24,
	HMGFire = 25,
	WeaponDrop = 26,
	Reload = 27,
	EVisualizedSoundTypes_MAX = 28
};

// Enum ShooterGame.EActionBindingsManagerBindingSwapFailure
enum class EActionBindingsManagerBindingSwapFailure : uint8 {
	Locked = 0,
	ChordedDPadInput = 1,
	Count = 2,
	EActionBindingsManagerBindingSwapFailure_MAX = 3
};

// Enum ShooterGame.EUIConfirmationModalType
enum class EUIConfirmationModalType : uint8 {
	None = 0,
	Confirm = 1,
	ConfirmCancel = 2,
	DoubleConfirm = 3,
	DoubleConfirmWithDismiss = 4,
	EUIConfirmationModalType_MAX = 5
};

// Enum ShooterGame.EDerankProtectionStatus
enum class EDerankProtectionStatus : uint8 {
	Empty = 0,
	Partial = 1,
	Full = 2,
	Count = 3,
	Invalid = 4,
	EDerankProtectionStatus_MAX = 5
};

// Enum ShooterGame.EConnectionStatus
enum class EConnectionStatus : uint8 {
	Uninitialized = 0,
	Disconnected = 1,
	Unresponsive = 2,
	Connecting = 3,
	Connected = 4,
	Count = 5,
	EConnectionStatus_MAX = 6
};

// Enum ShooterGame.EEquippableRejectInputReason
enum class EEquippableRejectInputReason : uint8 {
	NoResources = 0,
	OutsideGameplay = 1,
	OnCooldown = 2,
	BlockedByCurrentEquippable = 3,
	EquipSlotDisabled = 4,
	EEquippableRejectInputReason_MAX = 5
};

// Enum ShooterGame.EEsportsSubBracketType
enum class EEsportsSubBracketType : uint8 {
	Upper = 0,
	Lower = 1,
	Final = 2,
	Invalid = 3,
	EEsportsSubBracketType_MAX = 4
};

// Enum ShooterGame.EVCTLeague
enum class EVCTLeague : uint8 {
	None = 0,
	Champions = 1,
	Masters = 2,
	Americas = 3,
	EMEA = 4,
	Pacific = 5,
	China = 6,
	GameChangers = 7,
	Count = 8,
	EVCTLeague_MAX = 9
};

// Enum ShooterGame.EEsportsLiveTickerState
enum class EEsportsLiveTickerState : uint8 {
	PickBlockOpen = 0,
	LiveMatch = 1,
	None = 2,
	EEsportsLiveTickerState_MAX = 3
};

// Enum ShooterGame.EEsportsMatchStatus
enum class EEsportsMatchStatus : uint8 {
	InProgress = 0,
	Complete = 1,
	Unstarted = 2,
	Unneeded = 3,
	Count = 4,
	Invalid = 5,
	EEsportsMatchStatus_MAX = 6
};

// Enum ShooterGame.E2024VCTEvent
enum class E2024VCTEvent : uint8 {
	None = 0,
	LeagueKickoff_ALL = 1,
	LeagueKickoff_NA = 2,
	LeagueKickoff_EMEA = 3,
	LeagueKickoff_APAC = 4,
	LeagueKickoff_CN = 5,
	Masters1 = 6,
	Stage1_ALL = 7,
	Stage1_NA = 8,
	Stage1_EMEA = 9,
	Stage1_APAC = 10,
	Stage1_CN = 11,
	Masters2 = 12,
	Stage2_ALL = 13,
	Stage2_NA = 14,
	Stage2_EMEA = 15,
	Stage2_APAC = 16,
	Stage2_CN = 17,
	Champions = 18,
	GameChangers = 19,
	Count = 20,
	E2024VCTEvent_MAX = 21
};

// Enum ShooterGame.EEsportsMatchTeamOutcome
enum class EEsportsMatchTeamOutcome : uint8 {
	Win = 0,
	Loss = 1,
	Tie = 2,
	Forfeit = 3,
	Count = 4,
	Invalid = 5,
	EEsportsMatchTeamOutcome_MAX = 6
};

// Enum ShooterGame.EEsportsTeamMemberRole
enum class EEsportsTeamMemberRole : uint8 {
	IGL = 0,
	Player = 1,
	Substitute = 2,
	Coach = 3,
	Manager = 4,
	Invalid = 5,
	EEsportsTeamMemberRole_MAX = 6
};

// Enum ShooterGame.EAresFlyoutOpenState
enum class EAresFlyoutOpenState : uint8 {
	Closed = 0,
	Opening = 1,
	Opened = 2,
	Closing = 3,
	EAresFlyoutOpenState_MAX = 4
};

// Enum ShooterGame.EForceModuleType
enum class EForceModuleType : uint8 {
	ServerCreated = 0,
	ClientSimulated = 1,
	ClientSynced = 2,
	ClientPredicted = 3,
	EForceModuleType_MAX = 4
};

// Enum ShooterGame.EAresAssistType
enum class EAresAssistType : uint8 {
	None = 0,
	Damage = 1,
	Resurrection = 2,
	Heal = 3,
	CombatBuff = 4,
	Detain = 5,
	Blind = 6,
	Concussion = 7,
	Vulnerable = 8,
	Decay = 9,
	Reveal = 10,
	Gravity = 11,
	Slow = 12,
	Suppression = 13,
	Smoke = 14,
	Other = 15,
	Count = 16,
	EAresAssistType_MAX = 17
};

// Enum ShooterGame.EAresGamePhase
enum class EAresGamePhase : uint8 {
	NotStarted = 0,
	GameStarted = 1,
	BetweenRounds = 2,
	RoundStarting = 3,
	InRound = 4,
	RoundEnding = 5,
	SwitchingTeams = 6,
	GameEnded = 7,
	Count = 8,
	Invalid = 254,
	EAresGamePhase_MAX = 255
};

// Enum ShooterGame.EAresMatchTimeoutState
enum class EAresMatchTimeoutState : uint8 {
	None = 0,
	TimeoutCountdown = 1,
	Timeout = 2,
	Count = 3,
	EAresMatchTimeoutState_MAX = 4
};

// Enum ShooterGame.EUIConfirmationModalVisualType
enum class EUIConfirmationModalVisualType : uint8 {
	Generic = 0,
	SystemError = 1,
	Warning = 2,
	RestrictionsWarning = 3,
	EUIConfirmationModalVisualType_MAX = 4
};

// Enum ShooterGame.EAresInputState
enum class EAresInputState : uint8 {
	Released = 0,
	Pressed = 1,
	Count = 2,
	Invalid = 254,
	EAresInputState_MAX = 255
};

// Enum ShooterGame.EAresEquippableInput
enum class EAresEquippableInput : uint8 {
	EquippableInput_Primary_Trigger = 0,
	EquippableInput_Secondary_Trigger = 1,
	EquippableInput_Reload = 2,
	EquippableInput_ZoomToggle = 3,
	EquippableInput_Use = 4,
	EquippableInput_UseAgentAbility = 5,
	EquippableInput_Drop = 6,
	EquippableInput_Activate = 7,
	EquippableInput_SwipeUp = 8,
	EquippableInput_SwipeDown = 9,
	EquippableInput_SwipeLeft = 10,
	EquippableInput_SwipeRight = 11,
	EquippableInput_ZoomCancel = 12,
	EquippableInput_ProtoAlternateFire = 13,
	EquippableInput_ToggleZoom_SkipFirstLevel = 14,
	EquippableInput_Crouch = 15,
	EquippableInput_Count = 16,
	EquippableInput_Invalid = 254,
	EquippableInput_MAX = 255
};

// Enum ShooterGame.EAresIntSettingName
enum class EAresIntSettingName : uint8 {
	AntiAliasing = 0,
	GraphicsQuality = 1,
	TextureQuality = 2,
	UIQuality = 3,
	MaterialQuality = 4,
	DetailQuality = 5,
	AnisotropicFiltering = 6,
	BloomQuality = 7,
	VoiceVolume = 8,
	MicVolume = 9,
	MicSensitivityThreshold = 10,
	SpeakerConfiguration = 11,
	ColorBlindMode = 12,
	MegamapCalloutVisibility = 13,
	NvidiaReflexLowLatencySetting = 14,
	PlayerPerf_FirstSetting = 15,
	PlayerPerfShowFrameTime = 16,
	PlayerPerfShowIdleFrameTime = 17,
	PlayerPerfShowCPUFrameTime = 18,
	PlayerPerfShowGPUFrameTime = 19,
	PlayerPerfShowRHIFrameTime = 20,
	PlayerPerfShowFrameRate = 21,
	PlayerPerfShowServerFrameRate = 22,
	PlayerPerfShowAvailablePhysicalMemory = 23,
	PlayerPerfShowUsedPhysicalMemory = 24,
	PlayerPerfShowNetworkRtt = 25,
	PlayerPerfShowPacketsLostTotal = 26,
	PlayerPerfShowPacketLossPercentage = 27,
	PlayerPerfShowIncomingPacketLossPercentage = 28,
	PlayerPerfShowOutgoingPacketLossPercentage = 29,
	PlayerPerfShowPacketsReceived = 30,
	PlayerPerfShowPacketsSent = 31,
	PlayerPerfShowInputLatencyCpuPlusGpu = 32,
	PlayerPerfShowInputLatencyCpu = 33,
	PlayerPerfShowInputLatencyGpu = 34,
	PlayerPerfShowRenderWait = 35,
	PlayerPerfShowGpuRenderFrameTime = 36,
	PlayerPerfShowRHIPresentTime = 37,
	PlayerPerfShowRemoteInterpDelayMs = 38,
	PlayerPerfShowQueuedRemoteMoveCount = 39,
	PlayerPerfShowConsecutiveRemoteForwardPredictions = 40,
	PlayerPerfShowPacketsLostIncoming = 41,
	PlayerPerfShowPacketsLostOutgoing = 42,
	PlayerPerfShowUploadedData = 43,
	PlayerPerfShowDownloadedData = 44,
	PlayerPerfShowTotalTransferredData = 45,
	PlayerPerfShowIncomingPacketSize = 46,
	PlayerPerfShowOutgoingPacketSize = 47,
	PlayerPerfShowMoveCorrectionDistance = 48,
	PlayerPerfShowMoveTimelineShiftMs = 49,
	PlayerPerfShowReceivedEquippableCorrection = 50,
	PlayerPerfShowOutgoingInputQueueLength = 51,
	PlayerPerfShowOutgoingMoveQueueLength = 52,
	PlayerPerfShowClientIncomingMoveProcessingDelay = 53,
	PlayerPerfShowServerIncomingMoveProcessingDelay = 54,
	PlayerPerfShowATB = 55,
	PlayerPerfShowFrameCount = 56,
	PlayerPerfShowNetworkJitter = 57,
	PlayerPerfShowEndToEndLatency = 58,
	PlayerPerfShowFiringErrors = 59,
	PlayerPerfShow_RGILatencyMarkers_TotalLatencyMs = 60,
	PlayerPerfShow_RGILatencyMarkers_TotalWorkMs = 61,
	PlayerPerfShow_RGILatencyMarkers_TotalSlopMs = 62,
	PlayerPerfPresetInfo = 63,
	PlayerPerfPreset = 64,
	PlayerPerf_LastSetting = 65,
	NetworkSmoothing = 66,
	ShootingRangeSkillTestSetting = 67,
	ShootingRangeSkillTestDifficulty = 68,
	ShootingRangePlantModuleDifficultySetting = 69,
	ShootingRangeDefuseModuleDifficultySetting = 70,
	GamepadSavedPreset = 71,
	GamepadSavedAimCurve = 72,
	GamepadSavedAimCurveADS = 73,
	GamepadSavedAimCurveScoped = 74,
	GamepadSavedAimCurveFocusMode = 75,
	GamepadSavedAimCurveAngularDeadzone = 76,
	GamepadWeaponSwapMode = 77,
	GamepadWeaponSwapInputType = 78,
	GamepadJettGlidePressBehavior = 79,
	GamepadDefaultAimMode = 80,
	GamepadGuideToggleHawkAbility = 81,
	GamepadMageToggleWallAbility = 82,
	GamepadPhoenixToggleFireWallAbility = 83,
	GamepadMapCursorCurveBrimstoneSmokes = 84,
	GamepadMapCursorCurveBrimstoneOrbital = 85,
	GamepadMapCursorCurveCloveSmokes = 86,
	GamepadMapCursorCurveOmenUltimate = 87,
	GamepadMapCursorCurveCashewMissiles = 88,
	GamepadMapCursorCurveCashewUltimate = 89,
	GamepadMapCursorCurveMegamap = 90,
	TouchDoubleTapRight = 91,
	TouchHUDPreset = 92,
	TouchDoubleTapLeft = 93,
	TouchJoystickStyle = 94,
	TouchSniperZoomLevelSetting = 95,
	TouchOperatorZoomCycleStyle = 96,
	TouchOperatorZoomCycleStyle_CachedAllLevels = 97,
	TouchOperatorZoomCycleStyle_CachedLevelOne = 98,
	TouchOperatorZoomCycleStyle_CachedLevelTwo = 99,
	TouchAimSensitivityPreset = 100,
	TouchTrackballSensitivityPreset = 101,
	TouchDoubleTapTopLeft = 102,
	TouchDoubleTapTopMiddle = 103,
	TouchDoubleTapTopRight = 104,
	TouchDoubleTapMiddleLeft = 105,
	TouchDoubleTapMiddle = 106,
	TouchDoubleTapMiddleRight = 107,
	TouchDoubleTapBottomLeft = 108,
	TouchDoubleTapBottomMiddle = 109,
	TouchDoubleTapBottomRight = 110,
	TouchNumVerticalRegions = 111,
	TouchNumHorizontalRegions = 112,
	MaxFramerateInBuyPhase = 113,
	MaxFramerateInGamePhase = 114,
	MaxFramerateInSpectatorView = 115,
	ShootingRangeBotMode = 116,
	ShootingRangeBotAmount = 117,
	ShootingRangeTargetPracticeDistance = 118,
	LastSeenRoamingSettingsVersion = 119,
	VoiceSpeakingChannel = 120,
	PreferredVoiceSpeakingChannel = 121,
	Count = 122,
	EAresIntSettingName_MAX = 123
};

// Enum ShooterGame.EContentEditionType
enum class EContentEditionType : uint8 {
	None = 0,
	NotLimitedEdition = 1,
	LimitedEdition = 2,
	Count = 3,
	EContentEditionType_MAX = 4
};

// Enum ShooterGame.ELobbyType
enum class ELobbyType : uint8 {
	None = 0,
	Matchmade = 1,
	Custom = 2,
	Premier = 3,
	ELobbyType_MAX = 4
};

// Enum ShooterGame.EMatchResult
enum class EMatchResult : uint8 {
	Win = 0,
	Loss = 1,
	Draw = 2,
	EMatchResult_MAX = 3
};

// Enum ShooterGame.ESortCriteria
enum class ESortCriteria : uint8 {
	CombatScore = 0,
	KDA = 1,
	EconRating = 2,
	FirstBloods = 3,
	Plants = 4,
	Defuses = 5,
	Placeholder1 = 6,
	Placeholder2 = 7,
	Placeholder3 = 8,
	Placeholder4 = 9,
	ESortCriteria_MAX = 10
};

// Enum ShooterGame.EMeshPlayerView
enum class EMeshPlayerView : uint8 {
	FirstPerson = 0,
	ThirdPerson = 1,
	EMeshPlayerView_MAX = 2
};

// Enum ShooterGame.EPartyErrorEnum
enum class EPartyErrorEnum : uint8 {
	ErrUnparsableState = 0,
	ErrUnparsableTeam = 1,
	ErrJoinTypeNotRecognized = 2,
	ErrJoinPartyWithoutOwnership = 3,
	ErrJoinPartyGotBlocked = 4,
	ErrPartyTooLargeToJoin = 5,
	ErrPlayerDoesNotExist = 6,
	ErrPlayerNoCurrentParty = 7,
	ErrJoinPlayerNilParty = 8,
	ErrPlayerExistsInParty = 9,
	ErrJoiningPlayerNotInMenus = 10,
	ErrPartyMemberNotInMenus = 11,
	ErrPartyStateCantEnterMatchmaking = 12,
	ErrPartyNotInMatchmaking = 13,
	ErrPlayerInGame = 14,
	ErrNilSessionNotification = 15,
	ErrPartyCleaned = 16,
	ErrPartyTooLargeToConvertMM = 17,
	ErrClientVersionMismatchWithSession = 18,
	ErrPartyDoesNotExist = 19,
	ErrNotACustomGame = 20,
	ErrPartyStateCantEnterQuickCustomGame = 21,
	ErrTooManyPlayersForQuickCustomGame = 22,
	ErrInviteNotAllowed = 23,
	ErrCheatsDisabled = 24,
	ErrEmptyName = 25,
	ErrPartyStateCantEnterCustomGame = 26,
	ErrEmptyQueue = 27,
	ErrOldPartyIDMismatch = 28,
	ErrPartyIDInvalid = 29,
	ErrPlayerAlreadyInited = 30,
	ErrPlayerNotInited = 31,
	ErrNewPartyIDIsNotNew = 32,
	ErrInviteNotFound = 33,
	ErrInviteExists = 34,
	ErrPartyNil = 35,
	ErrPartyAlreadyExists = 36,
	ErrPartyIDMismatch = 37,
	ErrCannotModifyPlayerNotInParty = 38,
	ErrAlreadyInParty = 39,
	ErrPartyFull = 40,
	ErrIncorrectPartyState = 41,
	ErrPlayerClientVersionMismatch = 42,
	ErrInvalidPreviousState = 43,
	ErrNotPartyOwner = 44,
	ErrMatchmakingError = 45,
	ErrRequestOnOpenError = 46,
	ErrRequestOnFullParty = 47,
	ErrRequestTooManySubjects = 48,
	ErrQueueNotEnabled = 49,
	ErrQueueRestricted = 50,
	ErrInviteCodeMappingNil = 51,
	ErrInviterCrossPlayIncompatible = 52,
	ErrInviteeCrossPlayIncompatible = 53,
	ErrRequestingPlayerCrossPlayIncompatible = 54,
	ErrRequestToJoinPartyCrossPlayIncompatible = 55,
	ErrJoiningPlayerCrossPlayIncompatible = 56,
	ErrPartyToJoinCrossPlayIncompatible = 57,
	ErrPartyCrossPlayIncompatible = 58,
	ErrNativePlatformInviteError = 59,
	ErrGenericPlatformInviteError = 60,
	ErrPSNCrossPlayGameInvitationsNotAllowed = 61,
	ErrPSNPrivacySettingsNotCompatible = 62,
	ErrPlatformSessionJoin = 63,
	ErrNativePlatformInsufficientPermissions = 64,
	ErrPlayerBlocksRecipient = 65,
	ErrPlayerBlockedByRecipient = 66,
	ErrJoinNotAllowed = 67,
	ErrRequestToJoinNotAllowed = 68,
	ErrPlayerPlatformIsRestricted = 69,
	ErrInvalid = 70,
	EPartyErrorEnum_MAX = 71
};

// Enum ShooterGame.EActionBindChangeSource
enum class EActionBindChangeSource : uint8 {
	UserRebind = 0,
	Init = 1,
	RoamingDownload = 2,
	Reset = 3,
	Apply = 4,
	ResetOne = 5,
	Copy = 6,
	Count = 7,
	EActionBindChangeSource_MAX = 8
};

// Enum ShooterGame.EAresCameraPerspective
enum class EAresCameraPerspective : uint8 {
	FirstPerson = 0,
	ThirdPerson = 1,
	Count = 2,
	EAresCameraPerspective_MAX = 3
};

// Enum ShooterGame.EAresCameraStyle
enum class EAresCameraStyle : uint8 {
	UseViewTargetPerspective = 0,
	ThirdPersonCamera = 1,
	WatchGameStateObject = 2,
	ThirdPersonDebugCamera = 3,
	None = 4,
	Count = 5,
	EAresCameraStyle_MAX = 6
};

// Enum ShooterGame.EAresFloatSettingName
enum class EAresFloatSettingName : uint8 {
	Gamma = 0,
	MouseSensitivity = 1,
	MouseSensitivityZoomed = 2,
	MouseSensitivityADS = 3,
	MinimapSize = 4,
	MinimapZoom = 5,
	OverallVolume = 6,
	SoundEffectsVolume = 7,
	VoiceOverVolume = 8,
	VideoVolume = 9,
	AllMusicOverallVolume = 10,
	MenuAndLobbyMusicVolume = 11,
	CharacterSelectMusicVolume = 12,
	MaxFramerateOnBattery = 13,
	MaxFramerateInMenu = 14,
	MaxFramerateInBackground = 15,
	MaxFramerateAlways = 16,
	PingWheelHoldDelayMS = 17,
	AESWheelHoldDelayMS = 18,
	CrosshairOutlineThickness = 19,
	CrosshairOutlineOpacity = 20,
	CrosshairCenterDotSize = 21,
	CrosshairCenterDotOpacity = 22,
	CrosshairInnerLinesLineThickness = 23,
	CrosshairInnerLinesLineLength = 24,
	CrosshairInnerLinesLineLengthVertical = 25,
	CrosshairInnerLinesLineOffset = 26,
	CrosshairInnerLinesOpacity = 27,
	CrosshairInnerLinesFiringErrorScale = 28,
	CrosshairInnerLinesMovementErrorScale = 29,
	CrosshairOuterLinesLineThickness = 30,
	CrosshairOuterLinesLineLength = 31,
	CrosshairOuterLinesLineLengthVertical = 32,
	CrosshairOuterLinesLineOffset = 33,
	CrosshairOuterLinesOpacity = 34,
	CrosshairOuterLinesFiringErrorScale = 35,
	CrosshairOuterLinesMovementErrorScale = 36,
	CrosshairADSOutlineThickness = 37,
	CrosshairADSOutlineOpacity = 38,
	CrosshairADSCenterDotSize = 39,
	CrosshairADSCenterDotOpacity = 40,
	CrosshairADSInnerLinesLineThickness = 41,
	CrosshairADSInnerLinesLineLength = 42,
	CrosshairADSInnerLinesLineLengthVertical = 43,
	CrosshairADSInnerLinesLineOffset = 44,
	CrosshairADSInnerLinesOpacity = 45,
	CrosshairADSInnerLinesFiringErrorScale = 46,
	CrosshairADSInnerLinesMovementErrorScale = 47,
	CrosshairADSOuterLinesLineThickness = 48,
	CrosshairADSOuterLinesLineLength = 49,
	CrosshairADSOuterLinesLineLengthVertical = 50,
	CrosshairADSOuterLinesLineOffset = 51,
	CrosshairADSOuterLinesOpacity = 52,
	CrosshairADSOuterLinesFiringErrorScale = 53,
	CrosshairADSOuterLinesMovementErrorScale = 54,
	CrosshairFocusModeOutlineThickness = 55,
	CrosshairFocusModeOutlineOpacity = 56,
	CrosshairFocusModeCenterDotSize = 57,
	CrosshairFocusModeCenterDotOpacity = 58,
	CrosshairFocusModeInnerLinesLineThickness = 59,
	CrosshairFocusModeInnerLinesLineLength = 60,
	CrosshairFocusModeInnerLinesLineLengthVertical = 61,
	CrosshairFocusModeInnerLinesLineOffset = 62,
	CrosshairFocusModeInnerLinesOpacity = 63,
	CrosshairFocusModeInnerLinesFiringErrorScale = 64,
	CrosshairFocusModeInnerLinesMovementErrorScale = 65,
	CrosshairFocusModeOuterLinesLineThickness = 66,
	CrosshairFocusModeOuterLinesLineLength = 67,
	CrosshairFocusModeOuterLinesLineLengthVertical = 68,
	CrosshairFocusModeOuterLinesLineOffset = 69,
	CrosshairFocusModeOuterLinesOpacity = 70,
	CrosshairFocusModeOuterLinesFiringErrorScale = 71,
	CrosshairFocusModeOuterLinesMovementErrorScale = 72,
	CrosshairSniperCenterDotSize = 73,
	CrosshairSniperCenterDotOpacity = 74,
	TouchSensitivityZoomed = 75,
	TouchSensitivitySniper = 76,
	TouchTapMaxTime = 77,
	TouchExperimentalAnchoredButtonOffset = 78,
	TouchExperimentalMaxWalkSpeed = 79,
	TouchDoubleTapTime = 80,
	TouchDoubleTapDistance = 81,
	TouchTabletLayoutWidthThreshold = 82,
	TouchJoystickWalkThreshold = 83,
	TouchJoystickRunLockThreshold = 84,
	TouchSniperHoldCyclingSpeed = 85,
	GamepadBaseRotationSpeedX = 86,
	GamepadBaseRotationSpeedY = 87,
	GamepadFocusRotationSpeedX = 88,
	GamepadFocusRotationSpeedY = 89,
	GamepadADSRotationSpeedX = 90,
	GamepadADSRotationSpeedY = 91,
	GamepadScopedRotationSpeedX = 92,
	GamepadScopedRotationSpeedY = 93,
	GamepadLookStickInnerDeadzone = 94,
	GamepadLookStickOuterDeadzone = 95,
	GamepadLookStickAngularInnerDeadzoneDeg = 96,
	GamepadLookStickAngularOuterDeadzoneDeg = 97,
	GamepadWalkStickInnerDeadzone = 98,
	GamepadWalkStickAngularInnerDeadzoneDeg = 99,
	GamepadWalkStickAngularOuterDeadzoneDeg = 100,
	GamepadWalkStickAxialHorizontalDeadzone = 101,
	GamepadWalkStickAxialVerticalDeadzone = 102,
	GamepadTriggerDeadzone = 103,
	GamepadAnalogWalkThreshold = 104,
	GamepadShootingSensitivityScaleX = 105,
	GamepadShootingSensitivityScaleY = 106,
	GamepadShootSensScaleEaseInTime = 107,
	GamepadShootSensScaleEaseOutTime = 108,
	GamepadShootSensScaleEaseOutDelay = 109,
	GamepadMegamapSizeMultiplier = 110,
	GamepadRotationIncreaseAccelFocusModeMultiplier = 111,
	GamepadRotationIncreaseAccelADSMultiplier = 112,
	GamepadRotationIncreaseAccelScopedMultiplier = 113,
	GamepadSimpleAimSensitivity = 114,
	GamepadSimpleMapCursorSensitivity = 115,
	ObserverRunSpeedModifier = 116,
	ObserverWalkSpeedModifier = 117,
	GamepadAggroBotMoshPitSensitivity = 118,
	GamepadAggroBotThrashSensitivity = 119,
	GamepadBountyHunterPrecisionModeSensitivity = 120,
	GamepadBountyHunterProwlerSensitivity = 121,
	GamepadBountyHunterSeizeSensitivity = 122,
	GamepadBreachAftershockSensitivity = 123,
	GamepadBreachFaultLineSensitivity = 124,
	GamepadBreachFlashpointSensitivity = 125,
	GamepadCableAnnihilationSensitivity = 126,
	GamepadCableGravNetSensitivity = 127,
	GamepadClayPaintShellSensitivity = 128,
	GamepadClayShowstopperSensitivity = 129,
	GamepadCloudburstSensitivity = 130,
	GamepadGrenadierFlashDriveSensitivity = 131,
	GamepadGrenadierFragmentSensitivity = 132,
	GamepadGrenadierZeroPointSensitivity = 133,
	GamepadGuideGuidingLightSensitivity = 134,
	GamepadGuideTrailblazerSensitivity = 135,
	GamepadGumshoePrecisionModeSensitivity = 136,
	GamepadGumshoeSpycamSensitivity = 137,
	GamepadHunterHuntersFurySensitivity = 138,
	GamepadHunterReconBoltSensitivity = 139,
	GamepadHunterShockBoltSensitivity = 140,
	GamepadMageHighTideSensitivity = 141,
	GamepadPandemicPoisonCloudSensitivity = 142,
	GamepadPandemicSnakeBiteSensitivity = 143,
	GamepadPhoenixBlazeSensitivity = 144,
	GamepadSargeAbilityTabletSensitivity = 145,
	GamepadSargePrecisionModeSensitivity = 146,
	GamepadSequoiaUndercutSensitivity = 147,
	GamepadSmonkButterflyKnifeSensitivity = 148,
	GamepadStealthBlindsideSensitivity = 149,
	GamepadWraithDarkCoverSensitivity = 150,
	GamepadWraithFromTheShadowsSensitivity = 151,
	GamepadWraithShroudedStepSensitivity = 152,
	GamepadHapticsIntensityModifier = 153,
	SandboxTestFloatSetting = 154,
	Count = 155,
	EAresFloatSettingName_MAX = 156
};

// Enum ShooterGame.EAresStringSettingName
enum class EAresStringSettingName : uint8 {
	VoiceDeviceCaptureHandle = 0,
	VoiceDeviceRenderHandle = 1,
	CrosshairSettings = 2,
	PushToTalkKey = 3,
	TeamPushToTalkKey = 4,
	CrosshairColor = 5,
	CrosshairColorCustom = 6,
	CrosshairOutlineColor = 7,
	CrosshairADSColor = 8,
	CrosshairADSColorCustom = 9,
	CrosshairADSOutlineColor = 10,
	CrosshairFocusModeColor = 11,
	CrosshairFocusModeColorCustom = 12,
	CrosshairFocusModeOutlineColor = 13,
	CrosshairSniperCenterDotColor = 14,
	CrosshairSniperCenterDotColorCustom = 15,
	CrosshairProfileName = 16,
	SavedCrosshairProfileData = 17,
	LastSeenSeasonalPopup = 18,
	LastSeenAdHocPopup = 19,
	PreferredGamePods = 20,
	TouchWidgetLayouts = 21,
	MutedWords = 22,
	CheatEOGMatchID = 23,
	PlayerPerfPresetType = 24,
	NativePlatformSelectedLanguage = 25,
	PremierPromotionNotice = 26,
	PremierPlayoffQualificationNotice = 27,
	Count = 28,
	EAresStringSettingName_MAX = 29
};

// Enum ShooterGame.EAvoidListError
enum class EAvoidListError : uint8 {
	ErrAvoidListFull = 0,
	ErrOther = 1,
	EAvoidListError_MAX = 2
};

// Enum ShooterGame.EAVSErrorType
enum class EAVSErrorType : uint8 {
	PhoneNumberUnavailable = 0,
	AccountAlreadyVerified = 1,
	VerificationPinNotFound = 2,
	InvalidVerificationTransactionType = 3,
	InvalidPhoneType = 4,
	InvalidPhoneNumber = 5,
	PUUIDNotFound = 6,
	AccountNotVerified = 7,
	ValidationError = 8,
	AuthPayloadDeserializationError = 9,
	DataStoreError = 10,
	RateLimitError = 11,
	OTPRateLimitError = 12,
	LongTermOTPRateLimitError = 13,
	SMSServiceError = 14,
	UnknownServerError = 15,
	ConfirmationPinIncorrect = 16,
	Default = 17,
	Count = 18,
	Invalid = 19,
	EAVSErrorType_MAX = 20
};

// Enum ShooterGame.EAVSConfirmationResponseType
enum class EAVSConfirmationResponseType : uint8 {
	ConfirmationPinIncorrect = 0,
	ConfirmationPinValid = 1,
	DeactivationPinSent = 2,
	ActivationPinSent = 3,
	Count = 4,
	Invalid = 5,
	EAVSConfirmationResponseType_MAX = 6
};

// Enum ShooterGame.EEsportsPickemAutosaveState
enum class EEsportsPickemAutosaveState : uint8 {
	HasPendingChanges = 0,
	Saving = 1,
	Saved = 2,
	Error = 3,
	EEsportsPickemAutosaveState_MAX = 4
};

// Enum ShooterGame.EAresBlockPlayerResponseErrors
enum class EAresBlockPlayerResponseErrors : uint8 {
	NoPuuidProvided = 0,
	MissingPuuidOrName = 1,
	AlreadyBlocked = 2,
	TargetingSelf = 3,
	InternalError = 4,
	EAresBlockPlayerResponseErrors_MAX = 5
};

// Enum ShooterGame.EBracketMatchupID
enum class EBracketMatchupID : uint8 {
	None = 0,
	Matchup1 = 1,
	Matchup2 = 2,
	Matchup3 = 3,
	Matchup4 = 4,
	Matchup5 = 5,
	Matchup6 = 6,
	Matchup7 = 7,
	Matchup8 = 8,
	Matchup9 = 9,
	Matchup10 = 10,
	Matchup11 = 11,
	Matchup12 = 12,
	Matchup13 = 13,
	Matchup14 = 14,
	Matchup15 = 15,
	Matchup16 = 16,
	Matchup17 = 17,
	Matchup18 = 18,
	Matchup19 = 19,
	Matchup20 = 20,
	Matchup21 = 21,
	Matchup22 = 22,
	Matchup23 = 23,
	Matchup24 = 24,
	Matchup25 = 25,
	Matchup26 = 26,
	Matchup27 = 27,
	Matchup28 = 28,
	Matchup29 = 29,
	Matchup30 = 30,
	Matchup31 = 31,
	Matchup32 = 32,
	Matchup33 = 33,
	Matchup34 = 34,
	Matchup35 = 35,
	Matchup36 = 36,
	Matchup37 = 37,
	Matchup38 = 38,
	Matchup39 = 39,
	Matchup40 = 40,
	Matchup41 = 41,
	Matchup42 = 42,
	Matchup43 = 43,
	Matchup44 = 44,
	Matchup45 = 45,
	Matchup46 = 46,
	Matchup47 = 47,
	Matchup48 = 48,
	Matchup49 = 49,
	Matchup50 = 50,
	Matchup51 = 51,
	Matchup52 = 52,
	Matchup53 = 53,
	Matchup54 = 54,
	Matchup55 = 55,
	Matchup56 = 56,
	Matchup57 = 57,
	Matchup58 = 58,
	Matchup59 = 59,
	Matchup60 = 60,
	Matchup61 = 61,
	Matchup62 = 62,
	Matchup63 = 63,
	Matchup64 = 64,
	Matchup65 = 65,
	Matchup66 = 66,
	Matchup67 = 67,
	Matchup68 = 68,
	Matchup69 = 69,
	Matchup70 = 70,
	Matchup71 = 71,
	Matchup72 = 72,
	Matchup73 = 73,
	Matchup74 = 74,
	Matchup75 = 75,
	Matchup76 = 76,
	Matchup77 = 77,
	Matchup78 = 78,
	Matchup79 = 79,
	Matchup80 = 80,
	Matchup81 = 81,
	Matchup82 = 82,
	Matchup83 = 83,
	Matchup84 = 84,
	Matchup85 = 85,
	Matchup86 = 86,
	Matchup87 = 87,
	Matchup88 = 88,
	Matchup89 = 89,
	Matchup90 = 90,
	Matchup91 = 91,
	Matchup92 = 92,
	Matchup93 = 93,
	Matchup94 = 94,
	Matchup95 = 95,
	Matchup96 = 96,
	Matchup97 = 97,
	Matchup98 = 98,
	Matchup99 = 99,
	Matchup100 = 100,
	Count = 101,
	EBracketMatchupID_MAX = 102
};

// Enum ShooterGame.EBracketType
enum class EBracketType : uint8 {
	SingleElimination = 0,
	DoubleElimination = 1,
	Swiss = 2,
	EBracketType_MAX = 3
};

// Enum ShooterGame.EAresGunRequestState
enum class EAresGunRequestState : uint8 {
	Empty = 0,
	Open = 1,
	EAresGunRequestState_MAX = 2
};

// Enum ShooterGame.EStepType
enum class EStepType : uint8 {
	MapBan = 0,
	MapPick = 1,
	SidePick = 2,
	EStepType_MAX = 3
};

// Enum ShooterGame.EVoiceSessionType
enum class EVoiceSessionType : uint8 {
	Invalid = 0,
	Party = 1,
	Team = 2,
	Count = 3,
	EVoiceSessionType_MAX = 4
};

// Enum ShooterGame.EAresCharacterPosture
enum class EAresCharacterPosture : uint8 {
	Standing = 0,
	Crouching = 1,
	UnCrouching = 2,
	Crouched = 3,
	EAresCharacterPosture_MAX = 4
};

// Enum ShooterGame.EPregameCharacterState
enum class EPregameCharacterState : uint8 {
	Free = 0,
	SelectedByOther = 1,
	SelectedByMe = 2,
	LockedByMe = 3,
	LockedByOther = 4,
	EPregameCharacterState_MAX = 5
};

// Enum ShooterGame.EAresClientGameInstanceInitStatus
enum class EAresClientGameInstanceInitStatus : uint8 {
	NotStarted = 0,
	Initializing = 1,
	AwaitingFirstTimeUserInfo = 2,
	WaitingForLogin = 3,
	AttemptingLogin = 4,
	PatchPreview = 5,
	WaitingForPatch = 6,
	Initialized = 7,
	InitFailure = 8,
	Count = 9,
	EAresClientGameInstanceInitStatus_MAX = 10
};

// Enum ShooterGame.EActivationPreference
enum class EActivationPreference : uint8 {
	ACTIVE = 0,
	INACTIVE = 1,
	NONE = 2,
	EActivationPreference_MAX = 3
};

// Enum ShooterGame.EAresCommonInputCondition
enum class EAresCommonInputCondition : uint8 {
	Never = 0,
	Hover = 1,
	Always = 2,
	All = 3,
	EAresCommonInputCondition_MAX = 4
};

// Enum ShooterGame.EUIConfirmationModalResponse
enum class EUIConfirmationModalResponse : uint8 {
	None = 0,
	Confirm = 1,
	Confirm2 = 2,
	Cancel = 3,
	Dismiss = 4,
	EUIConfirmationModalResponse_MAX = 5
};

// Enum ShooterGame.ECreateRosterInviteErrorType
enum class ECreateRosterInviteErrorType : uint8 {
	RosterLocked = 0,
	PlayerMaxRosterLimitReached = 1,
	RosterNonProvisional = 2,
	PlayerIneligibleRanked = 3,
	PlayerIneligibleAVS = 4,
	PlayerIneligibleRestrictionIneligible = 5,
	PlayerIneligibleRestrictionDisqualified = 6,
	PlayerIneligibleContenderEligibility = 7,
	InviteeChangesRosterDivisionTier = 8,
	InviteeNotEligibleAVS = 9,
	InviteeNotEligibleRanked = 10,
	InviteeNotEligibleRestrictionIneligible = 11,
	InviteeNotEligibleRestrictionDisqualified = 12,
	Default = 13,
	Count = 14,
	Invalid = 15,
	ECreateRosterInviteErrorType_MAX = 16
};

// Enum ShooterGame.ECreateRosterErrorType
enum class ECreateRosterErrorType : uint8 {
	NameTaken = 0,
	NameLength = 1,
	TagLength = 2,
	InappropriateName = 3,
	RestrictedName = 4,
	Default = 5,
	Count = 6,
	Invalid = 7,
	ECreateRosterErrorType_MAX = 8
};

// Enum ShooterGame.EPremierCrestType
enum class EPremierCrestType : uint8 {
	INVALID = 0,
	NONE = 1,
	COMPETITOR = 2,
	QUALIFIED = 3,
	PLAYOFFS = 4,
	SECOND = 5,
	FIRST = 6,
	FLAWLESS = 7,
	Count = 8,
	EPremierCrestType_MAX = 9
};

// Enum ShooterGame.EVoteState
enum class EVoteState : uint8 {
	Inactive = 0,
	ActivateOnceReplicated = 1,
	Active = 2,
	Concluded = 3,
	Expired = 4,
	EVoteState_MAX = 5
};

// Enum ShooterGame.ECustomGameTeam
enum class ECustomGameTeam : uint8 {
	Defenders = 0,
	Attackers = 1,
	Spectate = 2,
	DefendersCoaches = 3,
	AttackersCoaches = 4,
	Count = 5,
	Invalid = 6,
	ECustomGameTeam_MAX = 7
};

// Enum ShooterGame.EAresEquippableInputAction
enum class EAresEquippableInputAction : uint8 {
	EquippableInputAction_WentDown = 0,
	EquippableInputAction_IsDown = 1,
	EquippableInputAction_WentUp = 2,
	EquippableInputAction_IsUp = 3,
	EquippableInputAction_Count = 4,
	EquippableInputAction_MAX = 5
};

// Enum ShooterGame.EDestructionEffectPlayType
enum class EDestructionEffectPlayType : uint8 {
	PlayAtLocation = 0,
	PlayOnActor = 1,
	EDestructionEffectPlayType_MAX = 2
};

// Enum ShooterGame.EDestructionType
enum class EDestructionType : uint8 {
	AreaDestruct = 0,
	BoxHazard = 1,
	EDestructionType_MAX = 2
};

// Enum ShooterGame.EEarnedStatus
enum class EEarnedStatus : uint8 {
	PremiumRequiredToEarn = 0,
	Unearned = 1,
	Earned = 2,
	EEarnedStatus_MAX = 3
};

// Enum ShooterGame.EEnrollRosterErrorType
enum class EEnrollRosterErrorType : uint8 {
	MinumumRequiredMembers = 0,
	Default = 1,
	Count = 2,
	Invalid = 3,
	EEnrollRosterErrorType_MAX = 4
};

// Enum ShooterGame.EAresEquippableRestrictionType
enum class EAresEquippableRestrictionType : uint8 {
	None = 0,
	CantSwitchEquippables = 1,
	PrimaryWeaponsDisabled = 2,
	HeavyWeaponsDisabled = 3,
	WeaponsDisabled = 4,
	AbilityDisabled = 5,
	Suppressed = 6,
	Count = 7,
	EAresEquippableRestrictionType_MAX = 8
};

// Enum ShooterGame.EAresEquippableState
enum class EAresEquippableState : uint8 {
	Unknown = 0,
	Idle = 1,
	Equipping = 2,
	Inspecting = 3,
	Attacking = 4,
	Firing = 5,
	Reloading = 6,
	ADS_Idle = 7,
	ADS_Firing = 8,
	Count = 9,
	EAresEquippableState_MAX = 10
};

// Enum ShooterGame.EEsportsGameOutcome
enum class EEsportsGameOutcome : uint8 {
	Win = 0,
	Loss = 1,
	Undetermined = 2,
	Invalid = 3,
	EEsportsGameOutcome_MAX = 4
};

// Enum ShooterGame.EVCTRegion
enum class EVCTRegion : uint8 {
	International = 0,
	Americas = 1,
	EMEA = 2,
	Pacific = 3,
	CN = 4,
	None = 5,
	EVCTRegion_MAX = 6
};

// Enum ShooterGame.EGameFeatureFloatConfigName
enum class EGameFeatureFloatConfigName : uint8 {
	InitialConnectTimeout = 0,
	ConnectionTimeout = 1,
	SoftDisconnectTimeout = 2,
	MaxAllowableRewindTime = 3,
	RemoteMoveDelayTimeMillisecondsOptimal = 4,
	RemoteMoveDelayTimeMillisecondsAverage = 5,
	RemoteMoveDelayTimeMillisecondsPoor = 6,
	MaxUnacknowledgedDuration = 7,
	WarmupMaximumDuration = 8,
	MaxScoreLimitOverride = 9,
	MaxOvertimeRounds = 10,
	MinimapVisibilityTickInterval = 11,
	ObserverMovementMinQueueSize = 12,
	JohnsLatteRate = 13,
	PainAuxRaisinsRate = 14,
	UsablesPredictionTimeout = 15,
	ForceModulesPredictionTimeout = 16,
	LogsPerSecondThreshold = 17,
	LogsPerSecondCriticalThreshold = 18,
	LogsPerSecondMeasurementWindow = 19,
	AimToolingTrackerHighRecoilThreshold = 20,
	AimToolingTelemetryEventCadenceSeconds = 21,
	AimToolingTelemetryEventPercentChanceToPost = 22,
	SilentFramesBeforeBurstLoss = 23,
	GamepadMaxFramerateAlways = 24,
	EndToEndLatencyJitter = 25,
	ABFootstepTestControlPercent = 26,
	GameDataWorldSnapshotIntervalSec = 27,
	GameDataWorldConfigurationIntervalSec = 28,
	GameDataTimeseriesIntervalSec = 29,
	ShortTermNPEUpdatesChance = 30,
	MaxSnapshotCountForShortGames = 31,
	DesignerFloatA = 32,
	DesignerFloatB = 33,
	DesignerFloatC = 34,
	DesignerFloatD = 35,
	DesignerFloatE = 36,
	AwakeReplicationFrequency = 37,
	AimToolingDelayedZoomAlphaValue = 38,
	DropInTimeoutSeconds = 39,
	ReplayEventRecordingVerbosity = 40,
	Count = 41,
	Invalid = 254,
	EGameFeatureConfigName_MAX = 255,
	EGameFeatureFloatConfigName_MAX = 256
};

// Enum ShooterGame.EGameFeatureToggleName
enum class EGameFeatureToggleName : uint8 {
	FootIK = 0,
	FootIKUseDownhillTrace = 1,
	FootIKEyeHeightAdjustment = 2,
	FootIKDebug = 3,
	Harvester = 4,
	WeaponThroughWallClipping = 5,
	WallClipping3PDebug = 6,
	AbilityMinimapIndicators = 7,
	StrictRealTimeServerMovementChecks = 8,
	DesignPlaytest = 9,
	ExperimentalTagging = 10,
	SimulateDegradedNetworkConditions = 11,
	ToggleGore = 12,
	CalloutRegionsDebug = 13,
	DesignerToggleA = 14,
	DesignerToggleB = 15,
	DesignerToggleC = 16,
	DowntickPreround = 17,
	LookDirectionKeys = 18,
	DevInstabilityHUD = 19,
	GameplayQualityLogging = 20,
	LogMarkers = 21,
	EnableSlashCommands = 22,
	NiagaraTest = 23,
	ShowDrawVoteInCustom = 24,
	AllowShoppingWhileDead = 25,
	DeathmatchRepeatingUAV = 26,
	DeathmatchEncourageFarSpawning = 27,
	DatadogEventing = 28,
	GameDataExport = 29,
	ReuseCharacterHUDWidgets = 30,
	RegisterEquippableVisibility = 31,
	FixedColorTeams = 32,
	RoundStateLog = 33,
	DisableEquippableAnimationInFXCs = 34,
	EnableHRTFSetting = 35,
	Coaches = 36,
	TaggingAccuracyOverride = 37,
	ForceUpdateProblematicMinimapComponents = 38,
	GameplayNotificationsV2 = 39,
	TencentSecuritySDK = 40,
	PlayerThroughWallClipping = 41,
	PlayerThroughWallBackClipping = 42,
	PlayerMultipleClipping = 43,
	PlayerCorpseClipping = 44,
	GameDataEventPipelineRefactor = 45,
	RoundRestore = 46,
	MatchRecovery = 47,
	Hovercards = 48,
	ModesToggleA = 49,
	ModesToggleB = 50,
	ModesToggleC = 51,
	MobileLimitedSkinLoading = 52,
	EnableCharacterScaling = 53,
	TopHUDV2 = 54,
	MultipleProjectileTuning = 55,
	ReplaySystem = 56,
	ReflexLatencyAnalyzer = 57,
	SpawnAlternateRotationsPathfindToNearestEnemy = 58,
	FoWDebugCheats = 59,
	AgentMastery = 60,
	DeathDistanceScoring = 61,
	ScoreLowVisibilityPointsMoreOften = 62,
	SpawnPointLookAheadDynamicAdjustment = 63,
	UseMegamapTextureOverrides = 64,
	RationalMoveQueueTarget = 65,
	CleanPlayerStateOnDisassociate = 66,
	UseServerAuthoritativeDropOut = 67,
	FireButtonCustomization = 68,
	DevOnlyShop = 69,
	MoveDistributionTargeting = 70,
	SendPerRoundNetworkTelemetryEvents = 71,
	LiveDiagnostics = 72,
	ExpandedGestures = 73,
	EnableCombatReportEventDeferral = 74,
	AudioVisualization = 75,
	AudioVisualizationIconFootstep = 76,
	AudioVisualizationLOS = 77,
	AudioVisualizationMaterialFootstep = 78,
	MultichannelAudioVisualization = 79,
	RevertMobileFiringError = 80,
	BurstFire = 81,
	MobileAllySendRateLimiting = 82,
	PremiumContentToggle0 = 83,
	PremiumContentToggle1 = 84,
	PremiumContentToggle2 = 85,
	PremiumContentToggle3 = 86,
	PremiumContentToggle4 = 87,
	PremiumContentToggle5 = 88,
	PremiumContentToggle6 = 89,
	PremiumContentToggle7 = 90,
	PremiumContentToggle8 = 91,
	PremiumContentToggle9 = 92,
	UseMeshMaterialManager = 93,
	OmenWallToggle = 94,
	AccoladesEnabled = 95,
	PremierGameEvents = 96,
	EquippableCacheRecycling = 97,
	ViperPitIgnoreCrawlspaceToggle = 98,
	EsportsGameEvents = 99,
	ScaledHeadshotFX = 100,
	MinimapFloors = 101,
	ShortTermNPEUpdates = 102,
	FootstepDecayWhileWalking = 103,
	SystemicAbilityUpdates = 104,
	CellularPatchMultipleNodeOverlapCheck = 105,
	DisableFogOfWar = 106,
	EsportsHub = 107,
	UsePlayerloadoutsInWeaponSpawners = 108,
	AllowPatchRunAlongGround = 109,
	SetOrbTickRateLow = 110,
	ReplayTimeScrubbing = 111,
	EnableTapHoldActionBindings = 112,
	BotMovementDowntickingEnabled = 113,
	BotInterleaveMovementDowntickingEnabled = 114,
	RemoveDeletedFXCsFromPool = 115,
	DisassociateAFKPlayers = 116,
	ReplayDataGameServerCompression = 117,
	ShootingRangeBotPoolingRefactor = 118,
	AccoladesTelemetryEnabled = 119,
	DDoSDetection = 120,
	AIToggleA = 121,
	AIToggleB = 122,
	TimeShiftByMoveBundles = 123,
	LockedMapControlType = 124,
	SwapViewTargetModeToWatchSpawnedOnDeath = 125,
	DisableCharacterTickOnRangeBots = 126,
	ContextAwareModuleConsoleEnabled = 127,
	UnifyBaseAndRegionalDamageCalculation = 128,
	AllyMapEdgePortraits = 129,
	UseAIJobCoordinationBehavior = 130,
	VTSPluginEnabled = 131,
	VTSPluginObserverEnabled = 132,
	AIUseDistanceRoomPathfindingCosting = 133,
	AnimationOptimizationBTM = 134,
	AnimationOptimizationBTMAllies = 135,
	UseGrenadierInBTM = 136,
	UseNewInformationScreen = 137,
	AimToolingCloseRangeTuningEnabled = 138,
	DisableNonGamepadKeyBinds = 139,
	EnableGamepadVotingUI = 140,
	MinimapVisionConesWaitForTasks = 141,
	MuzzleFlashCulling = 142,
	RadialDamageV2 = 143,
	EnableCalculateWallPenetrationEnergyWhenDamaged = 144,
	DisableLaunchVelocityOnProjectile = 145,
	UseMeshMaterialManagerAlt = 146,
	UseEnemyAudioLocalViewTarget = 147,
	MouseKeyboardInputsTriggerPopUpWarning = 148,
	HideAbilityInCombatReport = 149,
	BotSpawningModifier = 150,
	EnableVoteRatioUpdate = 151,
	AlwaysUseSharedAudioEmitter = 152,
	ContextAwareModulePCEnabled = 153,
	LiveDesignToggle = 154,
	ApplyGamepadMapCursorInputTooling = 155,
	SpawnPointSelectionUsesEngageDistance = 156,
	PawnOverlapTrigger = 157,
	UnlimitedFuelCheatUpdate = 158,
	MTAbilityFixes = 159,
	MinimapUpdateCycles = 160,
	EnableKDCallouts = 161,
	EnableDeathmatchMedals = 162,
	UpdateNextShotTimeOnFiringRateChange = 163,
	EnableHideMuzzleFlashDuringClipping = 164,
	DisablePingInWorldVisibilityUpdate = 165,
	DisablePingVisibilityBlocking = 166,
	DisablePingTargetViewMegamapPing = 167,
	TeamColorVFXObserverFix = 168,
	EnableFoWQueryCacheImprovements = 169,
	FlankWatchExploration = 170,
	MeleeClipping = 171,
	AlarmbotImprovedTargetAcquisition = 172,
	CashewUltRunThroughFix = 173,
	SpectateDeadPlayersDuringReplayPlayback = 174,
	EnableStopAudioOnProjectileEndPlay = 175,
	FoWSkipCacheOptimization = 176,
	DisarmedEquippablePermissionRespectRestrictions = 177,
	CalculateFoWRelevanceOptimization = 178,
	FoWSupportMaxRelevantDistance = 179,
	FoWSupportMaxRelevantDistanceLongCache = 180,
	FoWMaxRelevantDistanceBeforeOverrides = 181,
	ClearSpotForCharacterOffNavFallback = 182,
	ProjectileThrowRemoveDelay = 183,
	CancelUsableOnEndPlay = 184,
	SkipHiddenUntickedRemoteTransformUpdates = 185,
	CloveStopOverhealOnDamaged = 186,
	AllowTemporaryCharacterOverlaps = 187,
	ReynaOverhealCleanupOnEquippableSetOwner = 188,
	EnableOverhealRefactor = 189,
	ZeroRadiusProjectiles = 190,
	YoruCloneSendsDeathEvent = 191,
	AllowTargetViewLandmarkMaterialSwap = 192,
	AIPerceptionIncreasedTimeSlicePerTick = 193,
	AIPerceptionIncreasedTracesPerTick = 194,
	AlarmbotLOSImprovements = 195,
	EnableSecondCameraTick = 196,
	UseCapsuleForPruneComplexRewind = 197,
	ViperUltPatchTechV2 = 198,
	TargetViewModeIgnoreFirstPerson = 199,
	FoWEnableEnhancedMetrics = 200,
	AudioBypassMaxDurationCheck = 201,
	CameraShakeConcussReapply = 202,
	UseAwakeReplicationFrequencyGFC = 203,
	ClipAfterBoneTransformsUpdated = 204,
	ControllerDrivenSpectateTargets = 205,
	AlwaysUseClipPlaneForHiddenCharacters = 206,
	EnableRGIMetrics = 207,
	ForceSendCorrectionIndexAck = 208,
	AudioEnableDoorOcclusion = 209,
	UsableComponentControlledHighlighting = 210,
	UseNewBestUsableTargetingLogic = 211,
	RemoveAllDebuffsOnCleanse = 212,
	EnableIndicatorPossessableUpdate = 213,
	EnablePlacementFixes = 214,
	AudioEnableStopSoundCleanupChecks = 215,
	PhysXSphereTriangleTraceParity = 216,
	AudioEnableStopSoundEndPlay = 217,
	ShouldMarkMatchesAsRecorded = 218,
	UseRepNotifyAbilityCooldowns = 219,
	ShouldMarkMatchesAsRecordedConsole = 220,
	DynamicContentEnabled = 221,
	UseNewBuffDebuffTagHUD = 222,
	EnableSpikePlacementRestrictions = 223,
	EnableTopHUDHealthbarHealUIChange = 224,
	AudioEnableSoundBlockerChecks = 225,
	AltModeTelemetryEnabled = 226,
	AssistBannersEnabled = 227,
	SharedSerializationReconnectReset = 228,
	PooledFXCDestroyDeactivatesComponents = 229,
	Count = 230,
	Invalid = 254,
	EGameFeatureToggleName_MAX = 255
};

// Enum ShooterGame.EGameRuleBoolName
enum class EGameRuleBoolName : uint8 {
	IsOvertimeWinByTwo = 0,
	IsOvertimeWinByTwoCapped = 1,
	AllowOvertimePriorityVote = 2,
	AllowOvertimeDrawVote = 3,
	AllowLenientSurrender = 4,
	AllowFlexibleTimeoutVote = 5,
	AllowDropOut = 6,
	SkipPregame = 7,
	AssignRandomAgents = 8,
	AllowGameModifiers = 9,
	TournamentMode = 10,
	MajorityVoteAgents = 11,
	PlayOutAllRounds = 12,
	SkipMatchHistory = 13,
	FillWithBots = 14,
	AllowDropIn = 15,
	UseMobileServerTickRate = 16,
	DestroyAbilitiesOnDeath = 17,
	PreventAbilityRecharge = 18,
	ReplayRecordMatch = 19,
	UseMapPicksAndBans = 20,
	AllowMatchTimeouts = 21,
	AllowAutomaticRemakeVote = 22,
	AimToolingModule = 23,
	AimToolingBending = 24,
	AimToolingPullToCenter = 25,
	AimToolingDeceleration = 26,
	AimToolingFrameOfReference = 27,
	AimToolingStrafeAssist = 28,
	AimToolingTargetFriction = 29,
	AimToolingGuardrails = 30,
	MovementToolingModule = 31,
	MovementToolingShotRooting = 32,
	MovementToolingFastStrafing = 33,
	MovementToolingFastRelease = 34,
	PipAbilityCasting = 35,
	CombatReportOnlyShowLastLife = 36,
	UsePrototypePurchasables = 37,
	MobileGunStability = 38,
	MobileDesignPrototype = 39,
	FootstepABTest = 40,
	UseAllAbilityCooldowns = 41,
	DownedCharactersCanGiveUp = 42,
	SpawnTurtleProtection = 43,
	PrototypeStability = 44,
	AccoladesEnabled = 45,
	PremierTournamentMode = 46,
	UseInDevWeapons = 47,
	DisableShopSelling = 48,
	ContextAwareModuleEnabled = 49,
	SkipMatchDetails = 50,
	UseLargePlayerCountServerTickRate = 51,
	AssignPreferredAgents = 52,
	AllowQueueInGame = 53,
	TempChargesAsReclaimed = 54,
	SlidesNoFallDamage = 55,
	SkipUltimateAbilityReadyVO = 56,
	AllowUnownedAgents = 57,
	FillWithClientBots = 58,
	Count = 59,
	Invalid = 254,
	EGameRuleBoolName_MAX = 255
};

// Enum ShooterGame.ECustomGameRuleDisabledReason
enum class ECustomGameRuleDisabledReason : uint8 {
	None = 0,
	TooManyObservers = 1,
	CoachSlotsOccupied = 2,
	ECustomGameRuleDisabledReason_MAX = 3
};

// Enum ShooterGame.EAresNotificationResponseType
enum class EAresNotificationResponseType : uint8 {
	Dismiss = 0,
	ActionA = 1,
	ActionB = 2,
	NoResponse = 3,
	EAresNotificationResponseType_MAX = 4
};

// Enum ShooterGame.ECrosshairsGridMode
enum class ECrosshairsGridMode : uint8 {
	Create = 0,
	Modify = 1,
	None = 2,
	ECrosshairsGridMode_MAX = 3
};

// Enum ShooterGame.EAresDamageImmunityCategory
enum class EAresDamageImmunityCategory : uint8 {
	None = 0,
	Weapon = 1,
	Ability = 2,
	World = 3,
	DamageCategory_Invalid = 254,
	EAresDamageCategory_MAX = 255,
	EAresDamageImmunityCategory_MAX = 256
};

// Enum ShooterGame.ERosterPartyMemberEligibility
enum class ERosterPartyMemberEligibility : uint8 {
	Eligible = 0,
	IneligibleAccountUnverified = 1,
	IneligibleNotOnRoster = 2,
	IneligibleHitMatchLimit = 3,
	Invalid = 4,
	ERosterPartyMemberEligibility_MAX = 5
};

// Enum ShooterGame.EChatMode
enum class EChatMode : uint8 {
	None = 0,
	Team = 1,
	All = 2,
	Ping = 3,
	Count = 4,
	EChatMode_MAX = 5
};

// Enum ShooterGame.EInventoryTransaction
enum class EInventoryTransaction : uint8 {
	Purchase = 0,
	PickUp = 1,
	FulfillRequest = 2,
	RefundRequest = 3,
	Drop = 4,
	Sell = 5,
	Transfer = 6,
	Trash = 7,
	Store = 8,
	Retrieve = 9,
	Default = 10,
	Other = 11,
	OtherGrant = 12,
	OtherRemove = 13,
	GrantDefaultRoundStart = 14,
	Count = 15,
	EInventoryTransaction_MAX = 16
};

// Enum ShooterGame.EGiftingEligibleStatus
enum class EGiftingEligibleStatus : uint8 {
	GIFTING_ELIGIBLE_STATUS_PERMANENTLY_INELIGIBLE = 0,
	GIFTING_ELIGIBLE_STATUS_CONDITIONALLY_INELIGIBLE = 1,
	GIFTING_ELIGIBLE_STATUS_ELIGIBLE = 2,
	COUNT = 3,
	EGiftingEligibleStatus_MAX = 4
};

// Enum ShooterGame.EAresItemSlot
enum class EAresItemSlot : uint8 {
	Primary = 0,
	Secondary = 1,
	Melee = 2,
	GrenadeAbility = 3,
	Ability1 = 4,
	Ability2 = 5,
	Passive = 6,
	Level = 7,
	Invisible = 8,
	Ultimate = 9,
	Unarmed = 10,
	Armor = 11,
	Backpack = 12,
	Totem = 13,
	PrimaryStorage = 14,
	SecondaryStorage = 15,
	Count = 16,
	Any = 253,
	Invalid = 254,
	EAresItemSlot_MAX = 255
};

// Enum ShooterGame.EJuiceBoxAnimation
enum class EJuiceBoxAnimation : uint8 {
	NONE = 0,
	CLOSE = 1,
	CLOSED_IDLE = 2,
	OPEN_START = 3,
	OPEN = 4,
	OPENED_IDLE = 5,
	COUNT = 6,
	EJuiceBoxAnimation_MAX = 7
};

// Enum ShooterGame.EJuiceTrayMessage
enum class EJuiceTrayMessage : uint8 {
	NONE = 0,
	ENERGY_AUTOMATIC = 1,
	MAX_KICKS_OTHERS = 2,
	METER_ALREADY_FULL = 3,
	EXTRANEOUS_ENERGY_IN_METER = 4,
	COUNT = 5,
	EJuiceTrayMessage_MAX = 6
};

// Enum ShooterGame.EAresMovementType
enum class EAresMovementType : uint8 {
	Walking = 0,
	Running = 1,
	Jumping = 2,
	Crouching = 3,
	OnAscender = 4,
	Flying = 5,
	Count = 6,
	Invalid = 254,
	EAresMovementType_MAX = 255
};

// Enum ShooterGame.EPremierTournamentPlacement
enum class EPremierTournamentPlacement : uint8 {
	FIRST = 99,
	SECOND = 98,
	THIRD = 97,
	FOURTH = 96,
	FIFTH = 95,
	SIXTH = 94,
	SEVENTH = 93,
	EIGHTH = 92,
	INPROGRESS = 1,
	NOPLACEMENT = 0,
	Count = 1,
	EPremierTournamentPlacement_MAX = 100
};

// Enum ShooterGame.EAresTempType
enum class EAresTempType : uint8 {
	None = 0,
	Temp_B = 1,
	Temp_X = 2,
	Temp_Y = 4,
	Temp_Z = 8,
	All = 15,
	EAresTempType_MAX = 16
};

// Enum ShooterGame.EProvisioningFlowID
enum class EProvisioningFlowID : uint8 {
	Invalid = 0,
	ShootingRange = 1,
	SkillTest = 2,
	CustomGame = 3,
	Matchmaking = 4,
	NewPlayerExperience = 5,
	ReplayNewPlayerExperience = 6,
	BotTrainingMatch = 7,
	Tournament = 8,
	Count = 9,
	EProvisioningFlowID_MAX = 10
};

// Enum ShooterGame.EMatchCompletionState
enum class EMatchCompletionState : uint8 {
	InProgress = 0,
	Completed = 1,
	All_Disconnected = 2,
	Team_Disconnected = 3,
	Hacking_Terminated = 4,
	Surrendered = 5,
	VoteDraw = 6,
	ForceDraw = 7,
	Remake = 8,
	Unknown = 9,
	Count = 10,
	EMatchCompletionState_MAX = 11
};

// Enum ShooterGame.EMatchupTeamState
enum class EMatchupTeamState : uint8 {
	Unassigned = 0,
	Assigned = 1,
	Winner = 2,
	Loser = 3,
	EMatchupTeamState_MAX = 4
};

// Enum ShooterGame.EMatchupTeamStatus
enum class EMatchupTeamStatus : uint8 {
	Unassigned = 0,
	Assigned = 1,
	Winner = 2,
	Loser = 3,
	EMatchupTeamStatus_MAX = 4
};

// Enum ShooterGame.EChatRoomType
enum class EChatRoomType : uint8 {
	Party = 0,
	Pregame = 1,
	All = 2,
	Team = 3,
	InGameSystem = 4,
	System = 5,
	Whisper = 6,
	Count = 7,
	EChatRoomType_MAX = 8
};

// Enum ShooterGame.EAresAlliance
enum class EAresAlliance : uint8 {
	Alliance_Ally = 0,
	Alliance_Enemy = 1,
	Alliance_Neutral = 2,
	Alliance_Any = 3,
	Alliance_Count = 4,
	Alliance_MAX = 5
};

// Enum ShooterGame.EMessagePartType
enum class EMessagePartType : uint8 {
	Text = 0,
	Notification = 1,
	Emoji = 2,
	AntiAddiction = 3,
	UntrustedText = 4,
	EMessagePartType_MAX = 5
};

// Enum ShooterGame.EMessageContentType
enum class EMessageContentType : uint8 {
	Text = 0,
	MatchDetails = 1,
	EMessageContentType_MAX = 2
};

// Enum ShooterGame.ETextChatRoomType
enum class ETextChatRoomType : uint8 {
	GroupChat = 0,
	FriendChat = 1,
	DirectMessage = 2,
	Invalid = 3,
	System = 4,
	ETextChatRoomType_MAX = 5
};

// Enum ShooterGame.EMessageSendErrorType
enum class EMessageSendErrorType : uint8 {
	PlayerNotFound = 0,
	RoomUnavailable = 1,
	Unknown = 2,
	Invalid = 3,
	Count = 4,
	EMessageSendErrorType_MAX = 5
};

// Enum ShooterGame.EMissionStatus
enum class EMissionStatus : uint8 {
	Inactive = 0,
	Active = 1,
	Completed = 2,
	Failed = 3,
	Count = 4,
	Invalid = 254,
	EMissionStatus_MAX = 255
};

// Enum ShooterGame.EMmrErrorEnum
enum class EMmrErrorEnum : uint8 {
	ErrRateExceeded = 0,
	ErrInvalid = 1,
	EMmrErrorEnum_MAX = 2
};

// Enum ShooterGame.EObjectiveEventType
enum class EObjectiveEventType : uint8 {
	Objective = 0,
	Mission = 1,
	Module = 2,
	EObjectiveEventType_MAX = 3
};

// Enum ShooterGame.EObjectiveStatus
enum class EObjectiveStatus : uint8 {
	Hidden = 0,
	Active = 1,
	Completed = 2,
	Failed = 3,
	Count = 4,
	Invalid = 254,
	EObjectiveStatus_MAX = 255
};

// Enum ShooterGame.EObjectiveType
enum class EObjectiveType : uint8 {
	Required = 0,
	Optional = 1,
	Count = 2,
	Invalid = 254,
	EObjectiveType_MAX = 255
};

// Enum ShooterGame.EOnboardingStatus
enum class EOnboardingStatus : uint8 {
	OnboardingUnknown = 0,
	NPEIncomplete = 1,
	BTMRequired = 2,
	BTMOptional = 3,
	BTMRetriable = 4,
	OnboardingComplete = 5,
	BTMUnavailable = 6,
	BTMEnhanced = 7,
	BTMEnhancedRetriable = 8,
	COUNT = 9,
	INVALID = 10,
	EOnboardingStatus_MAX = 11
};

// Enum ShooterGame.EPurchaseState
enum class EPurchaseState : uint8 {
	Initializing = 0,
	SubmittingOrder = 1,
	ProcessingOrder = 2,
	UpdatingLocalInventory = 3,
	Complete = 4,
	Failed = 5,
	Cancelled = 6,
	Timeout = 7,
	Count = 8,
	EPurchaseState_MAX = 9
};

// Enum ShooterGame.EStealthState
enum class EStealthState : uint8 {
	Inactive = 0,
	Concealed = 1,
	Revealed = 2,
	Count = 3,
	EStealthState_MAX = 4
};

// Enum ShooterGame.EAresPartyAccessibility
enum class EAresPartyAccessibility : uint8 {
	INVALID = 0,
	OPEN = 1,
	CLOSED = 2,
	EAresPartyAccessibility_MAX = 3
};

// Enum ShooterGame.EAresSocialPartyCompatibility
enum class EAresSocialPartyCompatibility : uint8 {
	Compatible = 0,
	CrossplayUnsupported = 1,
	CrossplayDisallowed = 2,
	VersionMismatch = 3,
	MultiplayerDisallowed = 4,
	Error = 5,
	EAresSocialPartyCompatibility_MAX = 6
};

// Enum ShooterGame.EAresSocialStatusTemplate
enum class EAresSocialStatusTemplate : uint8 {
	Available = 0,
	MapName = 1,
	InParty = 2,
	InPartyPremier = 3,
	Matchmaking = 4,
	AgentSelect = 5,
	MatchScore = 6,
	InTournament = 7,
	VersionMismatch = 8,
	Generic = 9,
	Blocked = 10,
	InReplay = 11,
	EAresSocialStatusTemplate_MAX = 12
};

// Enum ShooterGame.EAresSocialPresenceType
enum class EAresSocialPresenceType : uint8 {
	Online = 0,
	Busy = 1,
	Away = 2,
	Offline = 3,
	Error = 4,
	EAresSocialPresenceType_MAX = 5
};

// Enum ShooterGame.EPartyViewState
enum class EPartyViewState : uint8 {
	Default = 0,
	CustomGame = 1,
	Tournament = 2,
	Invalid = 3,
	EPartyViewState_MAX = 4
};

// Enum ShooterGame.ESoftResetReason
enum class ESoftResetReason : uint8 {
	EnvironmentMismatch = 2,
	UserLoginStatusChanged = 3,
	SessionHeartbeatFailure = 4,
	NetworkConnectionRestored = 5,
	HotfixAvailable = 6,
	PlatformFault = 7,
	GameLanguageChanged = 8,
	DebugCommandTriggered = 9,
	ErrorOnInit = 10,
	CrossplayPermissionsChanged = 11,
	None = 12,
	ESoftResetReason_MAX = 13
};

// Enum ShooterGame.EPickemBlockSlug
enum class EPickemBlockSlug : uint8 {
	Groups = 0,
	Playoffs = 1,
	Swiss = 2,
	Invalid = 3,
	EPickemBlockSlug_MAX = 4
};

// Enum ShooterGame.EAresPickemStage
enum class EAresPickemStage : uint8 {
	Upcoming = 0,
	Open = 1,
	Closed = 2,
	EAresPickemStage_MAX = 3
};

// Enum ShooterGame.EEsportsPickemMatchupTeamDisplayMode
enum class EEsportsPickemMatchupTeamDisplayMode : uint8 {
	DisplayScoring = 0,
	PickNonInteractive = 1,
	PickInteractive = 2,
	EEsportsPickemMatchupTeamDisplayMode_MAX = 3
};

// Enum ShooterGame.EPickemBracketResult
enum class EPickemBracketResult : uint8 {
	Unknown = 0,
	Correct = 1,
	Incorrect = 2,
	Count = 3,
	Invalid = 4,
	EPickemBracketResult_MAX = 5
};

// Enum ShooterGame.EPlatformFaultReason
enum class EPlatformFaultReason : uint8 {
	None = 0,
	RNetUnhealthy = 1,
	RNetDisconnected = 2,
	WrongSessionClientID = 3,
	SessionHeartbeatFail = 4,
	SessionRefreshFail = 5,
	VanguardFail = 6,
	VanguardNeedsReboot = 7,
	SessionPlatformDowntime = 8,
	AntiAddictionShutdown = 9,
	CNAntiAddictionShutdown = 10,
	NativePlatformFailure = 11,
	VanguardHardwareBan = 12,
	Count = 13,
	EPlatformFaultReason_MAX = 14
};

// Enum ShooterGame.EPremierPrestigePlating
enum class EPremierPrestigePlating : uint8 {
	NONE = 0,
	BASIC = 1,
	QUALIFIED = 2,
	Count = 3,
	EPremierPrestigePlating_MAX = 4
};

// Enum ShooterGame.EPlayerAliasError
enum class EPlayerAliasError : uint8 {
	NoError = 0,
	NameChangeForbidden = 1,
	NameNotAvailable = 2,
	RateLimited = 3,
	UnknownError = 4,
	EPlayerAliasError_MAX = 5
};

// Enum ShooterGame.EAresRegionalDamage
enum class EAresRegionalDamage : uint8 {
	RegionalDamage_Normal = 0,
	RegionalDamage_Headshot = 1,
	RegionalDamage_Legshot = 2,
	RegionalDamage_RegionCount = 3,
	RegionalDamage_Invalid_Radial = 4,
	RegionalDamage_Invalid = 5,
	RegionalDamage_CountPlusOne = 6,
	EAresRegionalDamage_MAX = 255
};

// Enum ShooterGame.EAresPlayerViewTargetMode
enum class EAresPlayerViewTargetMode : uint8 {
	None = 0,
	WatchPossessed = 1,
	SpectateAllies = 2,
	SpectateEveryone = 4,
	SpectateFreeCam = 8,
	WatchGameStateFocusObject = 16,
	NoValidViewTarget = 32,
	SpectateProjectile = 64,
	WatchSpawned = 128,
	Count = 8,
	All = 255,
	EAresPlayerViewTargetMode_MAX = 256
};

// Enum ShooterGame.EReplayPreDownloadCheckCode
enum class EReplayPreDownloadCheckCode : uint8 {
	Passed = 0,
	FileSizeNull = 1,
	NotEnoughDiskSpace = 2,
	UnexpectedFailed = 3,
	EReplayPreDownloadCheckCode_MAX = 4
};

// Enum ShooterGame.EPregameLockInState
enum class EPregameLockInState : uint8 {
	NotSelected = 0,
	CanLockIn = 1,
	CannotLockIn = 2,
	LockingIn = 3,
	LockedIn = 4,
	EPregameLockInState_MAX = 5
};

// Enum ShooterGame.EPregameMatchState
enum class EPregameMatchState : uint8 {
	MapSelectReady = 0,
	MapSelectActive = 1,
	MapSelectFinished = 2,
	CharacterSelectActive = 3,
	CharacterSelectFinished = 4,
	Provisioned = 5,
	Invalid = 6,
	Count = 7,
	EPregameMatchState_MAX = 8
};

// Enum ShooterGame.EPremierEventMapSelectionStrategy
enum class EPremierEventMapSelectionStrategy : uint8 {
	INVALID = 0,
	RANDOM = 1,
	PICKBAN = 2,
	Count = 3,
	EPremierEventMapSelectionStrategy_MAX = 4
};

// Enum ShooterGame.EPremierEventType
enum class EPremierEventType : uint8 {
	INVALID = 0,
	LEAGUE = 1,
	TOURNAMENT = 2,
	SCRIM = 3,
	Count = 4,
	EPremierEventType_MAX = 5
};

// Enum ShooterGame.EPremierRosterEnrollErrorTypeOld
enum class EPremierRosterEnrollErrorTypeOld : uint8 {
	MinumumRequiredMembers = 0,
	Default = 1,
	Count = 2,
	Invalid = 3,
	EPremierRosterEnrollErrorTypeOld_MAX = 4
};

// Enum ShooterGame.EPremierRosterInviteErrorType
enum class EPremierRosterInviteErrorType : uint8 {
	RosterLocked = 0,
	PlayerMaxRosterLimitReached = 1,
	RosterNonProvisional = 2,
	PlayerIneligibleRanked = 3,
	PlayerIneligibleAVS = 4,
	PlayerIneligibleRestrictionIneligible = 5,
	PlayerIneligibleRestrictionDisqualified = 6,
	PlayerIneligibleContenderEligibility = 7,
	InviteeChangesRosterDivisionTier = 8,
	InviteeNotEligibleAVS = 9,
	InviteeNotEligibleRanked = 10,
	InviteeNotEligibleRestrictionIneligible = 11,
	InviteeNotEligibleRestrictionDisqualified = 12,
	Default = 13,
	Count = 14,
	Invalid = 15,
	EPremierRosterInviteErrorType_MAX = 16
};

// Enum ShooterGame.EPremierRosterChangeRoleErrorType
enum class EPremierRosterChangeRoleErrorType : uint8 {
	MaxCaptainLimitReached = 0,
	Default = 1,
	Count = 2,
	Invalid = 3,
	EPremierRosterChangeRoleErrorType_MAX = 4
};

// Enum ShooterGame.ERosterMemberRole
enum class ERosterMemberRole : uint8 {
	Owner = 0,
	Captain = 1,
	Member = 2,
	Count = 3,
	Invalid = 4,
	ERosterMemberRole_MAX = 5
};

// Enum ShooterGame.EMatchOutcome
enum class EMatchOutcome : uint8 {
	Win = 0,
	Loss = 1,
	Draw = 2,
	EMatchOutcome_MAX = 3
};

// Enum ShooterGame.ETournamentStatus
enum class ETournamentStatus : uint8 {
	CREATED = 0,
	STARTED = 1,
	FINISHED = 2,
	CANCELED = 3,
	Count = 4,
	Invalid = 5,
	ETournamentStatus_MAX = 6
};

// Enum ShooterGame.ETournamentType
enum class ETournamentType : uint8 {
	ELIMINATION = 0,
	CONSOLATION = 1,
	Count = 2,
	Invalid = 3,
	ETournamentType_MAX = 4
};

// Enum ShooterGame.EMatchupStatus
enum class EMatchupStatus : uint8 {
	CREATED = 0,
	READY = 1,
	STARTED = 2,
	FINISHED = 3,
	EXCLUDED = 4,
	CANCELED = 5,
	Count = 6,
	Invalid = 7,
	EMatchupStatus_MAX = 8
};

// Enum ShooterGame.EMatchupParticipantOutcome
enum class EMatchupParticipantOutcome : uint8 {
	WIN = 0,
	LOSS = 1,
	NONE = 2,
	Count = 3,
	Invalid = 4,
	EMatchupParticipantOutcome_MAX = 5
};

// Enum ShooterGame.EMatchupBracketType
enum class EMatchupBracketType : uint8 {
	WINNERS = 0,
	LOSERS = 1,
	Count = 2,
	Invalid = 3,
	EMatchupBracketType_MAX = 4
};

// Enum ShooterGame.EPresenceProduct
enum class EPresenceProduct : uint8 {
	Ares = 0,
	Bacon = 1,
	Keystone = 2,
	LeagueOfLegends = 3,
	Invalid = 4,
	EPresenceProduct_MAX = 5
};

// Enum ShooterGame.ERewardSource
enum class ERewardSource : uint8 {
	Other = 0,
	Kill = 1,
	Death = 2,
	Spike = 3,
	Orb = 4,
	Count = 5,
	ERewardSource_MAX = 6
};

// Enum ShooterGame.EAresRewardGrantStrategy
enum class EAresRewardGrantStrategy : uint8 {
	GrantImmediately = 0,
	DelayUntilRoundEnd = 1,
	Count = 2,
	EAresRewardGrantStrategy_MAX = 3
};

// Enum ShooterGame.EPickemRegistrationStatus
enum class EPickemRegistrationStatus : uint8 {
	Unknown = 0,
	Unregistered = 1,
	Registered = 2,
	EPickemRegistrationStatus_MAX = 3
};

// Enum ShooterGame.EReplayLocalFileMatchEntryUpdateCode
enum class EReplayLocalFileMatchEntryUpdateCode : uint8 {
	General = 0,
	Removed = 1,
	CantFindEntry = 2,
	SummaryUpdateSuccess = 3,
	SummaryUpdateFailure = 4,
	PlatformFileAvailabilityUpdateSuccess = 5,
	PlatformFileAvailabilityUpdateFailure = 6,
	FileRequestDownloadFailed = 7,
	FileRequestDownloadCancelledByUser = 8,
	FileRequestDownloadCancelledBySystem = 9,
	FileRequestDownloadProgressed = 10,
	FileRequestSerializeFailed = 11,
	FileRequestNotEnoughDiskSpace = 12,
	FileRequestDownloadedAndStored = 13,
	FileDeleteAttemptFinished = 14,
	PlaybackStarting = 15,
	PlaybackStarted = 16,
	PlaybackFailed = 17,
	EReplayLocalFileMatchEntryUpdateCode_MAX = 18
};

// Enum ShooterGame.EGameFlowStateType
enum class EGameFlowStateType : uint8 {
	Initialization = 0,
	TransitionToMainMenu = 1,
	MainMenu = 2,
	TransitionToPregame = 3,
	Pregame = 4,
	TransitionToInGame = 5,
	InGame = 6,
	TransitionToWatchingReplay = 7,
	WatchingReplay = 8,
	TransitionToPlatformFaulted = 9,
	PlatformFaulted = 10,
	Invalid = 11,
	Count = 12,
	EGameFlowStateType_MAX = 13
};

// Enum ShooterGame.ERosterCreateErrorType
enum class ERosterCreateErrorType : uint8 {
	NameTaken = 0,
	NameLength = 1,
	TagLength = 2,
	InappropriateName = 3,
	RestrictedName = 4,
	Default = 5,
	Count = 6,
	Invalid = 7,
	ERosterCreateErrorType_MAX = 8
};

// Enum ShooterGame.ERosterInviteErrorType
enum class ERosterInviteErrorType : uint8 {
	RosterLocked = 0,
	PlayerMaxRosterLimitReached = 1,
	RosterNonProvisional = 2,
	PlayerIneligibleRanked = 3,
	PlayerIneligibleAVS = 4,
	PlayerIneligibleRestrictionIneligible = 5,
	PlayerIneligibleRestrictionDisqualified = 6,
	PlayerIneligibleContenderEligibility = 7,
	InviteeChangesRosterDivisionTier = 8,
	InviteeNotEligibleAVS = 9,
	InviteeNotEligibleRanked = 10,
	InviteeNotEligibleRestrictionIneligible = 11,
	InviteeNotEligibleRestrictionDisqualified = 12,
	Default = 13,
	Count = 14,
	Invalid = 15,
	ERosterInviteErrorType_MAX = 16
};

// Enum ShooterGame.ERosterChangeRoleErrorType
enum class ERosterChangeRoleErrorType : uint8 {
	MaxCaptainLimitReached = 0,
	Default = 1,
	Count = 2,
	Invalid = 3,
	ERosterChangeRoleErrorType_MAX = 4
};

// Enum ShooterGame.EAresWidgetDependentState
enum class EAresWidgetDependentState : uint8 {
	Enabled = 0,
	Disabled = 1,
	Locked = 2,
	Collapsed = 3,
	Custom = 4,
	None = 5,
	EAresWidgetDependentState_MAX = 6
};

// Enum ShooterGame.EWidgetVisibilityOption
enum class EWidgetVisibilityOption : uint8 {
	Inherit = 0,
	Visible = 1,
	Hidden = 2,
	COUNT = 3,
	EWidgetVisibilityOption_MAX = 4
};

// Enum ShooterGame.ESocialTriggerState
enum class ESocialTriggerState : uint8 {
	Default = 0,
	FriendRequests = 1,
	PartyMessages = 2,
	ESocialTriggerState_MAX = 3
};

// Enum ShooterGame.ESocialXPState
enum class ESocialXPState : uint8 {
	FeatureInactive = 0,
	PartyNotEligible = 1,
	PartyEligible = 2,
	ModeNotEligible = 3,
	ESocialXPState_MAX = 4
};

// Enum ShooterGame.EAresTeamRole
enum class EAresTeamRole : uint8 {
	None = 0,
	Attacker = 1,
	Defender = 2,
	FreeForAll = 3,
	Any = 4,
	Role_Count = 5,
	EAresTeamRole_MAX = 6
};

// Enum ShooterGame.EGiftingType
enum class EGiftingType : uint8 {
	GIFTABLE = 0,
	NOT_GIFTABLE = 1,
	GIFTABLE_ONLY = 2,
	COUNT = 3,
	EGiftingType_MAX = 4
};

// Enum ShooterGame.EStoreOfferType
enum class EStoreOfferType : uint8 {
	STOREOFFERTYPE_UNKNOWN = 0,
	STOREOFFERTYPE_ROTATING_STORE = 1,
	STOREOFFERTYPE_FEATUREDBUNDLE_INDIVIDUALITEM = 2,
	STOREOFFERTYPE_FEATUREDBUNDLE = 3,
	STOREOFFERTYPE_BONUSSTORE = 4,
	STOREOFFERTYPE_ACCESSORY = 5,
	STOREOFFERTYPE_AGENTSTORE = 6,
	STOREOFFERTYPE_MAX = 7
};

// Enum ShooterGame.EUITelemetryActionType
enum class EUITelemetryActionType : uint8 {
	None = 0,
	Click = 1,
	Hover = 2,
	Count = 3,
	Invalid = 4,
	EUITelemetryActionType_MAX = 5
};

// Enum ShooterGame.EAresTouchMode
enum class EAresTouchMode : uint8 {
	Interaction = 0,
	Edit = 1,
	EAresTouchMode_MAX = 2
};

// Enum ShooterGame.ETransitionScreenState
enum class ETransitionScreenState : uint8 {
	Loading = 0,
	NonInteractive = 1,
	Interactive = 2,
	Invalid = 3,
	Count = 4,
	ETransitionScreenState_MAX = 5
};

// Enum ShooterGame.ETrapState
enum class ETrapState : uint8 {
	Created = 0,
	Deploying = 1,
	Arming = 2,
	Armed = 3,
	Disarmed = 4,
	Triggered = 5,
	Destroyed = 6,
	ETrapState_MAX = 7
};

// Enum ShooterGame.EAresUnblockPlayerResponseErrors
enum class EAresUnblockPlayerResponseErrors : uint8 {
	NoPuuidProvided = 0,
	NotBlocked = 1,
	TargetingSelf = 2,
	InternalError = 3,
	EAresUnblockPlayerResponseErrors_MAX = 4
};

// Enum ShooterGame.EUseKeyType
enum class EUseKeyType : uint8 {
	None = 0,
	Alternate = 1,
	AgentAbility = 2,
	OrbPickup = 4,
	Ascender = 8,
	WeaponPickup = 16,
	GenericMap = 32,
	RemoveCleanse = 64,
	AnotherCharacter = 128,
	All = 255,
	Count = 8,
	EUseKeyType_MAX = 256
};

// Enum ShooterGame.EWalletType
enum class EWalletType : uint8 {
	DEFAULT = 0,
	JUICE_CONTENT = 1,
	ALL_JUICE_CURRENCY = 2,
	COUNT = 3,
	EWalletType_MAX = 4
};

// Enum ShooterGame.EWinningTeam
enum class EWinningTeam : uint8 {
	None = 0,
	TeamOne = 1,
	TeamTwo = 2,
	EWinningTeam_MAX = 3
};

// Enum ShooterGame.EPartyManagerInviteAction
enum class EPartyManagerInviteAction : uint8 {
	Accepted = 0,
	Declined = 1,
	Count = 2,
	EPartyManagerInviteAction_MAX = 3
};

// Enum ShooterGame.EPartyMessageType
enum class EPartyMessageType : uint8 {
	INVALID = 0,
	Invite = 1,
	Request = 2,
	EPartyMessageType_MAX = 3
};

// Enum ShooterGame.EAresPickemResult
enum class EAresPickemResult : uint8 {
	None = 0,
	Incorrect = 1,
	PartiallyCorrect = 2,
	Correct = 3,
	Perfect = 4,
	EAresPickemResult_MAX = 5
};

// Enum ShooterGame.EEsportsMatchOriginType
enum class EEsportsMatchOriginType : uint8 {
	Seeding = 0,
	Match = 1,
	DecisionPoint = 2,
	Count = 3,
	Invalid = 4,
	EEsportsMatchOriginType_MAX = 5
};

// Enum ShooterGame.EJanusStreamerUsed
enum class EJanusStreamerUsed : uint8 {
	None = 0,
	LocalFile = 1,
	RiotHTTP = 2,
	EJanusStreamerUsed_MAX = 3
};

// Enum ShooterGame.EPostAudioEventResult
enum class EPostAudioEventResult : uint8 {
	Success = 0,
	Fail_AudioEvent = 1,
	Fail_AudioEmitter = 2,
	Fail_AudioEventOverride = 3,
	Fail_ShouldPlaySound = 4,
	Fail_ShouldPlaySoundAlliance = 5,
	Fail_ShouldPlaySoundPerspective = 6,
	Fail_ShouldPlaySoundContext = 7,
	EPostAudioEventResult_MAX = 8
};

// Enum ShooterGame.EPremierPrestigesAwardUnlockStatus
enum class EPremierPrestigesAwardUnlockStatus : uint8 {
	NONE = 0,
	ACTIVE = 1,
	PROVISIONAL = 2,
	Count = 3,
	EPremierPrestigesAwardUnlockStatus_MAX = 4
};

// Enum ShooterGame.EPremierPrestigeHighlightedAwardType
enum class EPremierPrestigeHighlightedAwardType : uint8 {
	NONE = 0,
	BASIC = 1,
	QUALIFIED = 2,
	CHAMPSAURA = 3,
	Count = 4,
	EPremierPrestigeHighlightedAwardType_MAX = 5
};

// Enum ShooterGame.EPremierRosterType
enum class EPremierRosterType : uint8 {
	NONE = 0,
	VCT = 1,
	CL = 2,
	Count = 3,
	EPremierRosterType_MAX = 4
};

// Enum ShooterGame.EWidgetLayoutPresetType
enum class EWidgetLayoutPresetType : uint8 {
	Simple = 0,
	Advanced = 1,
	Experimental = 2,
	Custom = 3,
	None = 255,
	EWidgetLayoutPresetType_MAX = 256
};

// Enum ShooterGame.ELobbyContentType
enum class ELobbyContentType : uint8 {
	None = 0,
	MatchmadeQueues = 1,
	CustomModes = 2,
	CustomMaps = 3,
	ELobbyContentType_MAX = 4
};

// Enum ShooterGame.EAresPlayerRestrictionType
enum class EAresPlayerRestrictionType : uint8 {
	TEXT_COMMS = 0,
	VOICE_COMMS = 1,
	COMPETITIVE_QUEUE = 2,
	EAresPlayerRestrictionType_MAX = 3
};

// Enum ShooterGame.EAresDirectionalDamage
enum class EAresDirectionalDamage : uint8 {
	DirectionalDamage_Front = 0,
	DirectionalDamage_Left = 1,
	DirectionalDamage_Right = 2,
	DirectionalDamage_Rear = 3,
	DirectionalDamage_Count = 4,
	DirectionalDamage_Invalid = 254,
	EAresDirectionalDamage_MAX = 255
};

// Enum ShooterGame.EAresSocialTransitionType
enum class EAresSocialTransitionType : uint8 {
	Animate = 0,
	Instant = 1,
	EAresSocialTransitionType_MAX = 2
};

// Enum ShooterGame.EAresSocialFolderExpansionState
enum class EAresSocialFolderExpansionState : uint8 {
	Expanded = 0,
	Collapsed = 1,
	EAresSocialFolderExpansionState_MAX = 2
};

// Enum ShooterGame.EAresSocialFolderVisibilityState
enum class EAresSocialFolderVisibilityState : uint8 {
	Visible = 0,
	Hidden = 1,
	EAresSocialFolderVisibilityState_MAX = 2
};

// Enum ShooterGame.EStopEffectType
enum class EStopEffectType : uint8 {
	Normal = 0,
	ForceKill = 1,
	EStopEffectType_MAX = 2
};

// Enum ShooterGame.EMenuShellGameLoop
enum class EMenuShellGameLoop : uint8 {
	INVALID = 0,
	PreInit = 1,
	Init = 2,
	MainMenu = 4,
	Pregame = 8,
	InGame = 16,
	COUNT = 17,
	EMenuShellGameLoop_MAX = 18
};

// Enum ShooterGame.ETickerSeverity
enum class ETickerSeverity : uint8 {
	Ok = 0,
	Warning = 1,
	Error = 2,
	ETickerSeverity_count = 3,
	ETickerSeverity_MAX = 4
};

// Enum ShooterGame.EUsableCancelReason
enum class EUsableCancelReason : uint8 {
	CharacterDead = 0,
	Unusable = 1,
	Cancelled = 2,
	EUsableCancelReason_MAX = 3
};

// Enum ShooterGame.EAresSocialTabSelectionDirection
enum class EAresSocialTabSelectionDirection : uint8 {
	Forwards = 0,
	Backwards = 1,
	EAresSocialTabSelectionDirection_MAX = 2
};

// Enum ShooterGame.EProgressModelStage
enum class EProgressModelStage : uint8 {
	NotStarted = 0,
	Paused = 1,
	Running = 2,
	Completed = 3,
	Count = 4,
	EProgressModelStage_MAX = 5
};

// Enum ShooterGame.EAnimationConductorNodeResetType
enum class EAnimationConductorNodeResetType : uint8 {
	Normal = 0,
	ForceReset = 1,
	EAnimationConductorNodeResetType_MAX = 2
};

// Enum ShooterGame.EUserActionState
enum class EUserActionState : uint8 {
	Hidden = 0,
	Disabled = 1,
	Enabled = 2,
	EUserActionState_MAX = 3
};

// Enum ShooterGame.EUserActionTriggerResponse
enum class EUserActionTriggerResponse : uint8 {
	Handled = 0,
	Rejected = 1,
	Ignored = 2,
	EUserActionTriggerResponse_MAX = 3
};

// Enum ShooterGame.EListItemDisplayEntryActivationType
enum class EListItemDisplayEntryActivationType : uint8 {
	Highlighted = 0,
	Committed = 1,
	EListItemDisplayEntryActivationType_MAX = 2
};

// Enum ShooterGame.ESimpleSectionHeadersListModelBase_LocationType
enum class ESimpleSectionHeadersListModelBase_LocationType : uint8 {
	Invalid = 0,
	Inner = 1,
	Header = 2,
	ESimpleSectionHeadersListModelBase_MAX = 3
};

// Enum ShooterGame.EUpgradeCostType
enum class EUpgradeCostType : uint8 {
	Money = 0,
	Energy = 1,
	UltimateHighWater = 2,
	Count = 3,
	EUpgradeCostType_MAX = 4
};

// Enum ShooterGame.EAccountXPXPSourceID
enum class EAccountXPXPSourceID : uint8 {
	MatchWin = 0,
	TimePlayed = 1,
	FirstWinOfTheDay = 2,
	EAccountXPXPSourceID_MAX = 3
};

// Enum ShooterGame.EActionBindSetAxisDirection
enum class EActionBindSetAxisDirection : uint8 {
	NoDirection = 0,
	Positive = 1,
	Negative = 2,
	Count = 3,
	EActionBindSetAxisDirection_MAX = 4
};

// Enum ShooterGame.EActionBindPendingMode
enum class EActionBindPendingMode : uint8 {
	Applied = 0,
	Pending = 1,
	EActionBindPendingMode_MAX = 2
};

// Enum ShooterGame.EActionBindResetType
enum class EActionBindResetType : uint8 {
	All = 0,
	PendingOnly = 1,
	Count = 2,
	EActionBindResetType_MAX = 3
};

// Enum ShooterGame.EActionBindSetUserLayer
enum class EActionBindSetUserLayer : uint8 {
	Default = 0,
	CustomBase = 1,
	Character = 2,
	Top = 2,
	Count = 3,
	Invalid = 254,
	EActionBindSetUserLayer_MAX = 255
};

// Enum ShooterGame.EActionChordKeyType
enum class EActionChordKeyType : uint8 {
	KeyboardMouse = 0,
	Gamepad = 1,
	Count = 2,
	EActionChordKeyType_MAX = 3
};

// Enum ShooterGame.EActionSettingsContext
enum class EActionSettingsContext : uint8 {
	None = 0,
	InGame = 1,
	Menus = 2,
	Shop = 3,
	Minimap = 4,
	Spectator = 5,
	Observer = 6,
	CommMenu = 7,
	AlternateMovement = 8,
	AlternateInGame = 9,
	Count = 10,
	EActionSettingsContext_MAX = 11
};

// Enum ShooterGame.EActionBindRestrictions
enum class EActionBindRestrictions : uint8 {
	Free = 0,
	Locked = 1,
	Restricted = 2,
	Count = 3,
	EActionBindRestrictions_MAX = 4
};

// Enum ShooterGame.EAIAimTargetType
enum class EAIAimTargetType : uint8 {
	Invalid = 0,
	MovementDirection = 1,
	DefenseWatchLocation = 2,
	OutOfCombatPreaim = 3,
	PreaimCombatTarget = 4,
	CombatTarget = 5,
	Override = 6,
	ShootablePathBlocker = 7,
	Count = 8,
	EAIAimTargetType_MAX = 9
};

// Enum ShooterGame.EAnimationConductorNodePropagationMode
enum class EAnimationConductorNodePropagationMode : uint8 {
	SingleNode = 0,
	Recursive = 1,
	EAnimationConductorNodePropagationMode_MAX = 2
};

// Enum ShooterGame.EAresShooterAnimMovementDirection
enum class EAresShooterAnimMovementDirection : uint8 {
	None = 0,
	North = 1,
	East = 2,
	South = 3,
	West = 4,
	NorthEast = 5,
	SouthEast = 6,
	SouthWest = 7,
	NorthWest = 8,
	EAresShooterAnimMovementDirection_MAX = 9
};

// Enum ShooterGame.EAresShooterAnimMovementState
enum class EAresShooterAnimMovementState : uint8 {
	Idle = 0,
	Walk = 1,
	Run = 2,
	CrouchIdle = 3,
	CrouchWalk = 4,
	Jump = 5,
	Dead = 6,
	EAresShooterAnimMovementState_MAX = 7
};

// Enum ShooterGame.EAnimArrayDirtyFlags
enum class EAnimArrayDirtyFlags : uint8 {
	None = 0,
	FirstPerson = 1,
	ThirdPerson = 2,
	HitReaction = 4,
	EAnimArrayDirtyFlags_MAX = 5
};

// Enum ShooterGame.EAnimMovementStateMachineState
enum class EAnimMovementStateMachineState : uint8 {
	Idle = 0,
	Walk = 1,
	Run = 2,
	Crouch = 3,
	CrouchIdle = 4,
	CrouchWalk = 5,
	StandUp = 6,
	Jump = 7,
	JumpLand = 8,
	MovementConduit = 9,
	Count = 10,
	EAnimMovementStateMachineState_MAX = 11
};

// Enum ShooterGame.EDisplayType
enum class EDisplayType : uint8 {
	None = 0,
	PassiveDisplay = 1,
	ModalDialog = 2,
	Invalid = 3,
	EDisplayType_MAX = 4
};

// Enum ShooterGame.EPolicyType
enum class EPolicyType : uint8 {
	None = 0,
	Shutdown = 1,
	PlayTime = 2,
	WarningMessage = 3,
	MatchmakingDisable = 4,
	HopeWarning = 5,
	HopeShutdown = 6,
	HopeHeartbeat = 7,
	Invalid = 8,
	EPolicyType_MAX = 9
};

// Enum ShooterGame.EApplyBuffTarget
enum class EApplyBuffTarget : uint8 {
	Self = 0,
	OtherActor = 1,
	EApplyBuffTarget_MAX = 2
};

// Enum ShooterGame.EActionButtonStateTransitionMethod
enum class EActionButtonStateTransitionMethod : uint8 {
	TransitionOnPressAndRelease = 0,
	TransitionOnPressOnly = 1,
	TransitionOnReleaseOnly = 2,
	DoNotTransition = 3,
	EActionButtonStateTransitionMethod_MAX = 4
};

// Enum ShooterGame.EActionButtonActivationMode
enum class EActionButtonActivationMode : uint8 {
	ActivateOnEngage = 0,
	ActivateOnDisengage = 1,
	ActiveWhileEngaged = 2,
	CustomDefinedActivation = 3,
	DoNotActivate = 4,
	EActionButtonActivationMode_MAX = 5
};

// Enum ShooterGame.EAresImpactEffectWithArmor
enum class EAresImpactEffectWithArmor : uint8 {
	WithoutArmor = 0,
	WithArmor = 1,
	WithShield = 2,
	NUM_WITH_ARMOR = 3,
	EAresImpactEffectWithArmor_MAX = 4
};

// Enum ShooterGame.EAresImpactEffectAllies
enum class EAresImpactEffectAllies : uint8 {
	AllyHit = 0,
	EnemyHit = 1,
	NUM_ALLIES = 2,
	EAresImpactEffectAllies_MAX = 3
};

// Enum ShooterGame.EAIAimPlayerCharacterOffset
enum class EAIAimPlayerCharacterOffset : uint8 {
	Body = 0,
	Head = 1,
	Leg = 2,
	Count = 3,
	EAIAimPlayerCharacterOffset_MAX = 4
};

// Enum ShooterGame.ECalloutSuperRegion
enum class ECalloutSuperRegion : uint8 {
	Unspecified = 0,
	AttackerSide = 1,
	DefenderSide = 2,
	Mid = 3,
	A = 4,
	B = 5,
	C = 6,
	ECalloutSuperRegion_Count = 7,
	ECalloutSuperRegion_MAX = 8
};

// Enum ShooterGame.EAresCeremonyTriggerType
enum class EAresCeremonyTriggerType : uint8 {
	Kill = 0,
	Respawn = 1,
	Invalid = 2,
	EAresCeremonyTriggerType_MAX = 3
};

// Enum ShooterGame.ECharacterAbilitySlot
enum class ECharacterAbilitySlot : uint8 {
	Passive = 0,
	Ability1 = 1,
	Ability2 = 2,
	Grenade = 3,
	Ultimate = 4,
	Backpack = 5,
	Invalid = 6,
	Count = 6,
	ECharacterAbilitySlot_MAX = 7
};

// Enum ShooterGame.EOnlineMode
enum class EOnlineMode : uint8 {
	Offline = 0,
	LAN = 1,
	Online = 2,
	EOnlineMode_MAX = 3
};

// Enum ShooterGame.EAresButtonTransitionType
enum class EAresButtonTransitionType : uint8 {
	None = 0,
	Hovered = 1,
	Unhovered = 2,
	Pressed = 3,
	Released = 4,
	Selected = 5,
	Deselected = 6,
	Enabled = 7,
	Disabled = 8,
	Max = 9,
	EAresButtonTransitionType_MAX = 10
};

// Enum ShooterGame.ETileDisplayMode
enum class ETileDisplayMode : uint8 {
	Normal = 0,
	NoScrollBar = 1,
	Restricted = 2,
	ETileDisplayMode_MAX = 3
};

// Enum ShooterGame.EAresContextMenuItemFilterRule
enum class EAresContextMenuItemFilterRule : uint8 {
	Inclusive = 0,
	Exclusive = 1,
	EAresContextMenuItemFilterRule_MAX = 2
};

// Enum ShooterGame.AresDamageEventClassIDs
enum class AresDamageEventClassIDs : uint8 {
	AresDamageEventClassID_Base = 128,
	AresDamageEventClassID_MAX = 129
};

// Enum ShooterGame.EAresDoorState
enum class EAresDoorState : uint8 {
	Open = 0,
	Opening = 1,
	Closing = 2,
	Closed = 3,
	Invalid = 4,
	EAresDoorState_MAX = 5
};

// Enum ShooterGame.EAresInitialDoorState
enum class EAresInitialDoorState : uint8 {
	Open = 0,
	Closed = 1,
	EAresInitialDoorState_MAX = 2
};

// Enum ShooterGame.EAresDoorTransition
enum class EAresDoorTransition : uint8 {
	MoveTo = 0,
	PopTo = 1,
	EAresDoorTransition_MAX = 2
};

// Enum ShooterGame.EEjectableType
enum class EEjectableType : uint8 {
	Unknown = 0,
	ShellCasing = 1,
	Magazine = 2,
	EEjectableType_MAX = 3
};

// Enum ShooterGame.EAutoEquipPriority
enum class EAutoEquipPriority : uint8 {
	NeverAutoEquip = 0,
	Melee = 1,
	Secondary = 2,
	Primary = 3,
	EAutoEquipPriority_MAX = 4
};

// Enum ShooterGame.EEquippableEquipBehavior
enum class EEquippableEquipBehavior : uint8 {
	RequireResources = 0,
	AlwaysEquip = 1,
	NeverEquip = 2,
	Count = 3,
	EEquippableEquipBehavior_MAX = 4
};

// Enum ShooterGame.EEquippableSuppressionBehavior
enum class EEquippableSuppressionBehavior : uint8 {
	Suppressible = 0,
	NonSuppressible = 1,
	Count = 2,
	EEquippableSuppressionBehavior_MAX = 3
};

// Enum ShooterGame.EFirstPersonHideOption
enum class EFirstPersonHideOption : uint8 {
	None = 0,
	ForceVisible = 1,
	ForceInvisible = 2,
	Count = 3,
	EFirstPersonHideOption_MAX = 4
};

// Enum ShooterGame.EZoomInHideOption
enum class EZoomInHideOption : uint8 {
	LeaveVisible = 0,
	OnZoomInStarted = 1,
	WhenFullyZoomedIn = 2,
	Count = 3,
	EZoomInHideOption_MAX = 4
};

// Enum ShooterGame.EZoomOutShowOption
enum class EZoomOutShowOption : uint8 {
	OnUnZoomStarted = 0,
	WhenFullyZoomedOut = 1,
	Count = 2,
	EZoomOutShowOption_MAX = 3
};

// Enum ShooterGame.EAresEquippableCanUseResult
enum class EAresEquippableCanUseResult : uint8 {
	CanUse = 0,
	CantUse = 1,
	NotEnoughCharges = 2,
	Count = 3,
	EAresEquippableCanUseResult_MAX = 4
};

// Enum ShooterGame.EAresDropOnDeath
enum class EAresDropOnDeath : uint8 {
	Never = 0,
	IfNoPrimary = 1,
	Always = 2,
	Count = 3,
	Invalid = 254,
	EAresDropOnDeath_MAX = 255
};

// Enum ShooterGame.EEquippableTickState
enum class EEquippableTickState : uint8 {
	TickFromActorTickGraph = 0,
	TickFromInventory = 1,
	Disabled = 2,
	Count = 3,
	EEquippableTickState_MAX = 4
};

// Enum ShooterGame.EEquippableTickContents
enum class EEquippableTickContents : uint8 {
	TickEntireActor = 0,
	TickStabilityComponentsOnly = 1,
	TickDebugOnly = 2,
	TickDisabled = 3,
	Count = 4,
	EEquippableTickContents_MAX = 5
};

// Enum ShooterGame.EAresActivationInputType
enum class EAresActivationInputType : uint8 {
	StandardInput = 0,
	AlternateInput = 1,
	AlternateInput2 = 2,
	AlternateInput3 = 3,
	AlternateInput4 = 4,
	ActivationInputType_Count = 5,
	EAresActivationInputType_MAX = 6
};

// Enum ShooterGame.EAresEquippableSlotViewType
enum class EAresEquippableSlotViewType : uint8 {
	Show = 0,
	HideIfEmpty = 1,
	Hide = 2,
	EAresEquippableSlotViewType_MAX = 3
};

// Enum ShooterGame.EAresMinimapVisibility
enum class EAresMinimapVisibility : uint8 {
	All = 0,
	Allies = 1,
	Enemies = 2,
	Instigator = 3,
	EAresMinimapVisibility_MAX = 4
};

// Enum ShooterGame.EAresMinimapOverflowBehavior
enum class EAresMinimapOverflowBehavior : uint8 {
	Hide = 0,
	Show = 1,
	EAresMinimapOverflowBehavior_MAX = 2
};

// Enum ShooterGame.EFlushSeverity
enum class EFlushSeverity : uint8 {
	None = 0,
	EnsureWithReporting = 1,
	Check = 2,
	EFlushSeverity_MAX = 3
};

// Enum ShooterGame.ETeleporterEventType
enum class ETeleporterEventType : uint8 {
	Player = 0,
	Item = 1,
	Count = 2,
	ETeleporterEventType_MAX = 3
};

// Enum ShooterGame.EAresGameEventLogSampleState
enum class EAresGameEventLogSampleState : uint8 {
	SamplingDisabled = 0,
	SamplingEnabled = 1,
	EAresGameEventLogSampleState_MAX = 2
};

// Enum ShooterGame.EEconomyTypes
enum class EEconomyTypes : uint8 {
	Standard = 0,
	SwiftPips = 1,
	Other = 2,
	EEconomyTypes_MAX = 3
};

// Enum ShooterGame.EMVPCriteria
enum class EMVPCriteria : uint8 {
	Score = 0,
	Kills = 1,
	EMVPCriteria_MAX = 2
};

// Enum ShooterGame.EBuffEffectContext
enum class EBuffEffectContext : uint8 {
	Instigator = 0,
	Causer = 1,
	BuffEffectContext_Count = 2,
	EBuffEffectContext_MAX = 3
};

// Enum ShooterGame.EGauntletExitCode
enum class EGauntletExitCode : uint8 {
	Success = 0,
	Failure = 1,
	EGauntletExitCode_MAX = 2
};

// Enum ShooterGame.EAresHitConfirmLocality
enum class EAresHitConfirmLocality : uint8 {
	HitConfirm_Shooter = 0,
	HitConfirm_Shootee = 1,
	HitConfirm_Observer = 2,
	HitConfirm_Count = 3,
	HitConfirm_MAX = 4
};

// Enum ShooterGame.EDirectionFilter
enum class EDirectionFilter : uint8 {
	FrontBack = 0,
	FourWay = 1,
	EDirectionFilter_MAX = 255
};

// Enum ShooterGame.EAresHudElementBlendLogic
enum class EAresHudElementBlendLogic : uint8 {
	Automatic = 0,
	Opaque = 1,
	Count = 2,
	EAresHudElementBlendLogic_MAX = 3
};

// Enum ShooterGame.EAresDrawOrigin
enum class EAresDrawOrigin : uint8 {
	UpperLeft = 0,
	Center = 1,
	Top = 2,
	UpperRight = 3,
	CenterLeft = 4,
	CenterRight = 5,
	BottomLeft = 6,
	Bottom = 7,
	BottomRight = 8,
	Count = 9,
	EAresDrawOrigin_MAX = 10
};

// Enum ShooterGame.ELocalPlayerAffinity
enum class ELocalPlayerAffinity : uint8 {
	Self = 0,
	Ally = 1,
	Enemy = 2,
	Neutral = 3,
	Count = 4,
	ELocalPlayerAffinity_MAX = 5
};

// Enum ShooterGame.EAresHudAnchorPoint
enum class EAresHudAnchorPoint : uint8 {
	TopLeft = 0,
	Top = 1,
	TopRight = 2,
	CenterLeft = 3,
	Center = 4,
	CenterRight = 5,
	BottomLeft = 6,
	Bottom = 7,
	BottomRight = 8,
	EAresHudAnchorPoint_MAX = 9
};

// Enum ShooterGame.EAresHudTextExtentsMode
enum class EAresHudTextExtentsMode : uint8 {
	UseMaxHeight = 0,
	UseBaseline = 1,
	Count = 2,
	EAresHudTextExtentsMode_MAX = 3
};

// Enum ShooterGame.EAresIconButtonState
enum class EAresIconButtonState : uint8 {
	Disengaged = 0,
	Engaged = 1,
	EAresIconButtonState_MAX = 2
};

// Enum ShooterGame.EAresIconButtonOverrides
enum class EAresIconButtonOverrides : uint8 {
	IconTexture = 0,
	IconColor = 1,
	IconScale = 2,
	ButtonColor = 3,
	ButtonSize = 4,
	ButtonText = 5,
	MAX = 6
};

// Enum ShooterGame.EAresIconButtonSize
enum class EAresIconButtonSize : uint8 {
	Small = 0,
	Medium = 1,
	Large = 2,
	Custom = 3,
	EAresIconButtonSize_MAX = 4
};

// Enum ShooterGame.EImpactEffectAudioCreationState
enum class EImpactEffectAudioCreationState : uint8 {
	ShouldNotCreate = 0,
	ShouldCreate = 1,
	Creating = 2,
	Done = 3,
	EImpactEffectAudioCreationState_MAX = 4
};

// Enum ShooterGame.EAresImpactOrder
enum class EAresImpactOrder : uint8 {
	FirstImpact = 0,
	FirstTerminating = 1,
	WallEntryImpact = 2,
	WallEntryTerminatingImpact = 3,
	WallExitImpact = 4,
	ImpactOrder_Count = 5,
	EAresImpactOrder_MAX = 6
};

// Enum ShooterGame.EAresMoveInput
enum class EAresMoveInput : uint8 {
	AlternateMovement = 0,
	Crouch = 1,
	Count = 2,
	Invalid = 254,
	EAresMoveInput_MAX = 255
};

// Enum ShooterGame.EAresInputEventDebugStatus
enum class EAresInputEventDebugStatus : uint8 {
	Uninitialized = 0,
	ClientDropped = 1,
	ClientSent = 2,
	ClientDisagreement = 3,
	ServerReceived = 4,
	ServerPending = 5,
	ServerProcessed = 6,
	ServerDisagreement = 7,
	Count = 8,
	EAresInputEventDebugStatus_MAX = 9
};

// Enum ShooterGame.EInputEventType
enum class EInputEventType : uint8 {
	EquippableInput = 0,
	ActivationInput = 1,
	UnequipCurrentEquippable = 2,
	MovementInput = 3,
	EquippableChange = 4,
	AimVector = 5,
	CorrectionIndex = 6,
	FrameBoundary = 7,
	EquippableDrop = 8,
	CorrectionBaseline = 9,
	UseInteractableObject = 10,
	AimToolingTargetChange = 11,
	AimToolingAimPastTarget = 12,
	Count = 13,
	Invalid = 254,
	EInputEventType_MAX = 255
};

// Enum ShooterGame.EInventoryInputStreamResponse
enum class EInventoryInputStreamResponse : uint8 {
	Process = 0,
	Skip = 1,
	EInventoryInputStreamResponse_MAX = 2
};

// Enum ShooterGame.EServerCorrectionState
enum class EServerCorrectionState : uint8 {
	Agreement = 0,
	MonitorDisagreement = 1,
	PendingEquippableReplication = 2,
	CorrectionIssued = 3,
	Count = 4,
	EServerCorrectionState_MAX = 5
};

// Enum ShooterGame.EItemWrap
enum class EItemWrap : uint8 {
	Wrap = 0,
	DoNotWrap = 1,
	EItemWrap_MAX = 2
};

// Enum ShooterGame.EStorageClashBehavior
enum class EStorageClashBehavior : uint8 {
	None = 0,
	DestroyStored = 1,
	DestroyEquipped = 2,
	Count = 3,
	EStorageClashBehavior_MAX = 4
};

// Enum ShooterGame.EEquippableInInventory
enum class EEquippableInInventory : uint8 {
	No = 0,
	Yes = 1,
	EEquippableInInventory_MAX = 2
};

// Enum ShooterGame.EListenerTrackerType
enum class EListenerTrackerType : uint8 {
	Aud_ListerTracker_Spherical = 0,
	Aud_ListerTracker_Spline = 1,
	Aud_ListerTracker_MeshCollision = 2,
	Aud_ListerTracker_MAX = 3
};

// Enum ShooterGame.EListenerTrackerHeightOverride
enum class EListenerTrackerHeightOverride : uint8 {
	Aud_TrackerEmitterHeightOverride_None = 0,
	Aud_TrackerEmitterHeightOverride_Listener = 1,
	Aud_TrackerEmitterHeightOverride_TrackerObject = 2,
	Aud_TrackerEmitterHeightOverride_MAX = 3
};

// Enum ShooterGame.EAresDateTimeStyle
enum class EAresDateTimeStyle : uint8 {
	Default = 0,
	Short = 1,
	Medium = 2,
	Long = 3,
	Full = 4,
	EAresDateTimeStyle_MAX = 5
};

// Enum ShooterGame.DeltaBarToAnimate
enum class DeltaBarToAnimate : uint8 {
	Delta_One = 0,
	Delta_Two = 1,
	Delta_Three = 2,
	Delta_Four = 3,
	Delta_Bar_Count = 4,
	Delta_MAX = 5
};

// Enum ShooterGame.EAresMinimapPositionSource
enum class EAresMinimapPositionSource : uint8 {
	AMPSRC_ComponentPosition = 0,
	AMPSRC_ActorPosition = 1,
	AMPSRC_SpecifiedLocation = 2,
	AMPSRC_Center = 3,
	AMPSRC_Cursor = 4,
	AMPSRC_Custom = 5,
	AMPSRC_None = 6,
	AMPSRC_MAX = 7
};

// Enum ShooterGame.EAresMinimapRotationSource
enum class EAresMinimapRotationSource : uint8 {
	AMRSRC_ComponentAim = 0,
	AMRSRC_ActorAim = 1,
	AMRSRC_Rotation = 2,
	AMRSRC_Upright = 3,
	AMRSRC_Custom = 4,
	AMRSRC_None = 5,
	AMRSRC_MAX = 6
};

// Enum ShooterGame.EAresMapIdentifier
enum class EAresMapIdentifier : uint8 {
	Minimap = 0,
	Megamap = 1,
	AbilityMapTargeting = 2,
	Count = 3,
	EAresMapIdentifier_MAX = 4
};

// Enum ShooterGame.EAresMissionType
enum class EAresMissionType : uint8 {
	None = 0,
	Daily = 1,
	Weekly = 2,
	NPE = 3,
	BTE = 4,
	Tutorial = 5,
	Accord = 6,
	Invalid = 7,
	Count = 8,
	EAresMissionType_MAX = 9
};

// Enum ShooterGame.EAresMissionTag
enum class EAresMissionTag : uint8 {
	Combat = 0,
	Econ = 1,
	Invalid = 2,
	Count = 3,
	EAresMissionTag_MAX = 4
};

// Enum ShooterGame.EAresNetworkErrorType
enum class EAresNetworkErrorType : uint8 {
	MovementQueueOverflow = 0,
	InputQueueOverflow = 1,
	Count = 2,
	EAresNetworkErrorType_MAX = 3
};

// Enum ShooterGame.EPartyMessageListDisplayType
enum class EPartyMessageListDisplayType : uint8 {
	INVALID = 0,
	Invites = 1,
	Requests = 2,
	InvitesAndRequests = 3,
	EPartyMessageListDisplayType_MAX = 4
};

// Enum ShooterGame.EAresPersistBehavior
enum class EAresPersistBehavior : uint8 {
	Destroy = 0,
	Ignore = 1,
	EAresPersistBehavior_MAX = 2
};

// Enum ShooterGame.EAresPlatformWidgetFamily
enum class EAresPlatformWidgetFamily : uint8 {
	INVALID = 0,
	LevelTransitionScreens = 1,
	EndOfGame = 2,
	MainMenuGlobalElements = 3,
	NPEHUDElements = 4,
	Premier = 5,
	DailyRewards = 6,
	Store = 7,
	Social = 8,
	EsportsHub = 9,
	Janus = 10,
	COUNT = 11,
	EAresPlatformWidgetFamily_MAX = 12
};

// Enum ShooterGame.EAresPlatformType
enum class EAresPlatformType : uint8 {
	None = 0,
	Desktop = 1,
	Mobile = 2,
	Console = 4,
	All = 7,
	EAresPlatformType_MAX = 8
};

// Enum ShooterGame.EAresPlatformType_NEW
enum class EAresPlatformType_NEW : uint8 {
	None = 0,
	Playstation = 1,
	Xbox = 2,
	All = 3,
	EAresPlatformType_MAX = 4
};

// Enum ShooterGame.EAresIdentitySource
enum class EAresIdentitySource : uint8 {
	Default = 0,
	Alternative1 = 1,
	Alternative2 = 2,
	Alternative_P = 3,
	EAresIdentitySource_MAX = 4
};

// Enum ShooterGame.EAresFriendshipSource
enum class EAresFriendshipSource : uint8 {
	None = 0,
	RiotPlatform = 1,
	ActiveConsolePlatform = 2,
	TempP = 4,
	All = 7,
	EAresFriendshipSource_MAX = 8
};

// Enum ShooterGame.EAresDeviceQuality
enum class EAresDeviceQuality : uint8 {
	Unknown = 0,
	Low = 1,
	Med = 2,
	High = 3,
	Ultra = 4,
	PC = 5,
	Count = 6,
	EAresDeviceQuality_MAX = 7
};

// Enum ShooterGame.EAresNetworkConnectionType
enum class EAresNetworkConnectionType : uint8 {
	Unknown = 0,
	WiFi = 1,
	Cell = 2,
	None = 3,
	EAresNetworkConnectionType_MAX = 4
};

// Enum ShooterGame.EAresNetworkConnectionQuality
enum class EAresNetworkConnectionQuality : uint8 {
	Unknown = 0,
	Poor = 1,
	Good = 2,
	Excellent = 3,
	EAresNetworkConnectionQuality_MAX = 4
};

// Enum ShooterGame.EAresPlatformFilter
enum class EAresPlatformFilter : uint8 {
	Exact = 0,
	PreferExact = 1,
	Count = 2,
	EAresPlatformFilter_MAX = 3
};

// Enum ShooterGame.EAresAutomationMovement
enum class EAresAutomationMovement : uint8 {
	Forward = 0,
	Back = 1,
	Left = 2,
	Right = 3,
	Jump = 4,
	Crouch = 5,
	Walk = 6,
	Count = 7,
	EAresAutomationMovement_MAX = 8
};

// Enum ShooterGame.ECommsSystemOfOrigin
enum class ECommsSystemOfOrigin : uint8 {
	Undefined = 0,
	ManualTacCallout = 1,
	AutomatedTacCallout = 2,
	ECommsSystemOfOrigin_MAX = 3
};

// Enum ShooterGame.EAresClientDemoPlaybackState
enum class EAresClientDemoPlaybackState : uint8 {
	Inactive = 0,
	Playback = 1,
	InactiveInvalidData = 2,
	EAresClientDemoPlaybackState_MAX = 3
};

// Enum ShooterGame.EAresClientDemoState
enum class EAresClientDemoState : uint8 {
	Inactive = 0,
	Recording = 1,
	Playback = 2,
	EAresClientDemoState_MAX = 3
};

// Enum ShooterGame.EAresCostType
enum class EAresCostType : uint8 {
	Cost_Money = 0,
	Cost_Count = 1,
	Cost_MAX = 2
};

// Enum ShooterGame.EAresPurchasableType
enum class EAresPurchasableType : uint8 {
	Equippable = 0,
	Ammo = 1,
	Upgrade = 2,
	Count = 3,
	EAresPurchasableType_MAX = 4
};

// Enum ShooterGame.EAresPurchasableReplaceType
enum class EAresPurchasableReplaceType : uint8 {
	Sell = 0,
	Drop = 1,
	Destroy = 2,
	CannotReplace = 3,
	Count = 4,
	EAresPurchasableReplaceType_MAX = 5
};

// Enum ShooterGame.RadialMenuSlotDisplayType
enum class RadialMenuSlotDisplayType : uint8 {
	None = 0,
	Icon = 1,
	Text = 2,
	RadialMenuSlotDisplayType_MAX = 3
};

// Enum ShooterGame.ERadialMenuContextIndicator
enum class ERadialMenuContextIndicator : uint8 {
	Default = 0,
	Contextual = 1,
	ERadialMenuContextIndicator_MAX = 2
};

// Enum ShooterGame.EFormatStringPosition
enum class EFormatStringPosition : uint8 {
	None = 0,
	FirstPosition = 1,
	SecondPosition = 2,
	EFormatStringPosition_MAX = 3
};

// Enum ShooterGame.ESettingsPageVisibilityConditions
enum class ESettingsPageVisibilityConditions : uint8 {
	None = 0,
	ReplaysEnabled = 1,
	All = 1,
	Count = 1,
	ESettingsPageVisibilityConditions_MAX = 2
};

// Enum ShooterGame.ESettingStorageType
enum class ESettingStorageType : uint8 {
	Local = 0,
	Roaming = 1,
	External = 2,
	ESettingStorageType_MAX = 3
};

// Enum ShooterGame.EAresVoidSettingName
enum class EAresVoidSettingName : uint8 {
	KeyboardKeyBind = 0,
	TextChatFiltered = 1,
	Incognito = 2,
	CrosshairColor = 3,
	VideoDisplayMode = 4,
	VideoResolution = 5,
	MonitorSelection = 6,
	Letterbox = 7,
	Vsync = 8,
	AntiAliasing = 9,
	LanguageSelection = 10,
	EAresVoidSettingName_MAX = 11
};

// Enum ShooterGame.EAresAntiAliasing
enum class EAresAntiAliasing : uint8 {
	None = 0,
	MSAA2x = 1,
	MSAA4x = 2,
	MSAA8x = 3,
	FXAA = 4,
	Count = 5,
	EAresAntiAliasing_MAX = 6
};

// Enum ShooterGame.EAresPlatformRequirements
enum class EAresPlatformRequirements : uint8 {
	None = 0,
	Mouse = 1,
	Keyboard = 2,
	Touch = 4,
	Controller = 8,
	Gyro = 16,
	EAresPlatformRequirements_MAX = 17
};

// Enum ShooterGame.ESocialPartyCategory
enum class ESocialPartyCategory : uint8 {
	Invalid = 0,
	OnlineConsole = 1,
	OnlinePC = 2,
	OnlineCurrentPlatform = 3,
	OnlineOtherPlatform = 4,
	LocalParty = 5,
	ESocialPartyCategory_MAX = 6
};

// Enum ShooterGame.EAresSocialPartyAccessibility
enum class EAresSocialPartyAccessibility : uint8 {
	OpenParty = 0,
	ClosedParty = 1,
	Error = 2,
	EAresSocialPartyAccessibility_MAX = 3
};

// Enum ShooterGame.EAresSocialCrossplayState
enum class EAresSocialCrossplayState : uint8 {
	Compatible = 0,
	CrossplayDisabledPlayer = 1,
	CrossplayDisabledParty = 2,
	EAresSocialCrossplayState_MAX = 3
};

// Enum ShooterGame.EAresSocialCrossplayMessage
enum class EAresSocialCrossplayMessage : uint8 {
	Compatible = 0,
	ObservedPlayerCrossplayDisabledAndConflictsWithLocalPlayer = 1,
	ObservedPlayerCrossplayDisabledAndConflictsWithLocalParty = 2,
	ObservedPartyCrossplayDisabledAndConflictsWithLocalPlayer = 3,
	LocalPlayerCrossplayDisabledAndConflictsWithObservedPlayer = 4,
	LocalPlayerCrossplayDisabledAndConflictsWithObservedParty = 5,
	LocalPartyCrossplayDisabledAndConflictsWithObservedPlayer = 6,
	LocalPlayerAndObservedPlayerCrossplayDisabledAndConflicting = 7,
	LocalPartyAndObservedPartyCrossplayDisabledAndConflicting = 8,
	EAresSocialCrossplayMessage_MAX = 9
};

// Enum ShooterGame.ESocialCategory
enum class ESocialCategory : uint8 {
	Invalid = 0,
	Online = 1,
	OtherGame = 2,
	Offline = 3,
	PartyCompatible = 4,
	PartyIncompatible = 5,
	Invited = 6,
	Blocked = 7,
	LocalPartyMember = 8,
	ActivePlatformOnline = 9,
	ActivePlatformOnlineNoProduct = 10,
	ActivePlatformOtherGame = 11,
	ActivePlatformOffline = 12,
	ESocialCategory_MAX = 13
};

// Enum ShooterGame.EAresSocialTabBarOrientation
enum class EAresSocialTabBarOrientation : uint8 {
	Horizontal = 0,
	Vertical = 1,
	EAresSocialTabBarOrientation_MAX = 2
};

// Enum ShooterGame.EAddToStringSettingListResult
enum class EAddToStringSettingListResult : uint8 {
	Success = 0,
	NoMatchingFunction = 1,
	StringExceedsMaxCharLimit = 2,
	ListExceedsMaxSizeLimit = 3,
	StringAlreadyExists = 4,
	InvalidString = 5,
	EAddToStringSettingListResult_MAX = 6
};

// Enum ShooterGame.EAresTestAutomationStatus
enum class EAresTestAutomationStatus : uint8 {
	Uninitialized = 0,
	Loaded = 1,
	Running = 2,
	Failed = 3,
	Passed = 4,
	Aborted = 5,
	Count = 6,
	EAresTestAutomationStatus_MAX = 7
};

// Enum ShooterGame.EAresAutomationEventType
enum class EAresAutomationEventType : uint8 {
	GameFlowStateChanged = 0,
	JoinedMatch = 1,
	LeftMatch = 2,
	Count = 3,
	EAresAutomationEventType_MAX = 4
};

// Enum ShooterGame.EAresTouchBoundsShape
enum class EAresTouchBoundsShape : uint8 {
	Rectangle = 0,
	Circle = 1,
	Triangle = 2,
	EAresTouchBoundsShape_MAX = 3
};

// Enum ShooterGame.EAresTouchDoubleTapMode
enum class EAresTouchDoubleTapMode : uint8 {
	None = 0,
	ADS = 1,
	Scope = 2,
	ScopeAndADS = 3,
	Ping = 4,
	Crouch = 5,
	Jump = 6,
	SprintToggle = 7,
	WalkToggle = 8,
	WeaponSwap = 9,
	Cancel = 10,
	Use = 11,
	PrimaryFire = 12,
	AltFire = 13,
	SecondaryFire = 14,
	Reload = 15,
	GrenadeAbility = 16,
	AbilityOne = 17,
	AbilityTwo = 18,
	UltimateAbility = 19,
	EAresTouchDoubleTapMode_MAX = 20
};

// Enum ShooterGame.FAresTouchWidgetInputChannel
enum class FAresTouchWidgetInputChannel : uint8 {
	None = 0,
	Edit = 1,
	Movement = 2,
	Aiming = 4,
	Wheel = 8,
	TestMode = 16,
	FAresTouchWidgetInputChannel_MAX = 17
};

// Enum ShooterGame.FAresTouchWidgetSwipeOptions
enum class FAresTouchWidgetSwipeOptions : uint8 {
	AllowSwipesOnTouchRelease = 1,
	AllowSwipesOnTouchMove = 2,
	AllowMultipleSwipesInSinglePress = 4,
	FAresTouchWidgetSwipeOptions_MAX = 5
};

// Enum ShooterGame.EWidgetEnabledState
enum class EWidgetEnabledState : uint8 {
	Enabled = 0,
	Disabled = 1,
	EWidgetEnabledState_MAX = 2
};

// Enum ShooterGame.EAresTouchWidgetDisabledInputMode
enum class EAresTouchWidgetDisabledInputMode : uint8 {
	Passthrough = 0,
	Blocking = 1,
	EAresTouchWidgetDisabledInputMode_MAX = 2
};

// Enum ShooterGame.EAresTouchTrackingMode
enum class EAresTouchTrackingMode : uint8 {
	Local = 0,
	Global = 1,
	LocalExclusive = 2,
	EAresTouchTrackingMode_MAX = 3
};

// Enum ShooterGame.EAresTouchWidgetMode
enum class EAresTouchWidgetMode : uint8 {
	Interaction = 0,
	Edit = 1,
	Hidden = 2,
	Visible = 3,
	EAresTouchWidgetMode_MAX = 4
};

// Enum ShooterGame.EWidgetCallToActionState
enum class EWidgetCallToActionState : uint8 {
	Active = 0,
	Inactive = 1,
	Pulse = 2,
	EWidgetCallToActionState_MAX = 3
};

// Enum ShooterGame.ETrailDrawRule
enum class ETrailDrawRule : uint8 {
	NeverDraw = 0,
	DrawForFriendlies = 1,
	DrawForEnemies = 2,
	AlwaysDraw = 3,
	ETrailDrawRule_MAX = 4
};

// Enum ShooterGame.EUIMouseMode
enum class EUIMouseMode : uint8 {
	Game = 0,
	InWorldUI = 1,
	UI = 2,
	OverriddenMouseUI = 3,
	EUIMouseMode_MAX = 4
};

// Enum ShooterGame.EUIFocus
enum class EUIFocus : uint8 {
	GiveToGame = 0,
	AllowUI = 1,
	EUIFocus_MAX = 2
};

// Enum ShooterGame.EUINavigationTabListPriority
enum class EUINavigationTabListPriority : uint8 {
	None = 0,
	Persistent = 1,
	Primary = 2,
	Secondary = 3,
	COUNT = 4,
	EUINavigationTabListPriority_MAX = 5
};

// Enum ShooterGame.EHandleUserBackActionOption
enum class EHandleUserBackActionOption : uint8 {
	Enable = 0,
	Inherit = 1,
	Disable = 2,
	EHandleUserBackActionOption_MAX = 3
};

// Enum ShooterGame.EUIBridgeType
enum class EUIBridgeType : uint8 {
	Targeted = 0,
	Mini = 1,
	COUNT = 2,
	EUIBridgeType_MAX = 3
};

// Enum ShooterGame.EAresScreenVibility
enum class EAresScreenVibility : uint8 {
	Hidden = 0,
	Visible = 1,
	EAresScreenVibility_MAX = 2
};

// Enum ShooterGame.EAresButtonInteractionState
enum class EAresButtonInteractionState : uint8 {
	Idle = 0,
	Hovered = 1,
	Pressed = 2,
	Disabled = 3,
	EAresButtonInteractionState_MAX = 4
};

// Enum ShooterGame.EAngleTrackerType
enum class EAngleTrackerType : uint8 {
	Aud_VectorAngleTracker_PitchYawCombined = 0,
	Aud_VectorAngleTracker_PitchYawSeparate = 1,
	Aud_VectorAngleTracker_Pitch = 2,
	Aud_VectorAngleTracker_Yaw = 3,
	Aud_VectorAngleTracker_MAX = 4
};

// Enum ShooterGame.EAresWidgetPlayerVisibility
enum class EAresWidgetPlayerVisibility : uint8 {
	All = 0,
	AlliesAndObserver = 1,
	AlliesOnly = 2,
	LocalPlayerOnly = 3,
	Count = 4,
	EAresWidgetPlayerVisibility_MAX = 5
};

// Enum ShooterGame.EBasicAssistType
enum class EBasicAssistType : uint8 {
	Buff = 0,
	Debuff = 1,
	EBasicAssistType_MAX = 2
};

// Enum ShooterGame.ERemovalType
enum class ERemovalType : uint8 {
	Destroy = 0,
	Detach = 1,
	ERemovalType_MAX = 2
};

// Enum ShooterGame.EAttachmentPerspective
enum class EAttachmentPerspective : uint8 {
	First = 0,
	Third = 1,
	Count = 2,
	EAttachmentPerspective_MAX = 3
};

// Enum ShooterGame.EAttachmentVisibility
enum class EAttachmentVisibility : uint8 {
	Hidden = 0,
	Shown = 1,
	Count = 2,
	EAttachmentVisibility_MAX = 3
};

// Enum ShooterGame.EAttributeDrivenTimeDilationMode
enum class EAttributeDrivenTimeDilationMode : uint8 {
	AttributeValue = 0,
	InverseAttributeValue = 1,
	EAttributeDrivenTimeDilationMode_MAX = 2
};

// Enum ShooterGame.EAudioOcclusionOperation
enum class EAudioOcclusionOperation : uint8 {
	SetMinimum = 0,
	Additive = 1,
	Count = 2,
	EAudioOcclusionOperation_MAX = 3
};

// Enum ShooterGame.EAudioOcclusionType
enum class EAudioOcclusionType : uint8 {
	Fixed = 0,
	DistanceBased = 1,
	Count = 2,
	EAudioOcclusionType_MAX = 3
};

// Enum ShooterGame.EAresHudCrosshairPoints
enum class EAresHudCrosshairPoints : uint8 {
	CrosshairPoint_Left = 0,
	CrosshairPoint_Right = 1,
	CrosshairPoint_Top = 2,
	CrosshairPoint_Bottom = 3,
	CrosshairPoint_Center = 4,
	Count = 5,
	EAresHudCrosshairPoints_MAX = 6
};

// Enum ShooterGame.EVisualInterpolationState
enum class EVisualInterpolationState : uint8 {
	Steady = 0,
	OvershootTarget = 1,
	FallbackToTarget = 2,
	EVisualInterpolationState_MAX = 3
};

// Enum ShooterGame.ECrosshairEnvironment
enum class ECrosshairEnvironment : uint8 {
	Gameplay = 0,
	Preview = 1,
	ECrosshairEnvironment_MAX = 2
};

// Enum ShooterGame.ECrosshairShapeType
enum class ECrosshairShapeType : uint8 {
	LineShape = 0,
	CircleShape = 1,
	Count = 2,
	ECrosshairShapeType_MAX = 3
};

// Enum ShooterGame.EProjectileEventType
enum class EProjectileEventType : uint8 {
	Stop = 0,
	Destroy = 1,
	Hit = 2,
	Manual = 3,
	Count = 4,
	EProjectileEventType_MAX = 5
};

// Enum ShooterGame.EScoreboardModifierStatType
enum class EScoreboardModifierStatType : uint8 {
	Kills = 0,
	Deaths = 1,
	Assists = 2,
	Count = 3,
	Invalid = 4,
	EScoreboardModifierStatType_MAX = 5
};

// Enum ShooterGame.EAresTeam
enum class EAresTeam : uint8 {
	AresTeam_Red = 0,
	AresTeam_Blue = 1,
	AresTeam_Invalid = 254,
	EAresTeam_MAX = 255
};

// Enum ShooterGame.ECustomPathFollowStartBehavior
enum class ECustomPathFollowStartBehavior : uint8 {
	StartPathAtClosestPointOnPath = 0,
	StartPathAtBeginning = 1,
	Count = 2,
	ECustomPathFollowStartBehavior_MAX = 3
};

// Enum ShooterGame.ECustomPathFollowMoveType
enum class ECustomPathFollowMoveType : uint8 {
	Full3D = 0,
	Count = 1,
	ECustomPathFollowMoveType_MAX = 2
};

// Enum ShooterGame.ECapID
enum class ECapID : uint8 {
	AresPointID = 0,
	UpgradeTokenID = 1,
	RecruitmentTokenID = 2,
	JuiceEnergyCurrencyID = 3,
	JuiceMaxEnergyCurrencyID = 4,
	DoughID = 5,
	EquippableContentTypeID = 6,
	EquippableSkinContentTypeID = 7,
	EquippableSkinLevelContentTypeID = 8,
	EquippableSkinChromaContentTypeID = 9,
	EquippableCharmContentTypeID = 10,
	EquippableCharmLevelContentTypeID = 11,
	EquippableAttachmentContentTypeID = 12,
	CharacterContentTypeID = 13,
	SprayContentTypeID = 14,
	SprayLevelContentTypeID = 15,
	PlayerCardContentTypeID = 16,
	MissionContentTypeID = 17,
	PlayerTitleContentTypeID = 18,
	ContractContentTypeID = 19,
	PremiumContractContentTypeID = 20,
	TotemContentTypeID = 21,
	PermanentEntitlementTypeID = 22,
	LoyaltyEntitlementTypeID = 23,
	XGPEntitlementTypeID = 24,
	CurrencyRewardTypeID = 25,
	ContractXPCurrencyID = 26,
	F2PEntitlementTypeID = 27,
	Count = 28,
	ECapID_MAX = 29
};

// Enum ShooterGame.EPatchSpreadStyle
enum class EPatchSpreadStyle : uint8 {
	Air = 0,
	Ground = 1,
	Count = 2,
	EPatchSpreadStyle_MAX = 3
};

// Enum ShooterGame.EPatchType
enum class EPatchType : uint8 {
	Cells = 0,
	Nodes = 1,
	Volumes = 2,
	ForceVolumes = 3,
	Count = 4,
	EPatchType_MAX = 5
};

// Enum ShooterGame.ENodeStatus
enum class ENodeStatus : uint8 {
	Unsearched = 0,
	Pending = 1,
	Blocked = 2,
	Inside = 3,
	Outside = 4,
	Count = 5,
	ENodeStatus_MAX = 6
};

// Enum ShooterGame.ECellStatus
enum class ECellStatus : uint8 {
	AllInside = 0,
	PartiallyOutside = 1,
	PartiallyBlocked = 2,
	Count = 3,
	ECellStatus_MAX = 4
};

// Enum ShooterGame.EEdgeStatus
enum class EEdgeStatus : uint8 {
	OutsidePatch = 0,
	InsidePatch = 1,
	EdgeOfPatch = 2,
	Count = 3,
	EEdgeStatus_MAX = 4
};

// Enum ShooterGame.EPatchPhase
enum class EPatchPhase : uint8 {
	NotBegun = 0,
	Searching = 1,
	PostProcessing = 2,
	MarkingEdges = 3,
	MakingCellVolumes = 4,
	PatchSuccessful = 5,
	PatchFailed = 6,
	Count = 7,
	EPatchPhase_MAX = 8
};

// Enum ShooterGame.EChatMessageFormatType
enum class EChatMessageFormatType : uint8 {
	Author = 0,
	NoAuthor = 1,
	NoChannel = 2,
	NoAuthorNoChannel = 3,
	Count = 4,
	EChatMessageFormatType_MAX = 5
};

// Enum ShooterGame.EClientPerformanceContext
enum class EClientPerformanceContext : uint8 {
	LiveGameplay = 0,
	ReplayPlayback = 1,
	EClientPerformanceContext_MAX = 2
};

// Enum ShooterGame.ECloudSectionPhase
enum class ECloudSectionPhase : uint8 {
	Uninitalized = 0,
	Generating = 1,
	Smoothing = 2,
	Normalizing = 3,
	Finalizing = 4,
	Finished = 5,
	Count = 6,
	ECloudSectionPhase_MAX = 7
};

// Enum ShooterGame.ECNPolicyType
enum class ECNPolicyType : uint8 {
	None = 0,
	Shutdown = 1,
	PlayTime = 2,
	WarningMessage = 3,
	MatchmakingDisable = 4,
	HopeWarning = 5,
	HopeTips = 6,
	HopeShutdown = 7,
	HopeHeartbeat = 8,
	Invalid = 9,
	ECNPolicyType_MAX = 10
};

// Enum ShooterGame.ECoachDebugErrorType
enum class ECoachDebugErrorType : uint8 {
	ViewingEnemy = 0,
	InvalidNullViewTarget = 1,
	IllegalViewTargetMode = 2,
	Count = 3,
	ECoachDebugErrorType_MAX = 4
};

// Enum ShooterGame.ERoundReportEventType
enum class ERoundReportEventType : uint8 {
	DealtDamage = 0,
	ReceivedDamage = 1,
	Respawned = 2,
	ScoredAssist = 3,
	ScoredKill = 4,
	ScoredDeath = 5,
	Count = 6,
	ERoundReportEventType_MAX = 7
};

// Enum ShooterGame.EAresCommsMethod
enum class EAresCommsMethod : uint8 {
	Unknown = 0,
	Voice = 1,
	Ping = 2,
	Text = 3,
	EAresCommsMethod_MAX = 4
};

// Enum ShooterGame.EAresMuteMethod
enum class EAresMuteMethod : uint8 {
	Unknown = 0,
	Toggle = 1,
	Volume = 2,
	ReportModal = 3,
	EAresMuteMethod_MAX = 4
};

// Enum ShooterGame.ECompetitiveTier
enum class ECompetitiveTier : uint8 {
	Iron1 = 3,
	Iron2 = 4,
	Iron3 = 5,
	Bronze1 = 6,
	Bronze2 = 7,
	Bronze3 = 8,
	Silver1 = 9,
	Silver2 = 10,
	Silver3 = 11,
	Gold1 = 12,
	Gold2 = 13,
	Gold3 = 14,
	Platinum1 = 15,
	Platinum2 = 16,
	Platinum3 = 17,
	Diamond1 = 18,
	Diamond2 = 19,
	Diamond3 = 20,
	Immortal1 = 21,
	Immortal2 = 22,
	Immortal3 = 23,
	Radiant = 24,
	ECompetitiveTier_MAX = 25
};

// Enum ShooterGame.ECompetitiveDivision
enum class ECompetitiveDivision : uint8 {
	INVALID = 0,
	UNRANKED = 1,
	IRON = 2,
	BRONZE = 3,
	SILVER = 4,
	GOLD = 5,
	PLATINUM = 6,
	DIAMOND = 7,
	ASCENDANT = 8,
	IMMORTAL = 9,
	RADIANT = 10,
	Count = 11,
	ECompetitiveDivision_MAX = 12
};

// Enum ShooterGame.ECompetitiveTierIconSize
enum class ECompetitiveTierIconSize : uint8 {
	Small = 0,
	Large = 1,
	ECompetitiveTierIconSize_MAX = 2
};

// Enum ShooterGame.ECheatCategory
enum class ECheatCategory : uint8 {
	GeneralCommands = 0,
	GameplayTech = 1,
	PremiumContent = 2,
	ECheatCategory_MAX = 3
};

// Enum ShooterGame.ECheatSubCategory
enum class ECheatSubCategory : uint8 {
	TestingTools = 0,
	PingPacketLossAndJitter = 1,
	InfiniteStuff = 2,
	BombGameModeCheats = 3,
	AutomaticMovingAndShooting = 4,
	SpawningPlayersAndMannequins = 5,
	DisablingStuff = 6,
	MovementSystem = 7,
	VisualizationsAndDebugging = 8,
	HitRegistration = 9,
	HUDAndUI = 10,
	InputsAndEquippables = 11,
	FogOfWar = 12,
	Misc = 13,
	SkinsSpraysAndMore = 14,
	ECheatSubCategory_MAX = 15
};

// Enum ShooterGame.ECheatEntryType
enum class ECheatEntryType : uint8 {
	Simple = 0,
	Toggle = 1,
	Complex = 2,
	ECheatEntryType_MAX = 3
};

// Enum ShooterGame.EActionType
enum class EActionType : uint8 {
	OpenModal = 0,
	CloseModal = 1,
	ApplyFilters = 2,
	Count = 3,
	EActionType_MAX = 4
};

// Enum ShooterGame.EAresContentType
enum class EAresContentType : uint8 {
	EquippableSkin = 0,
	EquippableSkinLevel = 1,
	EquippableSkinChroma = 2,
	EquippableCharm = 3,
	Character = 4,
	CharacterRole = 5,
	Contract = 6,
	EquippableAttachment = 7,
	Equippable = 8,
	Map = 9,
	Socket = 10,
	Spray = 11,
	GameMode = 12,
	Currency = 13,
	EquippableCharmLevel = 14,
	SprayLevel = 15,
	PlayerCard = 16,
	PremiumContract = 17,
	Mission = 18,
	StorefrontItem = 19,
	PlayerTitle = 20,
	Season = 21,
	ActRankBorder = 22,
	ContractChapter = 23,
	ContentTier = 24,
	ContentEdition = 25,
	CompetitiveSeason = 26,
	PremierSeason = 27,
	MatchmakingQueue = 28,
	LevelBorder = 29,
	Event = 30,
	JuiceBox = 31,
	Ceremony = 32,
	TournamentsTeamIcon = 33,
	MassRewardsCeremony = 34,
	Archive = 35,
	Subscription = 36,
	Accolade = 37,
	PremierConference = 38,
	Totem = 39,
	Tip = 40,
	PowderedToast = 41,
	BTE = 42,
	EsportsTeam = 43,
	Invalid = 44,
	Count = 45,
	EAresContentType_MAX = 46
};

// Enum ShooterGame.EEducationArea
enum class EEducationArea : uint8 {
	Economy = 0,
	Abilities = 1,
	AttackDefend = 2,
	Weapon = 3,
	Settings = 4,
	Movement = 5,
	Fights = 6,
	Crosshair = 7,
	Lore = 8,
	ShootingRange = 9,
	Count = 10,
	EEducationArea_MAX = 11
};

// Enum ShooterGame.ETipPossibleDisplayTimes
enum class ETipPossibleDisplayTimes : uint8 {
	BuyPhase = 0,
	TheRange = 1,
	DeathCam = 2,
	BuyPhaseFollowUp = 3,
	ShopClosedFollowUp = 4,
	ETipPossibleDisplayTimes_MAX = 5
};

// Enum ShooterGame.EContractType
enum class EContractType : uint8 {
	Special = 0,
	Story = 1,
	Event = 2,
	Accord = 3,
	Invalid = 4,
	Count = 5,
	EContractType_MAX = 6
};

// Enum ShooterGame.EXPModifier
enum class EXPModifier : uint8 {
	AntiAddiction_Reduced = 0,
	AntiAddiction_Zero = 1,
	Loyalty_Boost = 2,
	XP_Boost = 3,
	Restrictions_XPModifier = 4,
	Social_XP = 5,
	PREMIUM_CONTRACT_XP = 6,
	XGP_SUBSCRIPTION_XP = 7,
	Invalid = 8,
	Count = 9,
	EXPModifier_MAX = 10
};

// Enum ShooterGame.EContractUpgradeState
enum class EContractUpgradeState : uint8 {
	CUS_NOT_UPGRADABLE = 0,
	CUS_UPGRADE_AVAILABLE = 1,
	CUS_UPGRADE_NOT_AFFORDABLE = 2,
	CUS_UPGRADE_OWNED = 3,
	CUS_MAX = 4
};

// Enum ShooterGame.ECoreGameMatchState
enum class ECoreGameMatchState : uint8 {
	PREPROVISION = 0,
	PROVISIONING = 1,
	IN_PROGRESS = 2,
	POST_GAME = 3,
	CLOSED = 4,
	PENDING = 5,
	INVALID = 6,
	COUNT = 6,
	ECoreGameMatchState_MAX = 7
};

// Enum ShooterGame.EInstructionSet
enum class EInstructionSet : uint8 {
	UNKNOWN = 0,
	SSE = 1,
	SSE2 = 2,
	SSE3 = 3,
	SSE41 = 4,
	SSE42 = 5,
	AVX = 6,
	AVX2 = 7,
	EInstructionSet_MAX = 8
};

// Enum ShooterGame.ECrosshairLocation
enum class ECrosshairLocation : uint8 {
	Inner = 0,
	Outer = 1,
	Count = 2,
	ECrosshairLocation_MAX = 3
};

// Enum ShooterGame.EAresCrosshairType
enum class EAresCrosshairType : uint8 {
	None = 0,
	Primary = 1,
	ADS = 2,
	Sniper = 3,
	Focus = 4,
	COUNT = 5,
	EAresCrosshairType_MAX = 6
};

// Enum ShooterGame.ECrosshairPreviewSettingsType
enum class ECrosshairPreviewSettingsType : uint8 {
	Primary = 0,
	ADS = 1,
	FocusMode = 2,
	ECrosshairPreviewSettingsType_MAX = 3
};

// Enum ShooterGame.EAresCustomGameSelectionType
enum class EAresCustomGameSelectionType : uint8 {
	Map = 0,
	Mode = 1,
	Options = 2,
	EAresCustomGameSelectionType_MAX = 3
};

// Enum ShooterGame.EOverhealPhase
enum class EOverhealPhase : uint8 {
	Healing = 0,
	Sustaining = 1,
	Decaying = 2,
	EOverhealPhase_MAX = 3
};

// Enum ShooterGame.ECauserType
enum class ECauserType : uint8 {
	Projectile = 0,
	Equippable = 1,
	Pawn = 2,
	Count = 3,
	ECauserType_MAX = 4
};

// Enum ShooterGame.DamageSectionType
enum class DamageSectionType : uint8 {
	Health = 0,
	Shield = 1,
	Temporary = 2,
	Count = 3,
	DamageSectionType_MAX = 4
};

// Enum ShooterGame.EDebugCharacterMovementTimingFlags
enum class EDebugCharacterMovementTimingFlags : uint8 {
	None = 0,
	Self = 1,
	RemoteClient = 2,
	Count = 3,
	EDebugCharacterMovementTimingFlags_MAX = 4
};

// Enum ShooterGame.EDebugCharacterMovementCurves
enum class EDebugCharacterMovementCurves : uint8 {
	None = 0,
	TotalSpeed = 1,
	AxialSpeed = 2,
	Acceleration = 3,
	JumpHeight = 4,
	RotationDegreesPerSecond = 5,
	Count = 6,
	EDebugCharacterMovementCurves_MAX = 7
};

// Enum ShooterGame.EDebugNetSource
enum class EDebugNetSource : uint8 {
	LocalClient = 0,
	Server = 1,
	Count = 2,
	EDebugNetSource_MAX = 3
};

// Enum ShooterGame.EFiringTimeEntryType
enum class EFiringTimeEntryType : uint8 {
	Normal = 0,
	Refire = 1,
	Burst = 2,
	Future = 3,
	Count = 4,
	EFiringTimeEntryType_MAX = 5
};

// Enum ShooterGame.EDebugWeaponCurves
enum class EDebugWeaponCurves : uint8 {
	None = 0,
	WeaponError = 1,
	WeaponPitchAndYaw = 2,
	Count = 3,
	EDebugWeaponCurves_MAX = 4
};

// Enum ShooterGame.ECreateDecalOptions
enum class ECreateDecalOptions : uint8 {
	DecalOrProxy = 0,
	NeverProxy = 1,
	AlwaysDecal = 2,
	ECreateDecalOptions_MAX = 3
};

// Enum ShooterGame.EDestructionResponse
enum class EDestructionResponse : uint8 {
	DoNothing = 0,
	ActorDestroy = 1,
	TakeDamage = 2,
	DamageOrDestroy = 3,
	Custom = 4,
	Count = 5,
	EDestructionResponse_MAX = 6
};

// Enum ShooterGame.EAudioEventPlaybackType
enum class EAudioEventPlaybackType : uint8 {
	Oneshot = 0,
	Looping = 1,
	EAudioEventPlaybackType_MAX = 2
};

// Enum ShooterGame.EAudioEmitterAttachType
enum class EAudioEmitterAttachType : uint8 {
	AttachToFXC = 0,
	Unattached = 1,
	EAudioEmitterAttachType_MAX = 2
};

// Enum ShooterGame.EPostAssociatedEventsType
enum class EPostAssociatedEventsType : uint8 {
	AudioEvents = 0,
	StopAudioEvents = 1,
	EPostAssociatedEventsType_MAX = 2
};

// Enum ShooterGame.ESpawnEffectType
enum class ESpawnEffectType : uint8 {
	Spawned = 0,
	Pooled = 1,
	Pure = 2,
	ESpawnEffectType_MAX = 3
};

// Enum ShooterGame.ECosmeticEffectType
enum class ECosmeticEffectType : uint8 {
	Undefined = 0,
	Cosmetic = 1,
	Gameplay = 2,
	ECosmeticEffectType_MAX = 3
};

// Enum ShooterGame.EMovementSyncType
enum class EMovementSyncType : uint8 {
	Always = 0,
	Never = 1,
	SpectatorOnly = 2,
	Count = 3,
	EMovementSyncType_MAX = 4
};

// Enum ShooterGame.EEffectPerspective
enum class EEffectPerspective : uint8 {
	FirstPerson = 0,
	ThirdPerson = 1,
	EEffectPerspective_MAX = 2
};

// Enum ShooterGame.EEffectAlliance
enum class EEffectAlliance : uint8 {
	Ally = 0,
	Enemy = 1,
	EEffectAlliance_MAX = 2
};

// Enum ShooterGame.EParticleStopBehavior
enum class EParticleStopBehavior : uint8 {
	KeepPlaying = 0,
	Deactivate = 1,
	Destroy = 2,
	EParticleStopBehavior_MAX = 3
};

// Enum ShooterGame.EParticlesBehavior
enum class EParticlesBehavior : uint8 {
	Active = 0,
	Inactive = 1,
	Hidden = 2,
	Destroy = 3,
	EParticlesBehavior_MAX = 4
};

// Enum ShooterGame.EEffectAttachType
enum class EEffectAttachType : uint8 {
	NotAttached = 0,
	RootComponent = 1,
	Attach1P = 2,
	Attach3P = 3,
	Count = 4,
	EEffectAttachType_MAX = 5
};

// Enum ShooterGame.EEquippableCategory
enum class EEquippableCategory : uint8 {
	Invalid = 0,
	Heavy = 1,
	Rifle = 2,
	Shotgun = 3,
	Sidearm = 4,
	SMG = 5,
	Sniper = 6,
	Melee = 7,
	Hidden = 8,
	Count = 9,
	EEquippableCategory_MAX = 10
};

// Enum ShooterGame.EWeaponFireModeDisplayType
enum class EWeaponFireModeDisplayType : uint8 {
	FullyAutomatic = 0,
	Burst = 1,
	SemiAutomatic = 2,
	Count = 3,
	EWeaponFireModeDisplayType_MAX = 4
};

// Enum ShooterGame.EWallPenetrationDisplayType
enum class EWallPenetrationDisplayType : uint8 {
	None = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	Count = 4,
	EWallPenetrationDisplayType_MAX = 5
};

// Enum ShooterGame.EWeaponStatsFeature
enum class EWeaponStatsFeature : uint8 {
	None = 0,
	Silenced = 1,
	ROFIncrease = 2,
	DualZoom = 3,
	EWeaponStatsFeature_MAX = 4
};

// Enum ShooterGame.EWeaponAltFireDisplayType
enum class EWeaponAltFireDisplayType : uint8 {
	None = 0,
	ADS = 1,
	AirBurst = 2,
	Shotgun = 3,
	EWeaponAltFireDisplayType_MAX = 4
};

// Enum ShooterGame.EEquippableEventHistoryEntryMode
enum class EEquippableEventHistoryEntryMode : uint8 {
	ClientOnly = 0,
	ServerOnly = 1,
	ClientAndServer = 2,
	EEquippableEventHistoryEntryMode_MAX = 3
};

// Enum ShooterGame.EEquippableEventEmitMode
enum class EEquippableEventEmitMode : uint8 {
	ServerAndClient = 0,
	ServerOnly = 1,
	ClientOnly = 2,
	EEquippableEventEmitMode_MAX = 3
};

// Enum ShooterGame.EModificationType
enum class EModificationType : uint8 {
	None = 0,
	Permanent = 1,
	Temporary = 2,
	EModificationType_MAX = 3
};

// Enum ShooterGame.EEquippableRestrictions
enum class EEquippableRestrictions : uint8 {
	Apply = 0,
	SkipForDesired = 1,
	SkipForDesiredAndCurrent = 2,
	Count = 3,
	EEquippableRestrictions_MAX = 4
};

// Enum ShooterGame.EModelCategory
enum class EModelCategory : uint8 {
	Base = 0,
	Light = 1,
	Medium = 2,
	Heavy = 3,
	Count = 4,
	EModelCategory_MAX = 5
};

// Enum ShooterGame.EFXCategory
enum class EFXCategory : uint8 {
	Base = 0,
	Light = 1,
	Medium = 2,
	Heavy = 3,
	Count = 4,
	EFXCategory_MAX = 5
};

// Enum ShooterGame.EAnimationCategory
enum class EAnimationCategory : uint8 {
	None = 0,
	Gun = 1,
	LightHand = 2,
	HeavyHand = 3,
	Count = 4,
	EAnimationCategory_MAX = 5
};

// Enum ShooterGame.EFinisherCategory
enum class EFinisherCategory : uint8 {
	Base = 0,
	Light = 1,
	Medium = 2,
	Heavy = 3,
	Count = 4,
	EFinisherCategory_MAX = 5
};

// Enum ShooterGame.EMeleeCategory
enum class EMeleeCategory : uint8 {
	New = 0,
	ActionsetMod = 1,
	Repeat = 2,
	NonMelee = 3,
	Count = 4,
	EMeleeCategory_MAX = 5
};

// Enum ShooterGame.EMeleeArchetypeCategory
enum class EMeleeArchetypeCategory : uint8 {
	NonMelee = 0,
	Tactical = 1,
	Assassin = 2,
	Assassin2 = 3,
	Aggressive = 4,
	Wand = 5,
	Fury = 6,
	Karambit = 7,
	Karambit2 = 8,
	Uncommon = 9,
	CQC = 10,
	TwoHanded = 11,
	Fan = 12,
	Butterfly = 13,
	Staff = 14,
	Heavy = 15,
	Katana = 16,
	Katana2 = 17,
	DualWield = 18,
	ChainKunai = 19,
	DualFist = 20,
	Count = 21,
	EMeleeArchetypeCategory_MAX = 22
};

// Enum ShooterGame.EEquippableSkinLevelItem
enum class EEquippableSkinLevelItem : uint8 {
	None = 0,
	VFX = 1,
	Animation = 2,
	Finisher = 3,
	KillBanner = 4,
	Buddy = 5,
	Randomizer = 6,
	KillCounter = 7,
	TopFrag = 8,
	InspectAndKill = 9,
	Voiceover = 10,
	KillEffect = 11,
	FishAnimation = 12,
	HeartbeatAndMapSensor = 13,
	SoundEffects = 14,
	KillEffects = 15,
	AttackerDefenderSwap = 16,
	Transformation = 17,
	SongShuffle = 18,
	EEquippableSkinLevelItem_MAX = 19
};

// Enum ShooterGame.EHandleInputResponse
enum class EHandleInputResponse : uint8 {
	Consume = 0,
	Unhandled = 1,
	Count = 2,
	EHandleInputResponse_MAX = 3
};

// Enum ShooterGame.ESourceInputConsumptionOnEnterEquippableState
enum class ESourceInputConsumptionOnEnterEquippableState : uint8 {
	ConsumeSourceInput = 0,
	AllowSourceInputToBeQueued = 1,
	Count = 2,
	ESourceInputConsumptionOnEnterEquippableState_MAX = 3
};

// Enum ShooterGame.EReplacementStateType
enum class EReplacementStateType : uint8 {
	None = 0,
	DisabledFallback = 1,
	Count = 2,
	EReplacementStateType_MAX = 3
};

// Enum ShooterGame.EStateBehaviorOnUnequip
enum class EStateBehaviorOnUnequip : uint8 {
	DoNothing = 0,
	GoToStartState = 1,
	PreventUnequip = 2,
	PreventEquip = 3,
	Count = 4,
	EStateBehaviorOnUnequip_MAX = 5
};

// Enum ShooterGame.EStateBehaviorOnUnpossess
enum class EStateBehaviorOnUnpossess : uint8 {
	DoNothing = 0,
	GoToState = 1,
	Count = 2,
	EStateBehaviorOnUnpossess_MAX = 3
};

// Enum ShooterGame.EStateBehaviorOnDeath
enum class EStateBehaviorOnDeath : uint8 {
	DoNothing = 0,
	GoToState = 1,
	ClearState = 2,
	Count = 3,
	EStateBehaviorOnDeath_MAX = 4
};

// Enum ShooterGame.EEquipSource
enum class EEquipSource : uint8 {
	ActivationInput = 0,
	UnequipEquippable = 1,
	GrantEquippable = 2,
	ServerCorrection = 3,
	RemoveItem = 4,
	UpdateInvalidDesiredEquippable = 5,
	PossessedBy = 6,
	ServerUpdateForServerOwnedActor = 7,
	ServerUpdateForRemotePlayerOwnedActor = 8,
	Script = 9,
	Automation = 10,
	ServerCheat = 11,
	Invalid = 12,
	Count = 13,
	EEquipSource_MAX = 14
};

// Enum ShooterGame.EEquipSpeed
enum class EEquipSpeed : uint8 {
	Normal = 0,
	Fast = 1,
	Instant = 2,
	Count = 3,
	EEquipSpeed_MAX = 4
};

// Enum ShooterGame.EEsportsSectionType
enum class EEsportsSectionType : uint8 {
	Group = 0,
	Bracket = 1,
	CrossGroup = 2,
	Count = 3,
	Invalid = 4,
	EEsportsSectionType_MAX = 5
};

// Enum ShooterGame.EEsportsMatchDestinationType
enum class EEsportsMatchDestinationType : uint8 {
	Standing = 0,
	Match = 1,
	DecisionPoint = 2,
	Count = 3,
	Invalid = 4,
	EEsportsMatchDestinationType_MAX = 5
};

// Enum ShooterGame.EEsportsSectionPickCorrectness
enum class EEsportsSectionPickCorrectness : uint8 {
	Imperfect = 0,
	Perfect = 1,
	Invalid = 2,
	EEsportsSectionPickCorrectness_MAX = 3
};

// Enum ShooterGame.EEsportsEntryPickCorrectness
enum class EEsportsEntryPickCorrectness : uint8 {
	Unknown = 0,
	Incorrect = 1,
	Correct = 2,
	Invalid = 3,
	EEsportsEntryPickCorrectness_MAX = 4
};

// Enum ShooterGame.EStandingsType
enum class EStandingsType : uint8 {
	Group = 0,
	Alpha = 1,
	Omega = 2,
	EStandingsType_MAX = 3
};

// Enum ShooterGame.ETournamentStage
enum class ETournamentStage : uint8 {
	Groups = 0,
	PlayIns = 1,
	Playoffs = 2,
	RegularSeason = 3,
	Swiss = 4,
	Count = 5,
	ETournamentStage_MAX = 6
};

// Enum ShooterGame.EEsportsHubTab
enum class EEsportsHubTab : uint8 {
	Spotlight = 0,
	Schedule = 1,
	GlobalEvents = 2,
	Leagues = 3,
	Teams = 4,
	Pickem = 5,
	VCTEvents = 6,
	Spotlightv2 = 7,
	Count = 8,
	EEsportsHubTab_MAX = 9
};

// Enum ShooterGame.EEsportsMatchRefreshFlags
enum class EEsportsMatchRefreshFlags : uint8 {
	NONE = 0,
	EEsportsMatchRefreshFlags_MAX = 1
};

// Enum ShooterGame.EEsportsMatchStartTimeRefreshFlags
enum class EEsportsMatchStartTimeRefreshFlags : uint8 {
	NONE = 0,
	EEsportsMatchStartTimeRefreshFlags_MAX = 1
};

// Enum ShooterGame.EEsportsModelType
enum class EEsportsModelType : uint8 {
	League = 0,
	Tournament = 1,
	Stage = 2,
	Match = 3,
	Team = 4,
	TeamMember = 5,
	PlayerStats = 6,
	UpcomingMatches = 7,
	FactionPlayerStats = 8,
	FactionLeaderboard = 9,
	Season = 10,
	Split = 11,
	None = 12,
	EEsportsModelType_MAX = 13
};

// Enum ShooterGame.EPickemMatchResultState
enum class EPickemMatchResultState : uint8 {
	UNKOWN = 0,
	TIE = 1,
	KNOWN = 2,
	Count = 3,
	Invalid = 4,
	EPickemMatchResultState_MAX = 5
};

// Enum ShooterGame.EEsportsPlayerStatsRefreshFlags
enum class EEsportsPlayerStatsRefreshFlags : uint8 {
	NONE = 0,
	EEsportsPlayerStatsRefreshFlags_MAX = 1
};

// Enum ShooterGame.EVCTTournament
enum class EVCTTournament : uint8 {
	None = 0,
	Champions = 1,
	MastersOne = 2,
	MastersTwo = 3,
	Americas = 4,
	EMEA = 5,
	Pacific = 6,
	China = 7,
	EVCTTournament_MAX = 8
};

// Enum ShooterGame.EEsportsStageRefreshFlags
enum class EEsportsStageRefreshFlags : uint8 {
	NONE = 0,
	EEsportsStageRefreshFlags_MAX = 1
};

// Enum ShooterGame.EEsportsTeamRefreshFlags
enum class EEsportsTeamRefreshFlags : uint8 {
	NONE = 0,
	FETCHLEAGUE = 1,
	FETCHUPCOMINGMATCHES = 2,
	FETCHTEAMMEMBERS = 4,
	EEsportsTeamRefreshFlags_MAX = 5
};

// Enum ShooterGame.EEULAAcceptanceState
enum class EEULAAcceptanceState : uint8 {
	WAITING_FOR_ALL_SERVICE_DATA = 0,
	ACCEPTANCE_REQUIRED = 1,
	ACCEPTED = 2,
	INVALID = 3,
	COUNT = 3,
	EEULAAcceptanceState_MAX = 4
};

// Enum ShooterGame.EAresExpressionType
enum class EAresExpressionType : uint8 {
	Spray = 0,
	Totem = 1,
	EAresExpressionType_MAX = 2
};

// Enum ShooterGame.EFavoritesActionType
enum class EFavoritesActionType : uint8 {
	AddFavorite = 0,
	RemoveFavorite = 1,
	EFavoritesActionType_MAX = 2
};

// Enum ShooterGame.ECanFireCooldownCheckOption
enum class ECanFireCooldownCheckOption : uint8 {
	CheckCooldown = 0,
	SkipCooldownCheck = 1,
	ECanFireCooldownCheckOption_MAX = 2
};

// Enum ShooterGame.EShellCasingEjectableBehavior
enum class EShellCasingEjectableBehavior : uint8 {
	None = 0,
	EjectOnShoot = 1,
	EShellCasingEjectableBehavior_MAX = 2
};

// Enum ShooterGame.EFiringStateTransitionContext
enum class EFiringStateTransitionContext : uint8 {
	None = 0,
	Refire = 1,
	Burst = 2,
	Count = 3,
	EFiringStateTransitionContext_MAX = 4
};

// Enum ShooterGame.EAresFlyoutCategory
enum class EAresFlyoutCategory : uint8 {
	SocialWindow = 0,
	SocialHovercard = 1,
	ScoreboardHovercard = 2,
	EAresFlyoutCategory_MAX = 3
};

// Enum ShooterGame.EFoWRelevancyResult
enum class EFoWRelevancyResult : uint8 {
	Invalid = 0,
	NotRelevantDistance = 1,
	NotRelevant = 2,
	RelevantVision = 3,
	RelevantAudio = 4,
	RelevantOverride = 5,
	RelevantNoComponent = 6,
	RelevantTeam = 7,
	RelevantDistance = 8,
	Count = 9,
	EFoWRelevancyResult_MAX = 255
};

// Enum ShooterGame.EFoWDebuggableRelevancyResult
enum class EFoWDebuggableRelevancyResult : uint8 {
	Invalid = 0,
	NotRelevantDistance = 1,
	NotRelevant = 2,
	RelevantVision = 3,
	RelevantAudio = 4,
	RelevantOverrideAllActorsRelevant = 5,
	RelevantOverrideNotFinishedSpawning = 6,
	RelevantOverrideForcedRelevant = 7,
	RelevantOverrideHasOverride = 8,
	RelevantNoComponent = 9,
	RelevantTeam = 10,
	RelevantDistance = 11,
	Count = 12,
	EFoWDebuggableRelevancyResult_MAX = 255
};

// Enum ShooterGame.EGroundSoundType
enum class EGroundSoundType : uint8 {
	Step = 0,
	Land = 1,
	Jump = 2,
	EGroundSoundType_MAX = 3
};

// Enum ShooterGame.EForceModuleAttribute
enum class EForceModuleAttribute : uint8 {
	MaxSpeed = 0,
	Friction = 1,
	Braking = 2,
	Acceleration = 3,
	JumpVelocity = 4,
	Gravity = 5,
	JumpTime = 6,
	TurnRate = 7,
	CurrentSpeed = 8,
	AboveMaxSpeedBraking = 9,
	Count = 10,
	EForceModuleAttribute_MAX = 11
};

// Enum ShooterGame.EForceType
enum class EForceType : uint8 {
	Other = 0,
	Traversal = 1,
	Displacement = 2,
	Impairment = 3,
	Dash = 4,
	Depenetration = 5,
	Count = 6,
	EForceType_MAX = 7
};

// Enum ShooterGame.EShooterGameMode
enum class EShooterGameMode : uint8 {
	SpikeMode5v5 = 0,
	Unhandled = 1,
	Count = 2,
	EShooterGameMode_MAX = 3
};

// Enum ShooterGame.EModifierUseConditionsBitMask
enum class EModifierUseConditionsBitMask : uint8 {
	Always = 0,
	Cheats = 1,
	Tournament = 2,
	EModifierUseConditionsBitMask_MAX = 3
};

// Enum ShooterGame.EModifierRoleConditionsBitMask
enum class EModifierRoleConditionsBitMask : uint8 {
	Observer = 0,
	Moderator = 1,
	Player = 2,
	EModifierRoleConditionsBitMask_MAX = 3
};

// Enum ShooterGame.EModifierCategory
enum class EModifierCategory : uint8 {
	None = 0,
	Player = 1,
	Game = 2,
	MatchFlow = 3,
	EModifierCategory_MAX = 4
};

// Enum ShooterGame.EAnalogPlayerState
enum class EAnalogPlayerState : uint8 {
	Default = 0,
	FocusMode = 1,
	ADS = 2,
	Scoped = 3,
	Count = 4,
	EAnalogPlayerState_MAX = 5
};

// Enum ShooterGame.EGameplayFlag
enum class EGameplayFlag : uint8 {
	None = 0,
	InGameUI = 1,
	PlayerIsDead = 2,
	InPreRoundPhase = 4,
	InOptionsScreen = 8,
	GameOutOfFocus = 16,
	All = 255,
	EGameplayFlag_MAX = 256
};

// Enum ShooterGame.EGameUIFlag
enum class EGameUIFlag : uint8 {
	None = 0,
	Scoreboard = 1,
	Map = 2,
	Shop = 4,
	AgentTooltip = 8,
	CombatReport = 16,
	RadialMenu = 32,
	CommMenu = 64,
	EGameUIFlag_MAX = 65
};

// Enum ShooterGame.EGameplayNotificationWidgetSlot
enum class EGameplayNotificationWidgetSlot : uint8 {
	Banner = 0,
	Ring = 1,
	Icon = 2,
	Background = 3,
	Count = 4,
	EGameplayNotificationWidgetSlot_MAX = 5
};

// Enum ShooterGame.EGameplayNotificationDurationType
enum class EGameplayNotificationDurationType : uint8 {
	Timed = 0,
	EventBased = 1,
	EGameplayNotificationDurationType_MAX = 2
};

// Enum ShooterGame.EGameplayNotificationStatus
enum class EGameplayNotificationStatus : uint8 {
	Inactive = 0,
	Queued = 1,
	Active = 2,
	EGameplayNotificationStatus_MAX = 3
};

// Enum ShooterGame.EVoteReplicationState
enum class EVoteReplicationState : uint8 {
	Waiting = 0,
	Complete = 1,
	EVoteReplicationState_MAX = 2
};

// Enum ShooterGame.EVotesNeededType
enum class EVotesNeededType : uint8 {
	UnanimousWithTolerance = 0,
	Majority = 1,
	Custom = 2,
	EVotesNeededType_MAX = 3
};

// Enum ShooterGame.EGapDetectionBoundsConstraint
enum class EGapDetectionBoundsConstraint : uint8 {
	Disabled = 0,
	Lenient = 1,
	Strict = 2,
	EGapDetectionBoundsConstraint_MAX = 3
};

// Enum ShooterGame.EGapDetectionType
enum class EGapDetectionType : uint8 {
	CheckPlanesOnly = 0,
	CheckLinesOnly = 1,
	CheckPlanesAndLines = 2,
	EGapDetectionType_MAX = 3
};

// Enum ShooterGame.EAresNotificationType
enum class EAresNotificationType : uint8 {
	Generic = 0,
	Warning = 1,
	RestrictionsWarning = 2,
	RatingRefund = 3,
	EAresNotificationType_MAX = 4
};

// Enum ShooterGame.EGiftRecipientEligibility
enum class EGiftRecipientEligibility : uint8 {
	UNKNOWN = 0,
	INELIGIBLE = 1,
	ELIGIBLE = 2,
	COUNT = 3,
	EGiftRecipientEligibility_MAX = 4
};

// Enum ShooterGame.EGridAxis2D
enum class EGridAxis2D : uint8 {
	Horizontal = 0,
	Vertical = 1,
	EGridAxis2D_MAX = 2
};

// Enum ShooterGame.EHomingProjectileFacing
enum class EHomingProjectileFacing : uint8 {
	FiringDirection = 0,
	MovementDirection = 1,
	HomingTarget = 2,
	EHomingProjectileFacing_MAX = 3
};

// Enum ShooterGame.EAresListType
enum class EAresListType : uint8 {
	None = 0,
	List = 1,
	Tile = 2,
	Tree = 3,
	COUNT = 4,
	EAresListType_MAX = 5
};

// Enum ShooterGame.EAresListFocusReturnType
enum class EAresListFocusReturnType : uint8 {
	None = 0,
	Selection = 1,
	DirectionalNavigation = 2,
	ZeroIndex = 3,
	PageZeroIndex = 4,
	Count = 5,
	EAresListFocusReturnType_MAX = 6
};

// Enum ShooterGame.EAresListScrollMode
enum class EAresListScrollMode : uint8 {
	Default = 0,
	Restricted = 1,
	Infinite = 2,
	COUNT = 3,
	EAresListScrollMode_MAX = 4
};

// Enum ShooterGame.EButtonTextWidgetComponentType
enum class EButtonTextWidgetComponentType : uint8 {
	Standard = 0,
	Primary = 1,
	Secondary = 2,
	EButtonTextWidgetComponentType_MAX = 3
};

// Enum ShooterGame.EBound
enum class EBound : uint8 {
	UpperBound = 0,
	LowerBound = 1,
	ThesholdType_Count = 2,
	EBound_MAX = 3
};

// Enum ShooterGame.EUseFinishType
enum class EUseFinishType : uint8 {
	InUse = 0,
	Complete = 1,
	Cancel = 2,
	EUseFinishType_MAX = 3
};

// Enum ShooterGame.EAresPreloadableAssetType
enum class EAresPreloadableAssetType : uint8 {
	Invalid = 0,
	FirstPerson = 1,
	ThirdPerson = 2,
	Finisher = 4,
	FirstAndFinisher = 5,
	All = 7,
	EAresPreloadableAssetType_MAX = 8
};

// Enum ShooterGame.ERiotLoginStatusState
enum class ERiotLoginStatusState : uint8 {
	Uninitialized = 0,
	Initialized = 1,
	Authenticating = 2,
	Cancelled = 3,
	Success = 4,
	Error = 5,
	Unknown = 6,
	ERiotLoginStatusState_MAX = 7
};

// Enum ShooterGame.ERiotLoginStrategy
enum class ERiotLoginStrategy : uint8 {
	Riot = 0,
	Google = 1,
	Facebook = 2,
	Apple = 3,
	Tencent = 4,
	None = 5,
	ERiotLoginStrategy_MAX = 6
};

// Enum ShooterGame.EJamSlot
enum class EJamSlot : uint8 {
	NONE = 0,
	Primary = 1,
	Secondary = 2,
	EJamSlot_MAX = 3
};

// Enum ShooterGame.EJuiceFilterViewType
enum class EJuiceFilterViewType : uint8 {
	DEFAULT = 0,
	HAS_JUICE_CONTENT = 1,
	OWNED_ONLY = 2,
	ENERGY = 3,
	COUNT = 4,
	EJuiceFilterViewType_MAX = 5
};

// Enum ShooterGame.EJuiceContentViewModelType
enum class EJuiceContentViewModelType : uint8 {
	NONE = 0,
	CONTENT = 1,
	ENERGY = 2,
	FILL = 3,
	COUNT = 4,
	EJuiceContentViewModelType_MAX = 5
};

// Enum ShooterGame.EJuiceContentViewModelLocation
enum class EJuiceContentViewModelLocation : uint8 {
	NONE = 0,
	COLLECTION = 1,
	TRAY = 2,
	CONFIRM = 3,
	COUNT = 4,
	EJuiceContentViewModelLocation_MAX = 5
};

// Enum ShooterGame.EJuiceRewardType
enum class EJuiceRewardType : uint8 {
	NONE = 0,
	SKIN = 1,
	LEVEL = 2,
	VARIANT = 3,
	COUNT = 4,
	EJuiceRewardType_MAX = 5
};

// Enum ShooterGame.EAresMultiKillLevel
enum class EAresMultiKillLevel : uint8 {
	None = 0,
	DoubleKill = 1,
	TripleKill = 2,
	QuadraKill = 3,
	PentaKill = 4,
	OverKill = 5,
	Count = 6,
	Invalid = 254,
	EAresMultiKillLevel_MAX = 255
};

// Enum ShooterGame.EChildScreenRefreshKickOption
enum class EChildScreenRefreshKickOption : uint8 {
	None = 0,
	NoKick = 1,
	ForceKick = 2,
	OnlyForceKickAtTopLevel = 3,
	EChildScreenRefreshKickOption_MAX = 4
};

// Enum ShooterGame.EAresLevelBorderAppearance
enum class EAresLevelBorderAppearance : uint8 {
	LevelNumber = 0,
	SmallPlayerCard = 1,
	EAresLevelBorderAppearance_MAX = 2
};

// Enum ShooterGame.ELevelLoadingState
enum class ELevelLoadingState : uint8 {
	UNLOADED = 0,
	LOADED = 1,
	LOADING = 2,
	UNLOADING = 3,
	ELevelLoadingState_MAX = 4
};

// Enum ShooterGame.EChordedBindingContext
enum class EChordedBindingContext : uint8 {
	NoContext = 0,
	UltInput = 1,
	Count = 2,
	EChordedBindingContext_MAX = 3
};

// Enum ShooterGame.ESortOrder
enum class ESortOrder : uint8 {
	A = 0,
	B = 1,
	Same = 2,
	ESortOrder_MAX = 3
};

// Enum ShooterGame.EFilterInclude
enum class EFilterInclude : uint8 {
	Exclude = 0,
	Include = 1,
	AlwaysInclude = 2,
	EFilterInclude_MAX = 3
};

// Enum ShooterGame.ELoginQueueTokenType
enum class ELoginQueueTokenType : uint8 {
	Login = 0,
	Queue = 1,
	Invalid = 2,
	ELoginQueueTokenType_MAX = 3
};

// Enum ShooterGame.EStartGameAvailability
enum class EStartGameAvailability : uint8 {
	Unavailable_PatchRequired = 0,
	Unavailable_QueueDisabled = 1,
	Unavailable_NotEligible = 2,
	Unavailable_OversizedParty = 3,
	Unavailable_InvalidPartySize = 4,
	Unavailable_SkillDisparity = 5,
	Unavailable_LocalPlayerUnverified = 6,
	Unavailable_PartyMembersUnverified = 7,
	Unavailable_InactiveGame = 8,
	Unavailable_PartyNotReady_Service = 9,
	Unavailable_PartyNotReady_Chat = 10,
	Unavailable_NoPlayers = 11,
	Unavailable_QueueRestricted = 12,
	Unavailable_QueueDelay = 13,
	Available_NotPartyOwner = 14,
	Available_PartyOwner = 15,
	Count = 16,
	EStartGameAvailability_MAX = 17
};

// Enum ShooterGame.EAresMainMenuTopNavigationState
enum class EAresMainMenuTopNavigationState : uint8 {
	Init = 0,
	Home = 1,
	PlayFlow = 2,
	Arsenal = 3,
	ShootingRange = 4,
	Profile = 5,
	EndOfGame = 6,
	Debug = 7,
	Collections = 8,
	Store = 9,
	BonusStore = 10,
	Progression = 11,
	Battlepass = 12,
	Agents = 13,
	Test3 = 14,
	Social = 15,
	Tournaments = 16,
	CustomGame = 17,
	Rewards = 18,
	EsportsHub = 19,
	BTE = 20,
	Pickem = 21,
	None = 22,
	EAresMainMenuTopNavigationState_MAX = 23
};

// Enum ShooterGame.EMapPingType
enum class EMapPingType : uint8 {
	EMP_MegaMap = 0,
	EMP_FirstPerson = 1,
	EMP_Count = 2,
	EMP_MAX = 3
};

// Enum ShooterGame.ETargettingRotation
enum class ETargettingRotation : uint8 {
	Identity = 0,
	PawnRotation = 1,
	ControllerAim = 2,
	Count = 3,
	ETargettingRotation_MAX = 4
};

// Enum ShooterGame.EMassRewardCeremonyType
enum class EMassRewardCeremonyType : uint8 {
	None = 0,
	Ranked = 1,
	Titled = 2,
	EMassRewardCeremonyType_MAX = 3
};

// Enum ShooterGame.EMatchDetailsInteractionType
enum class EMatchDetailsInteractionType : uint8 {
	Invalid = 0,
	Kill = 1,
	Death = 2,
	Assist = 3,
	EMatchDetailsInteractionType_MAX = 4
};

// Enum ShooterGame.EMatchDetailsEnemyInteractionSort
enum class EMatchDetailsEnemyInteractionSort : uint8 {
	Invalid = 0,
	Rank = 1,
	Kills = 2,
	EMatchDetailsEnemyInteractionSort_MAX = 3
};

// Enum ShooterGame.EAresPlayerRelationship
enum class EAresPlayerRelationship : uint8 {
	Invalid = 0,
	Self = 1,
	Ally = 2,
	Enemy = 3,
	EAresPlayerRelationship_MAX = 4
};

// Enum ShooterGame.ELocalTeamAffinity
enum class ELocalTeamAffinity : uint8 {
	Friendly = 0,
	Enemy = 1,
	Count = 2,
	ELocalTeamAffinity_MAX = 3
};

// Enum ShooterGame.EReplayRecordedStatus
enum class EReplayRecordedStatus : uint8 {
	NotRecorded = 0,
	Recorded = 1,
	RecordedInternalOnly = 2,
	EReplayRecordedStatus_MAX = 3
};

// Enum ShooterGame.EMenuStackEntryFlags
enum class EMenuStackEntryFlags : uint8 {
	None = 0,
	Dismissable = 1,
	Popup = 2,
	Modal = 4,
	Letterbox = 8,
	UnregisterOnClose = 16,
	LastFlagPlusOne = 17,
	EMenuStackEntryFlags_MAX = 18
};

// Enum ShooterGame.EMenuWidgetState
enum class EMenuWidgetState : uint8 {
	Closed = 0,
	Open = 1,
	Count = 2,
	Invalid = 254,
	EMenuWidgetState_MAX = 255
};

// Enum ShooterGame.EMenuStackWidget_RequestCloseMenuResult
enum class EMenuStackWidget_RequestCloseMenuResult : uint8 {
	DefaultHandling = 0,
	Custom = 1,
	EMenuStackWidget_MAX = 2
};

// Enum ShooterGame.EMaterialPriority
enum class EMaterialPriority : uint8 {
	Normal = 0,
	High = 1,
	EMaterialPriority_MAX = 2
};

// Enum ShooterGame.ERatingRefundReason
enum class ERatingRefundReason : uint8 {
	Cheating = 0,
	Count = 1,
	Invalid = 2,
	ERatingRefundReason_MAX = 3
};

// Enum ShooterGame.EMobileOverlayMenuID
enum class EMobileOverlayMenuID : uint8 {
	None = 0,
	SocialPanel = 1,
	TextChat = 2,
	PartyControl = 3,
	SquadBoost = 4,
	PartyUp = 5,
	Count = 6,
	EMobileOverlayMenuID_MAX = 7
};

// Enum ShooterGame.EModalContextType
enum class EModalContextType : uint8 {
	Contains = 0,
	Exact = 1,
	RestrictiveContains = 2,
	RestrictiveExact = 3,
	Block = 4,
	EModalContextType_MAX = 5
};

// Enum ShooterGame.ENetworkSerializeResult
enum class ENetworkSerializeResult : uint8 {
	SuccessWithPayload = 0,
	SuccessEmptyPayload = 1,
	SerializationError = 2,
	ENetworkSerializeResult_MAX = 3
};

// Enum ShooterGame.ENonVerbalCommSystemName
enum class ENonVerbalCommSystemName : uint8 {
	FirstPersonPingWheel = 0,
	FirstPersonCommWheel = 1,
	MegamapPingWheel = 2,
	Megamap = 3,
	RadioCommMenu = 4,
	ENonVerbalCommSystemName_MAX = 5
};

// Enum ShooterGame.ENonVerbalCommSubSystemName
enum class ENonVerbalCommSubSystemName : uint8 {
	None = 0,
	Combat = 1,
	Strategy = 2,
	Tactical = 3,
	Social = 4,
	Map = 5,
	ENonVerbalCommSubSystemName_MAX = 6
};

// Enum ShooterGame.EAresObjectivePlatformVisibility
enum class EAresObjectivePlatformVisibility : uint8 {
	None = 0,
	PC = 1,
	Mobile = 2,
	All = 3,
	EAresObjectivePlatformVisibility_MAX = 4
};

// Enum ShooterGame.EObserverMovementMode
enum class EObserverMovementMode : uint8 {
	ObserverPawn = 0,
	FocusObject = 1,
	Invalid = 2,
	EObserverMovementMode_MAX = 3
};

// Enum ShooterGame.EOrderedListModelChangeEventType
enum class EOrderedListModelChangeEventType : uint8 {
	Reset = 0,
	Inserted = 1,
	Removed = 2,
	Replaced = 3,
	Reordered = 4,
	EOrderedListModelChangeEventType_MAX = 5
};

// Enum ShooterGame.EOutOfGameConfigurationConfigBool
enum class EOutOfGameConfigurationConfigBool : uint8 {
	OUT_OF_GAME_CONFIG_BOOL_INVALID = 0,
	HOME_SCREEN_PROMO_TILE_AGENT = 1,
	EOutOfGameConfigurationConfigBool_MAX = 2
};

// Enum ShooterGame.ERosterEventIneligiblityType
enum class ERosterEventIneligiblityType : uint8 {
	Eligible = 0,
	Ineligible_MatchLimitReached = 1,
	Ineligible_TournamentLimitReached = 2,
	Inelgible_PointRequirementNotAchieved = 3,
	Ineligible_Unenrolled = 4,
	Invalid = 5,
	ERosterEventIneligiblityType_MAX = 6
};

// Enum ShooterGame.EPartyMessageStatus
enum class EPartyMessageStatus : uint8 {
	Unhandled = 0,
	Accepted = 1,
	Declined = 2,
	Count = 3,
	EPartyMessageStatus_MAX = 4
};

// Enum ShooterGame.ESoloExperienceType
enum class ESoloExperienceType : uint8 {
	NewPlayerExperience = 0,
	ShootingRange = 1,
	BotTrainingMatch = 2,
	ReplayNewPlayerExperience = 3,
	WatchReplay = 4,
	ESoloExperienceType_MAX = 5
};

// Enum ShooterGame.ETeam
enum class ETeam : uint8 {
	TEAM_ONE = 0,
	TEAM_TWO = 1,
	TEAM_SPECTATE = 2,
	TEAM_ONE_COACHES = 3,
	TEAM_TWO_COACHES = 4,
	COUNT = 5,
	INVALID = 6,
	ETeam_MAX = 7
};

// Enum ShooterGame.EAresPartyState
enum class EAresPartyState : uint8 {
	DEFAULT = 0,
	CUSTOM_GAME_SETUP = 1,
	CUSTOM_GAME_STARTING = 2,
	MATCHMAKING = 3,
	STARTING_MATCHMAKING = 4,
	LEAVING_MATCHMAKING = 5,
	MATCHMADE_GAME_STARTING = 6,
	SOLO_EXPERIENCE_STARTING = 7,
	TOURNAMENT_SETUP_STARTING = 8,
	TOURNAMENT_SETUP = 9,
	ROSTER_SETUP_STARTING = 10,
	ROSTER_SETUP = 11,
	TOURNAMENT_STARTING = 12,
	TOURNAMENT = 13,
	TOURNAMENT_LEAVING = 14,
	DROP_IN_STARTING = 15,
	INVALID = 16,
	EAresPartyState_MAX = 17
};

// Enum ShooterGame.EStateTransitionReason
enum class EStateTransitionReason : uint8 {
	NONE = 0,
	GAME_STARTING = 1,
	INVALID = 2,
	EStateTransitionReason_MAX = 3
};

// Enum ShooterGame.EAresPartyErrorNotificationType
enum class EAresPartyErrorNotificationType : uint8 {
	INVALID = 0,
	NONE = 1,
	PREGAME_AFK = 2,
	PREGAME_INTENTIONAL_QUIT = 3,
	PREGAME_CHEAT_EXIT = 4,
	PREGAME_AFK_RETURN_TO_QUEUE = 5,
	PREGAME_INTENTIONAL_QUIT_RETURN_TO_QUEUE = 6,
	PREGAME_DODGED_BUT_PARTY_MEMBERSHIP_CHANGED = 7,
	PREGAME_INTERNAL_ERROR = 8,
	QUEUE_RESTRICTED = 9,
	EAresPartyErrorNotificationType_MAX = 10
};

// Enum ShooterGame.EPatchPreviewState
enum class EPatchPreviewState : uint8 {
	Pending = 0,
	Done = 1,
	Unknown = 2,
	EPatchPreviewState_MAX = 3
};

// Enum ShooterGame.EPatchState
enum class EPatchState : uint8 {
	Updating = 0,
	OutOfDate = 1,
	UpToDate = 2,
	NotInstalled = 3,
	PendingVerify = 4,
	Unknown = 5,
	EPatchState_MAX = 6
};

// Enum ShooterGame.EAresPatchNoteType
enum class EAresPatchNoteType : uint8 {
	UNKNOWN = 0,
	H1 = 1,
	H2 = 2,
	H3 = 3,
	H4 = 4,
	OL = 5,
	UL = 6,
	TextElement = 7,
	INVALID = 8,
	EAresPatchNoteType_MAX = 9
};

// Enum ShooterGame.EEndpointType
enum class EEndpointType : uint8 {
	GamePod = 0,
	NetworkEdge = 1,
	Invalid = 2,
	Count = 2,
	EEndpointType_MAX = 255
};

// Enum ShooterGame.EEndpointState
enum class EEndpointState : uint8 {
	Measuring = 0,
	Complete = 1,
	Invalid = 2,
	Count = 2,
	EEndpointState_MAX = 255
};

// Enum ShooterGame.ENavmeshProjection
enum class ENavmeshProjection : uint8 {
	None = 0,
	IfPossible = 1,
	Required = 2,
	ENavmeshProjection_MAX = 3
};

// Enum ShooterGame.EEncroachCheckFailureMode
enum class EEncroachCheckFailureMode : uint8 {
	Reject = 0,
	ProjectToNavmesh = 1,
	ProjectToNavmeshAndRecheck = 2,
	EEncroachCheckFailureMode_MAX = 3
};

// Enum ShooterGame.EPlatformInitErrorReason
enum class EPlatformInitErrorReason : uint8 {
	None = 0,
	RiotClientManagerDisabled = 1,
	NewUserSignupFailed = 2,
	FailedEntitlementGrant = 3,
	InvalidDisplayName = 4,
	AlreadyInitSessionInvalid = 5,
	SessionManagerDeleted = 6,
	SessionConnectFail = 7,
	RMSDependenciesNotInited = 8,
	RSOQueryTokenFail = 9,
	RSOManagerDeleted = 10,
	RSOSubscriptionFailed = 11,
	RSOQueryUserInfoFail = 12,
	RSOQueryEntitlementsFail = 13,
	RSOEntitlementsSubscriptionFailed = 14,
	RMSManagerDeleted = 15,
	RNetClientFailedProcessInfoQuery = 16,
	RNetClientDeleted = 17,
	RNetEventingClientNotReady = 18,
	RNetEventingClientConnectionFail = 19,
	RNetQueryClientDeleted = 20,
	RNetQueryInitFail = 21,
	TestAccountsManagerDeleted = 22,
	UnableToFindUnusedAccount = 23,
	UnexpectedAccountQueryError = 24,
	AtlasAccountCreateFailed = 25,
	UnableToInitializeGameName = 26,
	TestAccountsEntitlementFailed = 27,
	ConfigManagerDeleted = 28,
	ConfigGetFail = 29,
	PlayerAliasManagerDeleted = 30,
	PlayerAliasQueryError = 31,
	WeGameQueryFail = 32,
	RiotClientProcessTerminated = 33,
	RegionLocaleError = 34,
	CouldNotFetchDisplayName = 35,
	MinimumPlatformInit = 36,
	RMSSubscriptionFailed = 37,
	PregamePlayerFetchError = 38,
	CoreGamePlayerFetchError = 39,
	LoadoutFetchError = 40,
	ContractsFetchError = 41,
	ContractDefinitionsFetchError = 42,
	SystemTimedOut = 43,
	VanguardInitFail = 44,
	VanguardNeedsReboot = 45,
	PlatformDowntime = 46,
	AntiAddictionInitFailed = 47,
	PlayerLegalShutdown = 48,
	ChatInitError = 49,
	VoiceInitError = 50,
	PartyInitFailure = 51,
	MMRInitFailure = 52,
	PresenceInitFailure = 53,
	ContentInitFailure = 54,
	ApplicationRepairManagerInitFailure = 55,
	LegalInfoInitFailure = 56,
	PlayerAffinityInitFailure = 57,
	RSOValidationFailure = 58,
	LoginQueueFetchTokenFailure = 59,
	PatchInitFailure = 60,
	LoginQueuePlayerBanned = 61,
	NoGamepodsToPingFailure = 62,
	ManagerDeleted = 63,
	SessionFetchFailure = 64,
	PatchAvailabilityInitFailure = 65,
	ContentIndexInitFailure = 66,
	ChatFriendMetadataInitFailure = 67,
	CapEntitlementsFetchError = 68,
	CapWalletsFetchError = 69,
	StoreOffersFetchError = 70,
	MassRewardsInitFailure = 71,
	AccountXPInitFailure = 72,
	RosterInitFailure = 73,
	RiotClientConfigInitFailure = 74,
	SessionServiceLoginRestricted = 75,
	TournamentInitFailure = 76,
	EULAAcceptanceFailure = 77,
	ClientVersionUnsupported = 78,
	DailyTicketLoginFailure = 79,
	ModifiedClientBan = 80,
	RiotGamesApiInitFailure = 81,
	LaunchRiotClient = 82,
	FavoritesInitFailure = 83,
	DailyRewardsRenewFailure = 84,
	CNAntiAddictionInitFailed = 85,
	RecruitmentProgressFetchFailed = 86,
	RecruitmentEventDataFetchFailed = 87,
	HotfixPatchsieveFailure = 88,
	HotfixFileRetrievalFailure = 89,
	HotfixApplyFailure = 90,
	RiotClientConfigEnvironmentMismatch = 91,
	FRELoginManagerFailure = 92,
	PrivilegedActivityIneligible = 93,
	Count = 94,
	EPlatformInitErrorReason_MAX = 95
};

// Enum ShooterGame.EPlatformErrorComponent
enum class EPlatformErrorComponent : uint8 {
	VoiceLeave = 0,
	VoiceJoin = 1,
	VoicePTTPut = 2,
	VoiceSettingsPut = 3,
	ChatJoin = 4,
	ChatLeave = 5,
	PlatformFault = 6,
	PlatformInitFailure = 7,
	PaymentInitPurchase = 8,
	EPlatformErrorComponent_MAX = 9
};

// Enum ShooterGame.EAresPlatformInitStatus
enum class EAresPlatformInitStatus : uint8 {
	NotStarted = 0,
	Initialized = 1,
	InitFailure = 2,
	Initializing = 3,
	Count = 4,
	EAresPlatformInitStatus_MAX = 5
};

// Enum ShooterGame.EPlatformInitializerSystemImportance
enum class EPlatformInitializerSystemImportance : uint8 {
	Optional = 0,
	Required = 1,
	EPlatformInitializerSystemImportance_MAX = 2
};

// Enum ShooterGame.EPlatformInitializerTimeoutOptions
enum class EPlatformInitializerTimeoutOptions : uint8 {
	Ignore = 0,
	Enforced = 1,
	EPlatformInitializerTimeoutOptions_MAX = 2
};

// Enum ShooterGame.EPlatformInitializerSystemState
enum class EPlatformInitializerSystemState : uint8 {
	Uninitialized = 0,
	Initializing = 1,
	Initialized = 2,
	Failed = 3,
	EPlatformInitializerSystemState_MAX = 4
};

// Enum ShooterGame.ESessionLoopState
enum class ESessionLoopState : uint8 {
	MENUS = 0,
	PREGAME = 1,
	INGAME = 2,
	REPLAY = 3,
	INVALID = 4,
	COUNT = 5,
	ESessionLoopState_MAX = 6
};

// Enum ShooterGame.ESessionCXNState
enum class ESessionCXNState : uint8 {
	CONNECTED = 0,
	EXPIRED = 1,
	CLOSED = 2,
	COUNT = 3,
	ESessionCXNState_MAX = 4
};

// Enum ShooterGame.EPlayerCardImageType
enum class EPlayerCardImageType : uint8 {
	Small = 0,
	Wide = 1,
	Large = 2,
	EPlayerCardImageType_MAX = 3
};

// Enum ShooterGame.EPlayerDebugFlags
enum class EPlayerDebugFlags : uint8 {
	None = 0,
	TrackDroppedShots = 1,
	TrackMoveData = 2,
	TrackInputEvents = 4,
	PreventAwayPenalty = 8,
	EPlayerDebugFlags_Max = 9,
	EPlayerDebugFlags_Max = 10
};

// Enum ShooterGame.EPlayerPerfStatField
enum class EPlayerPerfStatField : uint8 {
	CurrentTickMaximum = 0,
	CurrentTickMinimum = 1,
	CurrentTickAverage = 2,
	CurrentTickSum = 3,
	WorldDurationSum = 4,
	MovingAverage = 5,
	SumPerSecond = 6,
	ExponentialSmooth = 7,
	EnumCount = 8,
	EPlayerPerfStatField_MAX = 9
};

// Enum ShooterGame.EPlayerPerfMetricCategory
enum class EPlayerPerfMetricCategory : uint8 {
	TotalFrameTime = 0,
	GameFrameTime = 1,
	RenderFrameTime = 2,
	FrameRate = 3,
	ServerFrameRate = 4,
	AvailablePhysicalMemory = 5,
	UsedPhysicalMemory = 6,
	NetworkRtt = 7,
	PacketsLostTotal = 8,
	PacketsLostIncoming = 9,
	PacketsLostOutgoing = 10,
	ReceivedPackets = 11,
	SentPackets = 12,
	PacketLossPercentageTotal = 13,
	PacketLossPercentageIncoming = 14,
	PacketLossPercentageOutgoing = 15,
	RHIFrameTime = 16,
	IdleFrameTime = 17,
	InputLatencyCpuPlusGpu = 18,
	InputLatencyCpu = 19,
	InputLatencyGpu = 20,
	RenderWait = 21,
	GpuRenderFrameTime = 22,
	RHIPresentTime = 23,
	RemoteInterpDelayMs = 24,
	QueuedRemoteMoveCount = 25,
	ConsecutiveForwardPredictionTicks = 26,
	UploadedData = 27,
	DownloadedData = 28,
	TotalTransferredData = 29,
	InPacketSize = 30,
	OutPacketSize = 31,
	MoveCorrectionDistance = 32,
	MoveTimelineShiftMs = 33,
	ReceivedEquippableCorrection = 34,
	OutgoingInputQueueLength = 35,
	OutgoingMoveQueueLength = 36,
	ClientIncomingMoveProcessingDelay = 37,
	ServerIncomingMoveProcessingDelay = 38,
	ATB = 39,
	FrameCount = 40,
	NetworkJitter = 41,
	FullEndToEndLatency = 42,
	FiringError = 43,
	RGILatencyMarkers_TotalLatencyMs = 44,
	RGILatencyMarkers_TotalWorkMs = 45,
	RGILatencyMarkers_TotalSlopMs = 46,
	EnumCount = 47,
	EPlayerPerfMetricCategory_MAX = 48
};

// Enum ShooterGame.EPlayerPerfMetricUnitType
enum class EPlayerPerfMetricUnitType : uint8 {
	Bytes = 0,
	Megabytes = 1,
	UnitlessIntegral = 2,
	Milliseconds = 3,
	Percentage = 4,
	Degrees = 5,
	EnumCount = 6,
	EPlayerPerfMetricUnitType_MAX = 7
};

// Enum ShooterGame.EGraphMetricTextPlacement
enum class EGraphMetricTextPlacement : uint8 {
	Top = 0,
	Middle = 1,
	Bottom = 2,
	EnumCount = 3,
	EGraphMetricTextPlacement_MAX = 4
};

// Enum ShooterGame.EGraphDisplayType
enum class EGraphDisplayType : uint8 {
	Line = 0,
	Bar = 1,
	EnumCount = 2,
	EGraphDisplayType_MAX = 3
};

// Enum ShooterGame.EPlayerFeedbackSurveySource
enum class EPlayerFeedbackSurveySource : uint8 {
	UNKNOWN = 0,
	END_OF_GAME = 1,
	STORE_PURCHASE = 2,
	LOGIN = 3,
	TUTORIAL_COMPLETE = 4,
	COUNT = 5,
	EPlayerFeedbackSurveySource_MAX = 6
};

// Enum ShooterGame.EPlayerFeedbackToolSurveyType
enum class EPlayerFeedbackToolSurveyType : uint8 {
	ExternalLink = 0,
	HostedBrowser = 1,
	EPlayerFeedbackToolSurveyType_MAX = 2
};

// Enum ShooterGame.EFeedbackMessageType
enum class EFeedbackMessageType : uint8 {
	Invalid = 0,
	System = 1,
	Model = 2,
	EFeedbackMessageType_MAX = 3
};

// Enum ShooterGame.EPlayerReportReason
enum class EPlayerReportReason : uint8 {
	COMMS_ABUSE_TEXT = 0,
	COMMS_ABUSE_VOICE = 1,
	CHEATING = 2,
	AFK = 3,
	OFFENSIVE_NAME = 4,
	SABOTAGING_TEAM = 5,
	DISRESPECTFUL_BEHAVIOR = 6,
	THREATS = 7,
	BOTTING = 8,
	ABUSING_GLITCHES = 9,
	RANK_MANIPULATION = 10,
	Invalid = 11,
	Count = 12,
	EPlayerReportReason_MAX = 13
};

// Enum ShooterGame.EPremierTeamReportReason
enum class EPremierTeamReportReason : uint8 {
	INAPPROPRIATE_TEAM_NAME = 0,
	Invalid = 1,
	Count = 2,
	EPremierTeamReportReason_MAX = 3
};

// Enum ShooterGame.EPregameTeamID
enum class EPregameTeamID : uint8 {
	Blue = 0,
	Red = 1,
	Neutral = 2,
	Invalid = 3,
	EPregameTeamID_MAX = 4
};

// Enum ShooterGame.EDivisionGroup
enum class EDivisionGroup : uint8 {
	INVALID = 0,
	UNSEEDED = 1,
	OPEN = 2,
	INTERMEDIATE = 3,
	ADVANCED = 4,
	ELITE = 5,
	CONTENDER = 6,
	INVITE = 7,
	Count = 8,
	EDivisionGroup_MAX = 9
};

// Enum ShooterGame.EPremierMatchmakingStrategy
enum class EPremierMatchmakingStrategy : uint8 {
	INVALID = 0,
	PATIENT = 1,
	EAGER = 2,
	Count = 3,
	EPremierMatchmakingStrategy_MAX = 4
};

// Enum ShooterGame.EDivisionPlayoffThreshold
enum class EDivisionPlayoffThreshold : uint8 {
	INVALID = 0,
	POINTS = 1,
	LEADERBOARD_RANK = 2,
	Count = 3,
	EDivisionPlayoffThreshold_MAX = 4
};

// Enum ShooterGame.EDivisionPromotionThreshold
enum class EDivisionPromotionThreshold : uint8 {
	INVALID = 0,
	LEADERBOARD_RANK = 1,
	PLAYOFF_PLACEMENT = 2,
	NONE = 3,
	Count = 4,
	EDivisionPromotionThreshold_MAX = 5
};

// Enum ShooterGame.EDivisionSkipReseedCriteria
enum class EDivisionSkipReseedCriteria : uint8 {
	NONE = 0,
	ALL = 1,
	LEADERBOARD_RANK = 2,
	Count = 3,
	EDivisionSkipReseedCriteria_MAX = 4
};

// Enum ShooterGame.ETournamentRound
enum class ETournamentRound : uint8 {
	Groups = 0,
	Semifinals = 1,
	Finals = 2,
	Count = 3,
	Invalid = 254,
	ETournamentRound_MAX = 255
};

// Enum ShooterGame.EPremierEligibilityStateOld
enum class EPremierEligibilityStateOld : uint8 {
	Eligible = 0,
	IneligibleRestrictions = 1,
	IneligibleAVS = 2,
	IneligibleRanked = 3,
	Count = 4,
	Invalid = 5,
	EPremierEligibilityStateOld_MAX = 6
};

// Enum ShooterGame.EPremierRestrictionsStateOld
enum class EPremierRestrictionsStateOld : uint8 {
	Eligible = 0,
	Ineligible = 1,
	Disqualified = 2,
	Count = 3,
	Invalid = 4,
	EPremierRestrictionsStateOld_MAX = 5
};

// Enum ShooterGame.EPremierRosterMatchHistoryEntryType
enum class EPremierRosterMatchHistoryEntryType : uint8 {
	INVALID = 0,
	LEAGUE = 1,
	TOURNAMENT = 2,
	SCRIM = 3,
	BYE = 4,
	Count = 5,
	EPremierRosterMatchHistoryEntryType_MAX = 6
};

// Enum ShooterGame.ERosterMemberChangeRoleErrorType
enum class ERosterMemberChangeRoleErrorType : uint8 {
	MaxCaptainLimitReached = 0,
	Default = 1,
	Count = 2,
	Invalid = 3,
	ERosterMemberChangeRoleErrorType_MAX = 4
};

// Enum ShooterGame.EPremierRosterMatchHistoryEntryTypeOld
enum class EPremierRosterMatchHistoryEntryTypeOld : uint8 {
	INVALID = 0,
	LEAGUE = 1,
	TOURNAMENT = 2,
	SCRIM = 3,
	BYE = 4,
	Count = 5,
	EPremierRosterMatchHistoryEntryTypeOld_MAX = 6
};

// Enum ShooterGame.EPremierRosterTextChatHandleState
enum class EPremierRosterTextChatHandleState : uint8 {
	Initial = 0,
	Registering = 1,
	RegisteringCancelling = 2,
	Registered = 3,
	Unregistered = 4,
	Count = 5,
	Invalid = 6,
	EPremierRosterTextChatHandleState_MAX = 7
};

// Enum ShooterGame.EAresPartyTournamentStartAvailability
enum class EAresPartyTournamentStartAvailability : uint8 {
	Unavailable_InQueue = 0,
	Unavailable_QueueDisabled = 1,
	Unavailable_EventNotLive = 2,
	Unavailable_LockInToPlay = 3,
	Unavailable_AwaitingLockIn = 4,
	Unavailable_LockInPhaseEnded = 5,
	Unavailable_Unqualified = 6,
	Unavailable_LeagueMatchLimitReached = 7,
	Unavailable_TournamentLimitReached = 8,
	Unavailable_NotEnoughPoints = 9,
	Unavailable_Unenrolled = 10,
	Available_PartyLeader = 11,
	Available_NotPartyLeader = 12,
	TournamentStarted = 13,
	EAresPartyTournamentStartAvailability_MAX = 14
};

// Enum ShooterGame.EPremierDivisionGroup
enum class EPremierDivisionGroup : uint8 {
	INVALID = 0,
	UNSEEDED = 1,
	OPEN = 2,
	INTERMEDIATE = 3,
	ADVANCED = 4,
	ELITE = 5,
	CONTENDER = 6,
	INVITE = 7,
	Count = 8,
	EPremierDivisionGroup_MAX = 9
};

// Enum ShooterGame.EPremierDivisionIcon
enum class EPremierDivisionIcon : uint8 {
	INVALID = 0,
	SMALL = 1,
	LARGE = 2,
	Count = 3,
	EPremierDivisionIcon_MAX = 4
};

// Enum ShooterGame.EPremierEventDayOfWeek
enum class EPremierEventDayOfWeek : uint8 {
	INVALID = 0,
	MONDAY = 1,
	TUESDAY = 2,
	WEDNESDAY = 3,
	THURSDAY = 4,
	FRIDAY = 5,
	SATURDAY = 6,
	SUNDAY = 7,
	Count = 8,
	EPremierEventDayOfWeek_MAX = 9
};

// Enum ShooterGame.EPremierRosterEnrollErrorType
enum class EPremierRosterEnrollErrorType : uint8 {
	MinumumRequiredMembers = 0,
	Default = 1,
	Count = 2,
	Invalid = 3,
	EPremierRosterEnrollErrorType_MAX = 4
};

// Enum ShooterGame.EPremierEligibilityState
enum class EPremierEligibilityState : uint8 {
	Eligible = 0,
	IneligibleRestrictions = 1,
	IneligibleAVS = 2,
	IneligibleRanked = 3,
	Count = 4,
	Invalid = 5,
	EPremierEligibilityState_MAX = 6
};

// Enum ShooterGame.EPremierRestrictionsState
enum class EPremierRestrictionsState : uint8 {
	Eligible = 0,
	Ineligible = 1,
	Disqualified = 2,
	Count = 3,
	Invalid = 4,
	EPremierRestrictionsState_MAX = 5
};

// Enum ShooterGame.EChatPresenceState
enum class EChatPresenceState : uint8 {
	CHAT = 0,
	AWAY = 1,
	DND = 2,
	OFFLINE = 3,
	UNKNOWN = 4,
	EChatPresenceState_MAX = 5
};

// Enum ShooterGame.EChatPresenceProduct
enum class EChatPresenceProduct : uint8 {
	ARES = 0,
	LEAGUE = 1,
	BACON = 2,
	KEYSTONE = 3,
	WILDRIFT = 4,
	TFT = 5,
	LION = 6,
	RIOT_MOBILE = 7,
	UNKNOWN = 8,
	NONE = 9,
	EChatPresenceProduct_MAX = 10
};

// Enum ShooterGame.ENumericProgressCalculationMode
enum class ENumericProgressCalculationMode : uint8 {
	CompletedCount = 0,
	SumProgress = 1,
	SumProgressValidOnly = 2,
	ENumericProgressCalculationMode_MAX = 3
};

// Enum ShooterGame.EProjectileSimulation
enum class EProjectileSimulation : uint8 {
	Owner = 0,
	Server = 1,
	OwnerAndServer = 2,
	AllMachines = 3,
	Count = 4,
	EProjectileSimulation_MAX = 5
};

// Enum ShooterGame.EProjectileStopAction
enum class EProjectileStopAction : uint8 {
	Destroy = 0,
	Idle = 1,
	DelayedDestroy = 2,
	Count = 3,
	EProjectileStopAction_MAX = 4
};

// Enum ShooterGame.ETracerOption
enum class ETracerOption : uint8 {
	EnableTracers = 0,
	DisableTracers = 1,
	ETracerOption_MAX = 2
};

// Enum ShooterGame.EImpactEffectsOption
enum class EImpactEffectsOption : uint8 {
	EnableImpactEffects = 0,
	DisableImpactEffects = 1,
	EImpactEffectsOption_MAX = 2
};

// Enum ShooterGame.EChildActorIgnoreSetting
enum class EChildActorIgnoreSetting : uint8 {
	AutoAddIgnoredActorsChildren = 0,
	DoNothingAutomatically = 1,
	EChildActorIgnoreSetting_MAX = 2
};

// Enum ShooterGame.EProjectileCollisionProcessInstruction
enum class EProjectileCollisionProcessInstruction : uint8 {
	ContinueToNextComponent = 0,
	StopProcessingCollision = 1,
	StopProjectile = 2,
	EProjectileCollisionProcessInstruction_MAX = 3
};

// Enum ShooterGame.EProjectilePerspective
enum class EProjectilePerspective : uint8 {
	FirstPerson = 0,
	ThirdPerson = 1,
	Count = 2,
	EProjectilePerspective_MAX = 3
};

// Enum ShooterGame.EPurchaseType
enum class EPurchaseType : uint8 {
	PurchaseType_None = 0,
	PurchaseType_Rewards = 1,
	PurchaseType_BonusOffer = 2,
	PurchaseType_ContractLevels = 3,
	PurchaseType_ItemLevels = 4,
	PurchaseType_ContractUpgrade = 5,
	PurchaseType_UpgradeCurrency = 6,
	PurchaseType_Bundle = 7,
	PurchaseType_ItemLevelsV2 = 8,
	PurchaseType_Sidegrade = 9,
	PurchaseType_JuiceOpen = 10,
	PurchaseType_JuiceCraft = 11,
	PurchaseType_PlatformOffering = 12,
	PurchaseType_Gifts = 13,
	PurchaseType_GiftAccept = 14,
	PurchaseType_GiftDecline = 15,
	Count = 16,
	EPurchaseType_MAX = 17
};

// Enum ShooterGame.EPurchaseSource
enum class EPurchaseSource : uint8 {
	UNKNOWN = 0,
	ROTATION = 1,
	FEATURED = 2,
	BUNDLE = 3,
	BUNDLE_INDIVIDUAL = 4,
	REWARD = 5,
	CONTRACT = 6,
	CURRENCY = 7,
	ITEM_LEVEL_UPGRADE = 8,
	BATTLEPASS = 9,
	BATTLEPASS_PROGRESS = 10,
	AGENT_PROGRESS = 11,
	BONUS_SHOP = 12,
	ITEM_VARIANT_UPGRADE = 13,
	JUICE = 14,
	JUICE_CRAFT = 15,
	JUICE_CRAFT_LEVEL_UPGRADE = 16,
	JUICE_CRAFT_VARIANT_UPGRADE = 17,
	ACCESSORY = 18,
	AGENT_STORE = 19,
	COUNT = 20,
	EPurchaseSource_MAX = 21
};

// Enum ShooterGame.ERadialTargetSourcePoint
enum class ERadialTargetSourcePoint : uint8 {
	PawnLocation = 0,
	CameraLocation = 1,
	TransformContext = 2,
	ActorContext = 3,
	Count = 4,
	ERadialTargetSourcePoint_MAX = 5
};

// Enum ShooterGame.ERateLimiterMethod
enum class ERateLimiterMethod : uint8 {
	Cooldown = 0,
	RollingWindow = 1,
	RollingWindowExtendedCooldown = 2,
	Count = 3,
	ERateLimiterMethod_MAX = 4
};

// Enum ShooterGame.EReclaimChargeAction
enum class EReclaimChargeAction : uint8 {
	NotReclaimable = 0,
	GrantFullCharge = 1,
	GrantTemporaryCharge = 2,
	StartCooldown = 3,
	EReclaimChargeAction_MAX = 4
};

// Enum ShooterGame.ECanReloadAmmoCheckOption
enum class ECanReloadAmmoCheckOption : uint8 {
	IncludeAmmoCheck = 0,
	ExcludeAmmoCheck = 1,
	Count = 2,
	ECanReloadAmmoCheckOption_MAX = 3
};

// Enum ShooterGame.EMagazineEjectableBehavior
enum class EMagazineEjectableBehavior : uint8 {
	None = 0,
	EjectOnLoad = 1,
	EjectOnAnimationComplete = 2,
	EMagazineEjectableBehavior_MAX = 3
};

// Enum ShooterGame.ERemoteMovementScenario
enum class ERemoteMovementScenario : uint8 {
	Spectating = 0,
	Playing = 1,
	ERemoteMovementScenario_MAX = 2
};

// Enum ShooterGame.EReplayRecordPIEMode
enum class EReplayRecordPIEMode : uint8 {
	DoNotRecord = 0,
	RecordOnce = 1,
	AlwaysRecord = 2,
	Count = 3,
	EReplayRecordPIEMode_MAX = 4
};

// Enum ShooterGame.EReplayEventRecordingVerbosity
enum class EReplayEventRecordingVerbosity : uint8 {
	MinimumToFunction = 0,
	Everything = 1,
	Count = 2,
	EReplayEventRecordingVerbosity_MAX = 3
};

// Enum ShooterGame.EMatchHistoryReplayStatus
enum class EMatchHistoryReplayStatus : uint8 {
	Invalid = 0,
	NotRecorded = 1,
	Unavailable = 2,
	AvailableSoon = 3,
	Downloadable = 4,
	Downloading = 5,
	Playable = 6,
	Incompatible = 7,
	Error = 8,
	EMatchHistoryReplayStatus_MAX = 9
};

// Enum ShooterGame.EMatchHistoryReplayCancelStatus
enum class EMatchHistoryReplayCancelStatus : uint8 {
	Hidden = 0,
	CancelDownload = 1,
	DeleteFile = 2,
	EMatchHistoryReplayCancelStatus_MAX = 3
};

// Enum ShooterGame.EReplayFileOperationErrorCode
enum class EReplayFileOperationErrorCode : uint8 {
	None = 0,
	FileBusy = 1,
	FileDoesNotExist = 2,
	FileDeleteFailed = 3,
	ChecksumGenerationFailed = 4,
	ChecksumDiffer = 5,
	EReplayFileOperationErrorCode_MAX = 6
};

// Enum ShooterGame.EReplayPreLaunchCheckCode
enum class EReplayPreLaunchCheckCode : uint8 {
	Passed = 0,
	NullWorldOrGameInstance = 1,
	MatchNotFound = 2,
	PlatformFetchedCLIncompatible = 3,
	FileNotPresent = 4,
	FileBusy = 5,
	FileIntegrityCheckFailed = 6,
	EReplayPreLaunchCheckCode_MAX = 7
};

// Enum ShooterGame.EReplayChangelistCompatibilityResult
enum class EReplayChangelistCompatibilityResult : uint8 {
	None = 0,
	UnexpectedError = 1,
	Incompatible = 2,
	InvalidRecordingCL = 3,
	InvalidRecordingCLMissingSummary = 4,
	Compatible = 5,
	CompatibleNonExact = 6,
	DevOverrideCompatible = 7,
	EReplayChangelistCompatibilityResult_MAX = 8
};

// Enum ShooterGame.EReplayDownloadResultCode
enum class EReplayDownloadResultCode : uint8 {
	Invalid = 0,
	Complete = 1,
	Failed = 2,
	CancelledBySystem = 3,
	CancelledByUser = 4,
	Count = 5,
	EReplayDownloadResultCode_MAX = 6
};

// Enum ShooterGame.EGamhsInfoType
enum class EGamhsInfoType : uint8 {
	NONE = 0,
	SUMMARY = 1,
	REPLAY = 2,
	EGamhsInfoType_MAX = 3
};

// Enum ShooterGame.EReplayFileAvailability
enum class EReplayFileAvailability : uint8 {
	Uninitialized = 0,
	NotAvailable = 1,
	Available = 2,
	EReplayFileAvailability_MAX = 3
};

// Enum ShooterGame.EReplayGameSpecificHeaderVersion
enum class EReplayGameSpecificHeaderVersion : uint8 {
	None = 0,
	BaseVersion = 1,
	WithMegapacketLoadout = 2,
	VersionPlusOne = 3,
	LatestVersion = 2,
	EReplayGameSpecificHeaderVersion_MAX = 4
};

// Enum ShooterGame.EReplayDownloadCancelType
enum class EReplayDownloadCancelType : uint8 {
	NotCanceled = 0,
	CanceledByUser = 1,
	CanceledBySystem = 2,
	Count = 3,
	EReplayDownloadCancelType_MAX = 4
};

// Enum ShooterGame.EMatchHistoryContext
enum class EMatchHistoryContext : uint8 {
	Invalid = 0,
	List = 1,
	Details = 2,
	EndOfGame = 3,
	EMatchHistoryContext_MAX = 4
};

// Enum ShooterGame.EReplayEventGroup
enum class EReplayEventGroup : uint8 {
	Checkpoint = 0,
	TestingBloat = 1,
	RoundStart = 2,
	SwitchTeams = 3,
	SpikePlanted = 4,
	SpikeDefused = 5,
	SpikeExploded = 6,
	CharacterTookDamage = 7,
	CharacterDeath = 8,
	CharacterEquippableUsed = 9,
	CharacterEquippableChanged = 10,
	CharacterUltimateUsed = 11,
	All = 12,
	Count = 13,
	Invalid = 254,
	EGameFeatureConfigName_MAX = 255,
	EReplayEventGroup_MAX = 256
};

// Enum ShooterGame.EPauseStateCacheFlag
enum class EPauseStateCacheFlag : uint8 {
	NotSet = 0,
	Cleared = 1,
	RestorePlay = 2,
	RestorePause = 3,
	EPauseStateCacheFlag_MAX = 4
};

// Enum ShooterGame.EComboFFPhaseType
enum class EComboFFPhaseType : uint8 {
	Invalid = 0,
	GoToTimeCheckpoint = 1,
	GoToTimeFastForward = 2,
	TimeDilationCatchup = 3,
	EComboFFPhaseType_MAX = 4
};

// Enum ShooterGame.EReplayUIVisibilityOption
enum class EReplayUIVisibilityOption : uint8 {
	ToggleGameUIVisibility = 0,
	ToggleSightLines = 1,
	ToggleCombatReport = 2,
	TogglePlayerLoadout = 3,
	Count = 4,
	EReplayUIVisibilityOption_MAX = 5
};

// Enum ShooterGame.EReplicationSleepWhen
enum class EReplicationSleepWhen : uint8 {
	Never = 0,
	Timer = 1,
	OnRequest = 2,
	Count = 3,
	EReplicationSleepWhen_MAX = 4
};

// Enum ShooterGame.EReplicationSleepState
enum class EReplicationSleepState : uint8 {
	Awake = 0,
	GoingToSleep = 1,
	Asleep = 2,
	Count = 3,
	EReplicationSleepState_MAX = 4
};

// Enum ShooterGame.EActorEvent
enum class EActorEvent : uint8 {
	None = 0,
	Destroyed = 1,
	Killed = 2,
	Count = 3,
	EActorEvent_MAX = 4
};

// Enum ShooterGame.EActorCombination
enum class EActorCombination : uint8 {
	Any = 0,
	All = 1,
	Count = 2,
	EActorCombination_MAX = 3
};

// Enum ShooterGame.EEquipType
enum class EEquipType : uint8 {
	Equip = 0,
	Unequip = 1,
	AutoEquip = 2,
	Count = 3,
	EEquipType_MAX = 4
};

// Enum ShooterGame.EInfractionType
enum class EInfractionType : uint8 {
	Afk = 0,
	FriendlyFire = 1,
	TextAbuse = 2,
	VoiceAbuse = 3,
	Count = 4,
	EInfractionType_MAX = 5
};

// Enum ShooterGame.EInterventionType
enum class EInterventionType : uint8 {
	None = 0,
	AtRisk = 1,
	Active = 2,
	Count = 3,
	EInterventionType_MAX = 4
};

// Enum ShooterGame.ERMSNotifyEffectPenaltyEffectState
enum class ERMSNotifyEffectPenaltyEffectState : uint8 {
	PenaltyApplied = 0,
	PenaltyReverted = 1,
	PenaltyExpired = 2,
	Count = 3,
	ERMSNotifyEffectPenaltyEffectState_MAX = 4
};

// Enum ShooterGame.ERMSNotifyEffectRecipient
enum class ERMSNotifyEffectRecipient : uint8 {
	Self = 0,
	Teammates = 1,
	Opponents = 2,
	Count = 3,
	ERMSNotifyEffectRecipient_MAX = 4
};

// Enum ShooterGame.ERMSNotifyEffectIntervention
enum class ERMSNotifyEffectIntervention : uint8 {
	CommsMute10 = 0,
	CommsMute20 = 1,
	CommsMuteMatch = 2,
	Count = 3,
	ERMSNotifyEffectIntervention_MAX = 4
};

// Enum ShooterGame.ERMSNotifyEffectBehavior
enum class ERMSNotifyEffectBehavior : uint8 {
	CommsAbuse = 0,
	Count = 1,
	ERMSNotifyEffectBehavior_MAX = 2
};

// Enum ShooterGame.ERewardType
enum class ERewardType : uint8 {
	CHARACTER = 0,
	GUN_SKIN = 1,
	GUN_SKIN_LEVEL = 2,
	GUN_SKIN_CHROMA = 3,
	ATTACHMENT = 4,
	CARD = 5,
	BUDDY = 6,
	SPRAY = 7,
	TOTEM = 8,
	TITLE = 9,
	CURRENCY = 10,
	CONTRACT_XP = 11,
	JUICE_BOX = 12,
	OTHER = 13,
	ERewardType_MAX = 14
};

// Enum ShooterGame.ERewardAttributionSource
enum class ERewardAttributionSource : uint8 {
	NONE = 0,
	BATTLEPASS = 1,
	EVENT_PASS = 2,
	BTE = 3,
	AGENT_RECRUITMENT = 4,
	GENERAL_EVENT = 5,
	COUNT = 6,
	ERewardAttributionSource_MAX = 7
};

// Enum ShooterGame.ERewindState
enum class ERewindState : uint8 {
	NotRewound = 0,
	Rewound = 1,
	ERewindState_MAX = 2
};

// Enum ShooterGame.ERiotClientStatus
enum class ERiotClientStatus : uint8 {
	Restarting = 0,
	Disconnected = 1,
	WaitingForPlugins = 2,
	CheckingRegionLocale = 3,
	WaitingForLogin = 4,
	WaitingForChat = 5,
	RefreshingUserInfo = 6,
	WaitingForRMSSession = 7,
	DelayForSession = 8,
	Ready = 9,
	PendingQueryResult = 10,
	Error = 11,
	Count = 12,
	ERiotClientStatus_MAX = 13
};

// Enum ShooterGame.ERMSConnectionState
enum class ERMSConnectionState : uint8 {
	Connecting = 0,
	Connected = 1,
	Disconnecting = 2,
	Disconnected = 3,
	SwitchingServers = 4,
	Unknown = 5,
	ERMSConnectionState_MAX = 6
};

// Enum ShooterGame.ERNetConnectionStatus
enum class ERNetConnectionStatus : uint8 {
	Uninitialized = 0,
	Disconnecting = 1,
	Disconnected = 2,
	Connecting = 3,
	Connected = 4,
	Count = 5,
	ERNetConnectionStatus_MAX = 6
};

// Enum ShooterGame.ERNetProcessStatus
enum class ERNetProcessStatus : uint8 {
	Uninitialized = 0,
	Alive = 1,
	Terminated = 2,
	ERNetProcessStatus_MAX = 3
};

// Enum ShooterGame.ERNetEventType
enum class ERNetEventType : uint8 {
	Create = 0,
	Update = 1,
	Delete = 2,
	Invalid = 3,
	ERNetEventType_MAX = 4
};

// Enum ShooterGame.ERiotClientHeartbeatPhase
enum class ERiotClientHeartbeatPhase : uint8 {
	None = 0,
	Idle = 1,
	Gameplay = 2,
	Pending = 3,
	ERiotClientHeartbeatPhase_MAX = 4
};

// Enum ShooterGame.EVoiceSpeakingChannelSettingValue
enum class EVoiceSpeakingChannelSettingValue : uint8 {
	TeamChat = 0,
	PartyChat = 1,
	Count = 2,
	EVoiceSpeakingChannelSettingValue_MAX = 3
};

// Enum ShooterGame.EChannelMuteReason
enum class EChannelMuteReason : uint8 {
	None = 0,
	ClutchMute = 1,
	MuteForMatchDuration = 2,
	LoadingScreen = 4,
	EChannelMuteReason_MAX = 5
};

// Enum ShooterGame.ERoundPersistenceBehavior
enum class ERoundPersistenceBehavior : uint8 {
	DoNothing = 0,
	Destroy = 1,
	Persist = 2,
	PersistIfOwnerAlive = 3,
	ERoundPersistenceBehavior_MAX = 4
};

// Enum ShooterGame.EGameplayPersistenceBehavior
enum class EGameplayPersistenceBehavior : uint8 {
	DoNothing = 0,
	Destroy = 1,
	DestroyWithDamage = 2,
	CosmeticAwareDestroy = 3,
	EGameplayPersistenceBehavior_MAX = 4
};

// Enum ShooterGame.EAresMinimapPositionSpace
enum class EAresMinimapPositionSpace : uint8 {
	AMPS_World = 0,
	AMPS_WorldClamped = 1,
	AMPS_Minimap = 2,
	AMPS_Screen = 3,
	AMSS_None = 4,
	EAresMinimapPositionSpace_MAX = 5
};

// Enum ShooterGame.EAresMinimapSizeSpace
enum class EAresMinimapSizeSpace : uint8 {
	AMSS_World = 0,
	AMSS_Screen = 1,
	AMSS_ConstantScreen = 2,
	AMSS_Minimap = 3,
	AMSS_None = 4,
	AMSS_MAX = 5
};

// Enum ShooterGame.EAresMinimapRotationSpace
enum class EAresMinimapRotationSpace : uint8 {
	AMRS_World = 0,
	AMRS_Minimap = 1,
	AMRS_ConstantMinimap = 2,
	AMRS_Outward = 3,
	AMRS_None = 4,
	AMRS_MAX = 5
};

// Enum ShooterGame.EAresMinimapLayer
enum class EAresMinimapLayer : uint8 {
	AML_Map = 0,
	AML_MapVolumes = 1,
	AML_Footsteps = 2,
	AML_VisionCones = 3,
	AML_MapIcons = 4,
	AML_Callouts = 5,
	AML_AbilityIcons = 6,
	AML_BombIcons = 7,
	AML_PlayerIcons = 8,
	AML_Targeting = 9,
	AML_ControlPrompts = 10,
	AML_Overlay = 11,
	Count = 12,
	EAresMinimapLayer_MAX = 13
};

// Enum ShooterGame.EAresSeasonType
enum class EAresSeasonType : uint8 {
	Episode = 0,
	Act = 1,
	Invalid = 2,
	Count = 3,
	EAresSeasonType_MAX = 4
};

// Enum ShooterGame.EAbilityUsageEventType
enum class EAbilityUsageEventType : uint8 {
	CombatReport = 0,
	Telemetry = 1,
	Count = 2,
	EAbilityUsageEventType_MAX = 3
};

// Enum ShooterGame.EAbilityUsageLocationType
enum class EAbilityUsageLocationType : uint8 {
	CastLocation = 0,
	WallSegmentsSage = 1,
	ProjectileStopLocations = 2,
	YoruCloneStopLocation = 3,
	CastAndTargetLocations = 4,
	EAbilityUsageLocationType_MAX = 5
};

// Enum ShooterGame.EPlayerTelemetryDisconnectOutcome
enum class EPlayerTelemetryDisconnectOutcome : uint8 {
	Reconnected = 0,
	DidNotReturn = 1,
	Count = 2,
	EPlayerTelemetryDisconnectOutcome_MAX = 3
};

// Enum ShooterGame.ENPECheckpointStatus
enum class ENPECheckpointStatus : uint8 {
	Started = 0,
	Completed = 1,
	Abandoned = 2,
	ENPECheckpointStatus_MAX = 3
};

// Enum ShooterGame.ERewindTimestampSource
enum class ERewindTimestampSource : uint8 {
	Equippable = 0,
	Movement = 1,
	Manual = 2,
	ERewindTimestampSource_MAX = 3
};

// Enum ShooterGame.ECoachMessageType
enum class ECoachMessageType : uint8 {
	Pregame = 0,
	InGame = 1,
	ECoachMessageType_MAX = 2
};

// Enum ShooterGame.EAresRadialCheckType
enum class EAresRadialCheckType : uint8 {
	SimpleRangeCheck = 0,
	SimpleRangeCheck2D = 1,
	CollisionRangeCheck = 2,
	Count = 3,
	EAresRadialCheckType_MAX = 4
};

// Enum ShooterGame.EAresLineOfSightCheckType
enum class EAresLineOfSightCheckType : uint8 {
	NoLineOfSightCheck = 0,
	RequireLineOfSight = 1,
	RequireReverseLineOfSight = 2,
	EAresLineOfSightCheckType_MAX = 3
};

// Enum ShooterGame.EAresShooterCharacterSearchType
enum class EAresShooterCharacterSearchType : uint8 {
	DontFindShooterCharacters = 0,
	FindShooterCharacters = 1,
	EAresShooterCharacterSearchType_MAX = 2
};

// Enum ShooterGame.EAresGameObjectSearchType
enum class EAresGameObjectSearchType : uint8 {
	DontFindGameObjects = 0,
	FindGameObjects = 1,
	EAresGameObjectSearchType_MAX = 2
};

// Enum ShooterGame.EAresProjectileSearchType
enum class EAresProjectileSearchType : uint8 {
	DontFindProjectiles = 0,
	FindProjectiles = 1,
	EAresProjectileSearchType_MAX = 2
};

// Enum ShooterGame.EAresConeAngleCheckType
enum class EAresConeAngleCheckType : uint8 {
	TwoDimensional = 0,
	ThreeDimensional = 1,
	EAresConeAngleCheckType_MAX = 2
};

// Enum ShooterGame.EAresActorVisibilityTarget
enum class EAresActorVisibilityTarget : uint8 {
	CenterMass = 0,
	Head = 1,
	Feet = 2,
	LeftEdge = 3,
	RightEdge = 4,
	LookVector = 5,
	EAresActorVisibilityTarget_MAX = 6
};

// Enum ShooterGame.EThrottleOutputPins
enum class EThrottleOutputPins : uint8 {
	Allowed = 0,
	Throttled = 1,
	EThrottleOutputPins_MAX = 2
};

// Enum ShooterGame.EAresDeathCamFocusPoint
enum class EAresDeathCamFocusPoint : uint8 {
	Body = 0,
	Killer = 1,
	EAresDeathCamFocusPoint_MAX = 2
};

// Enum ShooterGame.EShooterCharacterCameraState
enum class EShooterCharacterCameraState : uint8 {
	FollowRecoilCamera = 0,
	CustomCamera = 1,
	DeathCamera = 2,
	SettledDeathCamera = 3,
	InvalidViewTarget = 4,
	Count = 5,
	EShooterCharacterCameraState_MAX = 6
};

// Enum ShooterGame.EShooterCharacterDebugCameraMode
enum class EShooterCharacterDebugCameraMode : uint8 {
	None = 0,
	ThirdPersonDebugCamera = 1,
	ThirdPersonDebugCameraWithFirstPersonMesh = 2,
	Count = 3,
	EShooterCharacterDebugCameraMode_MAX = 4
};

// Enum ShooterGame.DebugTeleportMode
enum class DebugTeleportMode : uint8 {
	Nearest = 0,
	NearestFriend = 1,
	NearestEnemy = 2,
	Location = 3,
	DebugTeleportMode_MAX = 4
};

// Enum ShooterGame.EDebugCharacterCapsule
enum class EDebugCharacterCapsule : uint8 {
	None = 0,
	TP_Only = 1,
	TP_And_1P = 2,
	Count = 3,
	EDebugCharacterCapsule_MAX = 4
};

// Enum ShooterGame.EHitRegDiscrepancyType
enum class EHitRegDiscrepancyType : uint8 {
	NoDiscrepancy = 0,
	CharactersHit = 1,
	BonesHit = 2,
	FiringLocation = 3,
	FiringDirection = 4,
	InitialImpactLocation = 5,
	Count = 6,
	Any = 253,
	Invalid = 254,
	EHitRegDiscrepancyType_MAX = 255
};

// Enum ShooterGame.EAresMovementCardinalDirections
enum class EAresMovementCardinalDirections : uint8 {
	Forward = 0,
	Backward = 1,
	Strafe = 2,
	Count = 3,
	EAresMovementCardinalDirections_MAX = 4
};

// Enum ShooterGame.EAresMovementDirections
enum class EAresMovementDirections : uint8 {
	Forward = 0,
	ForwardStrafe = 1,
	Strafe = 2,
	BackwardStrafe = 3,
	Backward = 4,
	None = 5,
	Count = 6,
	EAresMovementDirections_MAX = 7
};

// Enum ShooterGame.EMovementTimingType
enum class EMovementTimingType : uint8 {
	None = 0,
	Move = 1,
	Interpolation = 2,
	ForwardPrediction = 3,
	Count = 4,
	Green = 2,
	EMovementTimingType_MAX = 5
};

// Enum ShooterGame.ENetMoveMode
enum class ENetMoveMode : uint8 {
	PlaybackClientMove = 0,
	ForwardPredict = 1,
	Count = 2,
	ENetMoveMode_MAX = 3
};

// Enum ShooterGame.EDebugMoveHistoryQueues
enum class EDebugMoveHistoryQueues : uint8 {
	None = 0,
	RemoteClients = 1,
	AutonomousOnServer = 2,
	Count = 3,
	EDebugMoveHistoryQueues_MAX = 4
};

// Enum ShooterGame.EDebugVTSHeartbeatQueues
enum class EDebugVTSHeartbeatQueues : uint8 {
	None = 0,
	RemoteClients = 1,
	AutonomousOnServer = 2,
	Count = 3,
	EDebugVTSHeartbeatQueues_MAX = 4
};

// Enum ShooterGame.EAresDamageCategory
enum class EAresDamageCategory : uint8 {
	DamageCategory_Ballistic = 0,
	DamageCategory_Explosive = 1,
	DamageCategory_Fall = 2,
	DamageCategory_Internal = 3,
	DamageCategory_ExternalZone = 4,
	DamageCategory_Invalid = 254,
	EAresDamageCategory_MAX = 255
};

// Enum ShooterGame.EAresDamageIndicationType
enum class EAresDamageIndicationType : uint8 {
	PrioritizeInstigator = 0,
	PrioritizeDamageCauser = 1,
	EAresDamageIndicationType_MAX = 2
};

// Enum ShooterGame.EAresDamageAnimationCategory
enum class EAresDamageAnimationCategory : uint8 {
	DamageAnimation_Normal = 0,
	DamageAnimation_Count = 1,
	DamageAnimation_Invalid = 254,
	EAresDamageAnimationCategory_MAX = 255
};

// Enum ShooterGame.EAresHitIndicatorDisplayType
enum class EAresHitIndicatorDisplayType : uint8 {
	AlwaysShowHitIndicator = 0,
	NeverShowHitIndicator = 1,
	Count = 2,
	EAresHitIndicatorDisplayType_MAX = 3
};

// Enum ShooterGame.EAresHitSoundPlayType
enum class EAresHitSoundPlayType : uint8 {
	AlwaysPlayHitSound = 0,
	NeverPlayHitSound = 1,
	Count = 2,
	EAresHitSoundPlayType_MAX = 3
};

// Enum ShooterGame.EHUDGlobalsScreenType
enum class EHUDGlobalsScreenType : uint8 {
	Count = 0,
	EHUDGlobalsScreenType_MAX = 1
};

// Enum ShooterGame.EUIGlobalsScreenType
enum class EUIGlobalsScreenType : uint8 {
	SettingsScreen = 0,
	ExitGameScreen = 1,
	Count = 2,
	EUIGlobalsScreenType_MAX = 3
};

// Enum ShooterGame.EFrontendUIGlobalsScreenType
enum class EFrontendUIGlobalsScreenType : uint8 {
	MainMenu = 0,
	Pregame = 1,
	Welcome = 2,
	Count = 3,
	EFrontendUIGlobalsScreenType_MAX = 4
};

// Enum ShooterGame.ESpawnPointAllowedInfo
enum class ESpawnPointAllowedInfo : uint8 {
	None = 0,
	Allowed = 1,
	Disabled = 2,
	PendingKill = 3,
	NotAlly = 4,
	IncorrectSpawnSet = 5,
	InvalidPoint = 6,
	BotOrPlayerNotAllowed = 7,
	Count = 8,
	ESpawnPointAllowedInfo_MAX = 9
};

// Enum ShooterGame.EGameModeSublevelKey
enum class EGameModeSublevelKey : uint8 {
	None = 0,
	BombMode = 1,
	ShootingRange = 2,
	Tutorial = 3,
	AltMode1 = 4,
	AltMode2 = 5,
	AltMode3 = 6,
	AltMode4 = 7,
	AltMode5 = 8,
	AltMode6 = 9,
	AltMode7 = 10,
	AltMode8 = 11,
	AltMode9 = 12,
	AltMode10 = 13,
	AltMode11 = 14,
	AltMode12 = 15,
	AltMode13 = 16,
	AltMode14 = 17,
	AltMode15 = 18,
	DynamicSpawnPoints = 19,
	TeamSpawnPoints = 20,
	StandardGeoAndLighting = 21,
	Snowball = 22,
	BotsEnabled = 23,
	Count = 24,
	EGameModeSublevelKey_MAX = 25
};

// Enum ShooterGame.EBlockedSpawnPointBehavior
enum class EBlockedSpawnPointBehavior : uint8 {
	Discard = 0,
	Include = 1,
	AddToListEnd = 2,
	EBlockedSpawnPointBehavior_MAX = 3
};

// Enum ShooterGame.ECharacterColorationScheme
enum class ECharacterColorationScheme : uint8 {
	CharacterColors_TeamRelative = 0,
	CharacterColors_TeamAbsolute = 1,
	CharacterColors_AlwaysRedEnemy = 2,
	CharacterColors_AlwaysBlueAlly = 3,
	CharacterColors_COUNT = 4,
	CharacterColors_MAX = 5
};

// Enum ShooterGame.EShooterHUDWidgetCategory
enum class EShooterHUDWidgetCategory : uint8 {
	AbilityBar = 0,
	AbilitySpecificUI = 1,
	AbilityUpperKeybinds = 2,
	AbilityLowerKeybinds = 3,
	Health = 4,
	Ammo = 5,
	StatusEffects = 6,
	Minimap = 7,
	Announcements = 8,
	KillFeed = 9,
	KillBanners = 10,
	TopBar = 11,
	RoundTimer = 12,
	Econ = 13,
	WeaponInventory = 14,
	Chat = 15,
	UsablePrompts = 16,
	ClientInfo = 17,
	Spectator = 18,
	InWorldCharacterInfo = 19,
	CombatReport = 20,
	Pings = 21,
	StanceIndicator = 22,
	Replays = 23,
	UsableIcons = 24,
	UsableHighlights = 25,
	WeaponGlow = 26,
	All = 27,
	Count = 28,
	None = 29,
	EShooterHUDWidgetCategory_MAX = 30
};

// Enum ShooterGame.EDebugMessagePosition
enum class EDebugMessagePosition : uint8 {
	TopLeft = 0,
	TopRight = 1,
	BottomLeft = 2,
	MiddleRight = 3,
	Default = 0,
	EDebugMessagePosition_MAX = 4
};

// Enum ShooterGame.EDebugMessageOptionFlags
enum class EDebugMessageOptionFlags : uint8 {
	None = 0,
	ReliableSend = 1,
	WriteToLog = 2,
	EDebugMessageOptionFlags_MAX = 3
};

// Enum ShooterGame.EIconJustification
enum class EIconJustification : uint8 {
	TopLeft = 0,
	Centered = 1,
	EIconJustification_MAX = 2
};

// Enum ShooterGame.EDebugSubscription
enum class EDebugSubscription : uint8 {
	ServerActorTickTime = 0,
	ServerClassTickTime = 1,
	ReplicationOverview = 2,
	ReplicatingItems = 3,
	ServerSkeletalMeshTickTime = 4,
	ServerObjects = 5,
	PendingKillServerObjects = 6,
	ServerClassTickCounts = 7,
	ServerMemory = 8,
	ServerNetworkStats = 9,
	ForceNetUpdateOverview = 10,
	ReplicationTime = 11,
	StatSubsystems = 12,
	Count = 13,
	EDebugSubscription_MAX = 14
};

// Enum ShooterGame.EPlayerDisconnectReason
enum class EPlayerDisconnectReason : uint8 {
	Unknown = 0,
	ManualQuit = 1,
	WindowClosed = 2,
	PlatformFault = 3,
	NetworkFailure = 4,
	ClientCrash = 5,
	Count = 6,
	EPlayerDisconnectReason_MAX = 7
};

// Enum ShooterGame.EReconnectTelemetryType
enum class EReconnectTelemetryType : uint8 {
	Basic = 0,
	NetworkFailure = 1,
	ClientCrash = 2,
	Count = 3,
	EReconnectTelemetryType_MAX = 4
};

// Enum ShooterGame.EVisualizeSurfacesFilter
enum class EVisualizeSurfacesFilter : uint8 {
	Weapon = 0,
	Player = 1,
	EVisualizeSurfacesFilter_MAX = 2
};

// Enum ShooterGame.EGamepadWeaponSwapMode
enum class EGamepadWeaponSwapMode : uint8 {
	PressToCycle = 0,
	TapForSecondary = 1,
	TapForMelee = 2,
	EGamepadWeaponSwapMode_MAX = 3
};

// Enum ShooterGame.EGamepadHoldInputMode
enum class EGamepadHoldInputMode : uint8 {
	SwapHeldWeapon = 0,
	DropHeldWeapon = 1,
	ShopHeldOpen = 2,
	UseHeld = 3,
	MapHeld = 4,
	SprayHeld = 5,
	EGamepadHoldInputMode_MAX = 6
};

// Enum ShooterGame.EReflexLowLatencyMode
enum class EReflexLowLatencyMode : uint8 {
	Off = 0,
	Enabled = 1,
	Boost = 3,
	EReflexLowLatencyMode_MAX = 4
};

// Enum ShooterGame.ESpawnRestriction
enum class ESpawnRestriction : uint8 {
	None = 0,
	PlayerOnly = 1,
	NonPlayerBotOnly = 2,
	ESpawnRestriction_MAX = 3
};

// Enum ShooterGame.EAresImpactEffectHitspace
enum class EAresImpactEffectHitspace : uint8 {
	ShooterPerspective = 0,
	VictimPerspective = 1,
	ThirdPersonPerspective = 2,
	NUM_HITSPACES = 3,
	EAresImpactEffectHitspace_MAX = 4
};

// Enum ShooterGame.EAresParamType
enum class EAresParamType : uint8 {
	Scalar = 0,
	Vector = 1,
	Attachments = 2,
	Count = 3,
	Invalid = 254,
	EAresParamType_MAX = 255
};

// Enum ShooterGame.EAresRoundOutcome
enum class EAresRoundOutcome : uint8 {
	Elimination = 0,
	Defuse = 1,
	Detonate = 2,
	TimeExpired = 3,
	Cheat = 4,
	Surrendered = 5,
	RoundOutcome_Count = 6,
	Invalid = 7,
	EAresRoundOutcome_MAX = 8
};

// Enum ShooterGame.EAresOrientation
enum class EAresOrientation : uint8 {
	AresOrientation_Front = 0,
	AresOrientation_Back = 1,
	AresOrientation_Left = 2,
	AresOrientation_Right = 3,
	AresOrientation_Count = 4,
	AresOrientation_Invalid = 254,
	AresOrientation_MAX = 255
};

// Enum ShooterGame.EAresTeamRoundResult
enum class EAresTeamRoundResult : uint8 {
	Win = 0,
	Loss = 1,
	Tie = 2,
	EAresTeamRoundResult_MAX = 3
};

// Enum ShooterGame.ERoundKills
enum class ERoundKills : uint8 {
	None = 0,
	Single = 1,
	Double = 2,
	Triple = 3,
	Quadra = 4,
	Penta = 5,
	Overkill = 6,
	Count = 7,
	ERoundKills_MAX = 8
};

// Enum ShooterGame.EAresProgressionType
enum class EAresProgressionType : uint8 {
	Money = 0,
	XP = 1,
	Energy = 2,
	Count = 3,
	EAresProgressionType_MAX = 4
};

// Enum ShooterGame.EAresTeamTargeting
enum class EAresTeamTargeting : uint8 {
	TeamTargeting_ApplyToEveryone = 0,
	TeamTargeting_ApplyToFriends = 1,
	TeamTargeting_ApplyToEnemies = 2,
	TeamTargeting_ApplyToSelfAndEnemies = 3,
	TeamTargeting_ApplyToNoone = 4,
	TeamTargeting_Count = 5,
	TeamTargeting_MAX = 6
};

// Enum ShooterGame.EAresBombStates
enum class EAresBombStates : uint8 {
	AresBombState_NotSpawned = 0,
	AresBombState_Spawned = 1,
	AresBombState_OnGround = 2,
	AresBombState_InHands = 3,
	AresBombState_Planted = 4,
	AresBombState_Exploded = 5,
	AresBombState_Defused = 6,
	AresBombState_Count = 7,
	AresBombState_MAX = 8
};

// Enum ShooterGame.EMegamapCalloutsVisibility
enum class EMegamapCalloutsVisibility : uint8 {
	NeverVisible = 0,
	VisibleInPreRound = 1,
	AlwaysVisible = 2,
	Count = 3,
	EMegamapCalloutsVisibility_MAX = 4
};

// Enum ShooterGame.CharacterRange
enum class CharacterRange : uint8 {
	None = 0,
	Short = 1,
	Medium = 2,
	Long = 3,
	Count = 4,
	CharacterRange_MAX = 5
};

// Enum ShooterGame.EAresBodySection
enum class EAresBodySection : uint8 {
	BodySection_Torso = 0,
	BodySection_Head = 1,
	BodySection_LeftArm = 2,
	BodySection_LowerLeftArm = 3,
	BodySection_RightArm = 4,
	BodySection_LowerRightArm = 5,
	BodySection_LeftLeg = 6,
	BodySection_RightLeg = 7,
	BodySection_Count = 8,
	BodySection_Invalid = 254,
	EAresBodySection_MAX = 255
};

// Enum ShooterGame.EAresCoordinateSpace
enum class EAresCoordinateSpace : uint8 {
	WorldSpace = 0,
	PlayerSpace = 1,
	EAresCoordinateSpace_MAX = 2
};

// Enum ShooterGame.EAresEquippableAfterUseType
enum class EAresEquippableAfterUseType : uint8 {
	DoNothing = 0,
	EquipFirstWeapon = 1,
	EquipLastEquippedWeapon = 2,
	Count = 3,
	EAresEquippableAfterUseType_MAX = 4
};

// Enum ShooterGame.EAresInterpolationFunction
enum class EAresInterpolationFunction : uint8 {
	Linear = 0,
	Logarithmic = 1,
	EaseIn = 2,
	EaseOut = 3,
	EaseInEaseOut = 4,
	EAresInterpolationFunction_MAX = 5
};

// Enum ShooterGame.EAresAutomationInput
enum class EAresAutomationInput : uint8 {
	PrimaryTrigger = 0,
	SecondaryTrigger = 1,
	Reload = 2,
	ZoomToggle = 3,
	FirstEquipInput = 4,
	EquipPrimary = 4,
	EquipSecondary = 5,
	EquipMelee = 6,
	EquipGrenade = 7,
	EquipQ = 8,
	EquipE = 9,
	EquipUltimate = 10,
	EquipTotem = 11,
	LastEquipInput = 11,
	Count = 12,
	EAresAutomationInput_MAX = 13
};

// Enum ShooterGame.EAresSurfaceType
enum class EAresSurfaceType : uint8 {
	Default = 0,
	Concrete = 1,
	Dirt = 2,
	Gravel = 3,
	Water = 4,
	Metal = 5,
	Wood = 6,
	Grass = 7,
	Glass = 8,
	Flesh = 9,
	Snow = 10,
	MetalThin = 11,
	BrokenGlass = 12,
	Impenetrable = 13,
	Linoleum = 14,
	BubbleCage = 15,
	MetalNonResonant = 16,
	CarpetOnWood = 17,
	MetalPipe = 18,
	ConcretePuddle = 19,
	GarbageBag = 20,
	Thorns = 21,
	Sand = 22,
	Mud = 23,
	Tree = 24,
	Ice = 25,
	ShootinRangeTarget = 26,
	Cloth = 27,
	CobbleStone = 28,
	CeramicTile = 29,
	CarpetOnConcrete = 30,
	EtherGlass = 31,
	CosmicFabric = 32,
	GoldenRipple = 33,
	PlasticHollow = 34,
	Shield = 35,
	Count = 36,
	EAresSurfaceType_MAX = 37
};

// Enum ShooterGame.EAresHitImpactParticleOrientation
enum class EAresHitImpactParticleOrientation : uint8 {
	Direction = 0,
	ReverseDirection = 1,
	Normal = 2,
	None = 3,
	Count = 4,
	EAresHitImpactParticleOrientation_MAX = 5
};

// Enum ShooterGame.EDecalFadeType
enum class EDecalFadeType : uint8 {
	FadeOutAfterDisplayDuration = 0,
	FadeOutAtEndOfRound = 1,
	Count = 2,
	EDecalFadeType_MAX = 3
};

// Enum ShooterGame.EAresPlayerIntentionType
enum class EAresPlayerIntentionType : uint8 {
	Rush = 0,
	Sneak = 1,
	Hold = 2,
	Distract = 3,
	Count = 4,
	EAresPlayerIntentionType_MAX = 5
};

// Enum ShooterGame.EAresGameReward
enum class EAresGameReward : uint8 {
	Experience_Deprecated = 0,
	Money = 1,
	Energy = 2,
	Health = 3,
	SignatureAbilityPoints = 4,
	UltimatePoints = 5,
	AbilityCharges = 6,
	Gear = 7,
	Experience = 8,
	NUM_REWARDS = 9,
	EAresGameReward_MAX = 10
};

// Enum ShooterGame.EAresRewardShouldIncrementInstances
enum class EAresRewardShouldIncrementInstances : uint8 {
	IncrementInstances = 0,
	DontIncrementInstances = 1,
	Count = 2,
	EAresRewardShouldIncrementInstances_MAX = 3
};

// Enum ShooterGame.EAresSearchVisibilityType
enum class EAresSearchVisibilityType : uint8 {
	FindInvisibleUnits = 0,
	DontFindInvisibleUnits = 1,
	Count = 2,
	EAresSearchVisibilityType_MAX = 3
};

// Enum ShooterGame.EEnemyVisibilityOption
enum class EEnemyVisibilityOption : uint8 {
	Always = 0,
	Never = 1,
	LineOfSight = 2,
	Count = 3,
	EEnemyVisibilityOption_MAX = 4
};

// Enum ShooterGame.EUsablePriority
enum class EUsablePriority : uint8 {
	Cosmetic = 0,
	Door = 1,
	ItemPickup = 2,
	Default = 3,
	High = 4,
	Critical = 5,
	EUsablePriority_MAX = 6
};

// Enum ShooterGame.ECharacterSelectAnimationState
enum class ECharacterSelectAnimationState : uint8 {
	CharacterSelectAnimationState_Selected = 0,
	CharacterSelectAnimationState_LockedIn = 1,
	CharacterSelectAnimationState_Idle = 2,
	CharacterSelectAnimationState_BackgroundSelected = 3,
	CharacterSelectAnimationState_BackgroundLockedIn = 4,
	CharacterSelectAnimationState_GameStarting = 5,
	CharacterSelectAnimationState_BackgroundGameStarting = 6,
	CharacterSelectAnimationState_Count = 7,
	CharacterSelectAnimationState_MAX = 8
};

// Enum ShooterGame.EEquippableAnimationCategory
enum class EEquippableAnimationCategory : uint8 {
	EquippableAnimationCategory_Pistol = 0,
	EquippableAnimationCategory_AssaultRifle = 1,
	EquippableAnimationCategory_Shotgun = 2,
	EquippableAnimationCategory_SniperRifle = 3,
	EquippableAnimationCategory_SubmachineGun = 4,
	EquippableAnimationCategory_LightMachineGun = 5,
	EquippableAnimationCategory_Grenade = 6,
	EquippableAnimationCategory_Shield = 7,
	EquippableAnimationCategory_Bomb = 8,
	EquippableAnimationCategory_Melee = 9,
	EquippableAnimationCategory_Bandage = 10,
	EquippableAnimationCategory_AbilityQ = 11,
	EquippableAnimationCategory_AbilityE = 12,
	EquippableAnimationCategory_AbilityGrenade = 13,
	EquippableAnimationCategory_AbilityUltimate = 14,
	EquippableAnimationCategory_WeaponTypeTest1 = 15,
	EquippableAnimationCategory_WeaponTest2 = 16,
	EquippableAnimationCategory_AbilityTest1 = 17,
	EquippableAnimationCategory_AbilityTest2 = 18,
	EquippableAnimationCategory_Drone_Object = 19,
	EquippableAnimationCategory_Drone_Remote = 20,
	EquippableAnimationCategory_Count = 21,
	EquippableAnimationCategory_MAX = 22
};

// Enum ShooterGame.EUIChannel
enum class EUIChannel : uint8 {
	GameDriven = 0,
	UserDriven = 1,
	Chat = 2,
	Count = 3,
	Invalid = 254,
	EUIChannel_MAX = 255
};

// Enum ShooterGame.EUIScreen
enum class EUIScreen : uint8 {
	LoginUI = 0,
	Chat = 1,
	MapTargetting = 2,
	Count = 3,
	EUIScreen_MAX = 4
};

// Enum ShooterGame.EAllowedGameInputBlueprintBitMask
enum class EAllowedGameInputBlueprintBitMask : uint8 {
	Movement = 0,
	Aiming = 1,
	ItemUsing = 2,
	Abilities = 3,
	WorldUsing = 4,
	EAllowedGameInputBlueprintBitMask_MAX = 5
};

// Enum ShooterGame.EIsRefundable
enum class EIsRefundable : uint8 {
	Yes = 0,
	No = 1,
	EIsRefundable_MAX = 2
};

// Enum ShooterGame.EAresDisplayMode
enum class EAresDisplayMode : uint8 {
	Fullscreen = 0,
	WindowedFullscreen = 1,
	Windowed = 2,
	Count = 3,
	EAresDisplayMode_MAX = 4
};

// Enum ShooterGame.EAresColorBlindMode
enum class EAresColorBlindMode : uint8 {
	Disabled = 0,
	Tritanopia = 1,
	Deuteranopia = 2,
	Protanopia = 3,
	Count = 4,
	EAresColorBlindMode_MAX = 5
};

// Enum ShooterGame.EPersistInventoryMode
enum class EPersistInventoryMode : uint8 {
	PersistRoundPersistentPurchasables = 0,
	PersistAllPurchasables = 1,
	PersistInventoryMode_Count = 2,
	EPersistInventoryMode_MAX = 3
};

// Enum ShooterGame.EMinimapVisibleReason
enum class EMinimapVisibleReason : uint8 {
	ObserverToggle = 0,
	Megamap = 1,
	MapTargetting = 2,
	Count = 3,
	EMinimapVisibleReason_MAX = 4
};

// Enum ShooterGame.EShopScreenInitOption
enum class EShopScreenInitOption : uint8 {
	Menu = 0,
	Popup = 1,
	Count = 2,
	EShopScreenInitOption_MAX = 3
};

// Enum ShooterGame.ESideScreenCloseButtonType
enum class ESideScreenCloseButtonType : uint8 {
	CornerButton = 0,
	BottomButton = 1,
	ESideScreenCloseButtonType_MAX = 2
};

// Enum ShooterGame.EProjectileMoveState
enum class EProjectileMoveState : uint8 {
	Moving = 0,
	Stopped = 1,
	Count = 2,
	EProjectileMoveState_MAX = 3
};

// Enum ShooterGame.ESkinUpgradeState
enum class ESkinUpgradeState : uint8 {
	SUS_NEVER_UPGRADEABLE = 0,
	SUS_SKIN_NOT_OWNED = 1,
	SUS_FULLY_UPGRADED = 2,
	SUS_UPGRADE_NOT_AFFORDABLE = 3,
	SUS_UPGRADE_AVAILABLE = 4,
	SUS_UPGRADE_UNLOCKED = 5,
	SUS_UPGRADE_REQUIREMENTS_NOT_MET = 6,
	SUS_VARIANT_AVAILABLE = 7,
	SUS_VARIANT_UNLOCKED = 8,
	SUS_VARIANT_REQUIREMENTS_NOT_MET = 9,
	SUS_SELECT_VARIANT = 10,
	SUS_VARIANT_NOT_AFFORDABLE = 11,
	SUS_DISABLED = 12,
	SUS_NONE = 13,
	SUS_MAX = 14
};

// Enum ShooterGame.ESniperCrosshairMaterialType
enum class ESniperCrosshairMaterialType : uint8 {
	Static = 0,
	CenterDot = 1,
	ESniperCrosshairMaterialType_MAX = 2
};

// Enum ShooterGame.ESocialContainerButtonMouseTarget
enum class ESocialContainerButtonMouseTarget : uint8 {
	ContainerButton = 0,
	ChildContent = 1,
	ESocialContainerButtonMouseTarget_MAX = 2
};

// Enum ShooterGame.EAresIdentityDisplay
enum class EAresIdentityDisplay : uint8 {
	Default = 0,
	Alternative1 = 1,
	Alternative2 = 2,
	Alternative3 = 3,
	Alternative4 = 4,
	Alternative_P = 5,
	EAresIdentityDisplay_MAX = 6
};

// Enum ShooterGame.EAresFriendshipMatch
enum class EAresFriendshipMatch : uint8 {
	NoMatch = 0,
	PartialMatch = 1,
	ExactMatch = 2,
	EAresFriendshipMatch_MAX = 3
};

// Enum ShooterGame.EAresSocialTriggerMode
enum class EAresSocialTriggerMode : uint8 {
	Friend = 0,
	Party = 1,
	EAresSocialTriggerMode_MAX = 2
};

// Enum ShooterGame.EAresSocialPartyMessageResponse
enum class EAresSocialPartyMessageResponse : uint8 {
	None = 0,
	Accept = 1,
	Decline = 2,
	EAresSocialPartyMessageResponse_MAX = 3
};

// Enum ShooterGame.EAresSocialRosterInviteResponse
enum class EAresSocialRosterInviteResponse : uint8 {
	None = 0,
	Accept = 1,
	Decline = 2,
	EAresSocialRosterInviteResponse_MAX = 3
};

// Enum ShooterGame.EAresSocialPartyErrorSource
enum class EAresSocialPartyErrorSource : uint8 {
	General = 0,
	InviteToParty = 1,
	RequestToJoinParty = 2,
	JoinParty = 3,
	EAresSocialPartyErrorSource_MAX = 4
};

// Enum ShooterGame.ESocialIntegrationPlatform
enum class ESocialIntegrationPlatform : uint8 {
	Invalid = 0,
	QQ = 1,
	Count = 2,
	ESocialIntegrationPlatform_MAX = 3
};

// Enum ShooterGame.ESocialPanelTabBarOrientation
enum class ESocialPanelTabBarOrientation : uint8 {
	Horizontal = 0,
	Vertical = 1,
	ESocialPanelTabBarOrientation_MAX = 2
};

// Enum ShooterGame.ESocialPanelPartyListCategory
enum class ESocialPanelPartyListCategory : uint8 {
	LocalPlayerParty = 0,
	InValSamePlatform = 1,
	ESocialPanelPartyListCategory_MAX = 2
};

// Enum ShooterGame.ESocialPanelPlayerSecondaryDetail
enum class ESocialPanelPlayerSecondaryDetail : uint8 {
	None = 0,
	EditFriendNote = 1,
	PartyDetails = 2,
	ESocialPanelPlayerSecondaryDetail_MAX = 3
};

// Enum ShooterGame.ESocialPanelPlayerListPresenceCategory
enum class ESocialPanelPlayerListPresenceCategory : uint8 {
	OnlineValSamePlatform = 0,
	OnlineOtherGame = 1,
	OnlineNoProduct = 2,
	Offline = 3,
	ESocialPanelPlayerListPresenceCategory_MAX = 4
};

// Enum ShooterGame.ESocialPanelCategory
enum class ESocialPanelCategory : uint8 {
	Invalid = 0,
	Online = 1,
	Offline = 2,
	Favorite = 3,
	OtherGame = 4,
	Count = 5,
	ESocialPanelCategory_MAX = 6
};

// Enum ShooterGame.EAresSocialPlayerCategory
enum class EAresSocialPlayerCategory : uint8 {
	Invalid = 0,
	OnlineInParty = 1,
	OnlineInOtherGame = 2,
	Offline = 3,
	Temp_P = 4,
	Hidden = 5,
	Count = 6,
	EAresSocialPlayerCategory_MAX = 7
};

// Enum ShooterGame.ESocialViewControllerUpdatePolicy
enum class ESocialViewControllerUpdatePolicy : uint8 {
	Unlimited = 0,
	Scheduled = 1,
	Never = 2,
	ESocialViewControllerUpdatePolicy_MAX = 3
};

// Enum ShooterGame.ESplineMovementSpeedUnit
enum class ESplineMovementSpeedUnit : uint8 {
	WorldUnitsPerSecond = 0,
	SplineInputKeysPerSecond = 1,
	Count = 2,
	ESplineMovementSpeedUnit_MAX = 3
};

// Enum ShooterGame.ESplitBodyRotationState
enum class ESplitBodyRotationState : uint8 {
	Inactive = 0,
	RotatingUpperBody = 1,
	RecenteringLowerBody = 2,
	SpecialTurnState = 3,
	BlendingOut = 4,
	ESplitBodyRotationState_MAX = 5
};

// Enum ShooterGame.EAresSprayCategory
enum class EAresSprayCategory : uint8 {
	Default = 0,
	Contextual = 1,
	EAresSprayCategory_MAX = 2
};

// Enum ShooterGame.EAresStabilityType
enum class EAresStabilityType : uint8 {
	Walking = 0,
	Running = 1,
	Jumping = 2,
	Crouching = 3,
	OnAscender = 4,
	Flying = 5,
	Count = 6,
	Invalid = 254,
	EAresStabilityType_MAX = 255
};

// Enum ShooterGame.EStabilityInterpolationType
enum class EStabilityInterpolationType : uint8 {
	Linear = 0,
	QuadraticEaseIn = 1,
	QuadraticEaseOut = 2,
	QuadraticEaseInEaseOut = 3,
	Count = 4,
	EStabilityInterpolationType_MAX = 5
};

// Enum ShooterGame.EStabilityInterpolationVariable
enum class EStabilityInterpolationVariable : uint8 {
	StabilityIndex = 0,
	Error = 1,
	PitchRecoil = 2,
	YawRecoil = 3,
	AccruedSwitchChance = 4,
	Count = 5,
	EStabilityInterpolationVariable_MAX = 6
};

// Enum ShooterGame.EDecayBehaviorBelowDesired
enum class EDecayBehaviorBelowDesired : uint8 {
	MatchDesired = 0,
	StayAtCurrent = 1,
	Decay = 2,
	Count = 3,
	EDecayBehaviorBelowDesired_MAX = 4
};

// Enum ShooterGame.EYawChangeDirection
enum class EYawChangeDirection : uint8 {
	Left = 0,
	Right = 1,
	Neutral = 2,
	Count = 3,
	EYawChangeDirection_MAX = 4
};

// Enum ShooterGame.EStabilityType
enum class EStabilityType : uint8 {
	Error = 0,
	PitchRecoil = 1,
	YawRecoil = 2,
	Count = 3,
	EStabilityType_MAX = 4
};

// Enum ShooterGame.EStateContext
enum class EStateContext : uint8 {
	None = 0,
	TriggeringState = 1,
	OwningEquippable = 2,
	OwningCharacter = 3,
	CustomContext = 4,
	Count = 5,
	EStateContext_MAX = 6
};

// Enum ShooterGame.EMovementSync
enum class EMovementSync : uint8 {
	None = 0,
	Start = 1,
	Stop = 2,
	StartAndStop = 3,
	Count = 4,
	EMovementSync_MAX = 5
};

// Enum ShooterGame.EStateMachineTransitionReason
enum class EStateMachineTransitionReason : uint8 {
	NormalTransition = 0,
	ServerCorrect = 1,
	EStateMachineTransitionReason_MAX = 2
};

// Enum ShooterGame.EStateMachineDebugEntryMatchState
enum class EStateMachineDebugEntryMatchState : uint8 {
	Unconfirmed = 0,
	HasMatch = 1,
	NoMatch = 2,
	EStateMachineDebugEntryMatchState_MAX = 3
};

// Enum ShooterGame.EStorePurchaseFlowConfigType
enum class EStorePurchaseFlowConfigType : uint8 {
	PURCHASE_FLOW_CONFIG_UNKNOWN = 0,
	PURCHASE_FLOW_CONFIG_ALL = 1,
	PURCHASE_FLOW_CONFIG_ROTATING_STORE = 2,
	PURCHASE_FLOW_CONFIG_FEATURED_BUNDLE = 3,
	PURCHASE_FLOW_CONFIG_ESPORTS_STORE = 4,
	PURCHASE_FLOW_CONFIG_BATTLEPASS = 5,
	PURCHASE_FLOW_CONFIG_BONUS_STORE = 6,
	PURCHASE_FLOW_CONFIG_ACCESSORY_STORE = 7,
	PURCHASE_FLOW_CONFIG_SKIN_UPGRADES = 8,
	PURCHASE_FLOW_CONFIG_AGENTS = 9,
	PURCHASE_FLOW_CONFIG_VP = 10,
	PURCHASE_FLOW_CONFIG_RADP = 11,
	PURCHASE_FLOW_CONFIG_MAX = 12
};

// Enum ShooterGame.EStoreAnimationType
enum class EStoreAnimationType : uint8 {
	STORE_ANIMATION_NONE = 0,
	STORE_ANIMATION_PURCHASE_COMPLETE_GENERIC = 1,
	STORE_ANIMATION_GIFT_ACCEPT = 2,
	STORE_ANIMATION_GIFT_SENT = 3,
	STORE_ANIMATION_MAX = 4
};

// Enum ShooterGame.ECAPOrderStatus
enum class ECAPOrderStatus : uint8 {
	UNKNOWN = 0,
	FAILED = 1,
	REFUNDED = 2,
	ROLLED_BACK = 3,
	FULFILLMENT_FAILED = 4,
	PAYMENT_FAILED = 5,
	ACCEPTED = 6,
	VALIDATED = 7,
	PAYMENT_SUCCESSFUL = 8,
	FULFILLMENT_SUCCESSFUL = 9,
	POST_PROCESS_ACTIONS_COMPLETE = 10,
	COMPLETE = 11,
	MERCHANT_PROCESSING_COMPLETE = 12,
	COUNT = 13,
	ECAPOrderStatus_MAX = 14
};

// Enum ShooterGame.ECAPCatalogOrderState
enum class ECAPCatalogOrderState : uint8 {
	UNKNOWN = 0,
	CREATED = 1,
	PURCHASER_COMPLETE = 2,
	PURCHASER_FAILED = 3,
	ECAPCatalogOrderState_MAX = 4
};

// Enum ShooterGame.EEligibleForJuiceOverrideStatus
enum class EEligibleForJuiceOverrideStatus : uint8 {
	NOT_OVERRIDEN = 0,
	ELIGIBLE = 1,
	NOT_ELIGIBLE = 2,
	EEligibleForJuiceOverrideStatus_MAX = 3
};

// Enum ShooterGame.EOfferDTOType
enum class EOfferDTOType : uint8 {
	NONE = 0,
	CONTRACT_UPGRADE = 1,
	CONTRACT_LEVEL = 2,
	ROTATING_ITEM = 3,
	ITEM_LEVEL = 4,
	ITEM_SIDEGRADE = 5,
	BUNDLE = 6,
	BUNDLE_ITEM = 7,
	AGENT = 8,
	BONUS_STORE = 9,
	ACCESSORY_STORE = 10,
	UPGRADE_CURRENCY = 11,
	PLATFORM = 12,
	AGENT_CONTRACT_LEVEL = 13,
	VIRTUAL_CURRENCY = 14,
	COUNT = 15,
	EOfferDTOType_MAX = 16
};

// Enum ShooterGame.EPluginStorefrontType
enum class EPluginStorefrontType : uint8 {
	NONE = 0,
	ESPORTS_STOREFRONT = 1,
	EPluginStorefrontType_MAX = 2
};

// Enum ShooterGame.EStorefrontType
enum class EStorefrontType : uint8 {
	UNKNOWN = 0,
	AGENT = 1,
	ESPORTS = 2,
	ACCESSORY = 3,
	FEATURED = 4,
	BONUS = 5,
	EStorefrontType_MAX = 6
};

// Enum ShooterGame.EJuiceOrderRequestType
enum class EJuiceOrderRequestType : uint8 {
	INVALID = 0,
	CRAFT_ITEM = 1,
	CRAFT_PROGRESSION = 2,
	CRAFT_VARIANT = 3,
	COUNT = 4,
	EJuiceOrderRequestType_MAX = 5
};

// Enum ShooterGame.GiftingMailboxMessageType
enum class GiftingMailboxMessageType : uint8 {
	UNKNOWN = 0,
	PENDING_GIFT = 1,
	GIFT_SENT_ACCEPTED = 2,
	GIFT_SENT_REJECTED = 3,
	VC_GIFT_RECEIVED = 4,
	GiftingMailboxMessageType_MAX = 5
};

// Enum ShooterGame.GiftState
enum class GiftState : uint8 {
	GIFTSTATE_INVALID = 0,
	GIFTSTATE_CREATED = 1,
	GIFTSTATE_PURCHASER_COMPLETE = 2,
	GIFTSTATE_PURCHASER_FAILED = 3,
	GIFTSTATE_SEND_FAILED = 4,
	GIFTSTATE_ACCEPT_STARTED = 5,
	GIFTSTATE_ACCEPT_FAILED = 6,
	GIFTSTATE_ACCEPT_COMPLETE = 7,
	GIFTSTATE_DECLINE_STARTED = 8,
	GIFTSTATE_DECLINE_FAILED = 9,
	GIFTSTATE_DECLINE_COMPLETE = 10,
	GIFTSTATE_EXPIRE_STARTED = 11,
	GIFTSTATE_EXPIRE_COMPLETE = 12,
	GIFTSTATE_MAX = 13
};

// Enum ShooterGame.EGiftingInvalidReason
enum class EGiftingInvalidReason : uint8 {
	GIFTING_INVALID_REASON_OTHER = 0,
	GIFTING_INVALID_REASON_NOT_FRIENDS = 1,
	GIFTING_INVALID_REASON_FRIEND_DURATION = 2,
	GIFTING_INVALID_REASON_IDENTITY_VERIFICATION_REQUIRED = 3,
	GIFTING_INVALID_REASON_VELOCITY_LIMIT_EXCEEDED = 4,
	GIFTING_INVALID_REASON_PLAYER_BEHAVIOR_RESTRICTED = 5,
	GIFTING_INVALID_REASON_PLAYER_AFFINITY_MISSING = 6,
	GIFTING_INVALID_REASON_INSUFFICIENT_ACCOUNT_LEVEL = 7,
	COUNT = 8,
	EGiftingInvalidReason_MAX = 9
};

// Enum ShooterGame.EOfferType
enum class EOfferType : uint8 {
	Unknown = 0,
	RotatingStore = 1,
	FeaturedStandalone = 2,
	FeaturedBundle = 3,
	NightMarket = 4,
	Juice = 5,
	Accessory = 6,
	AgentStore = 7,
	ContractLevel = 8,
	ContractUpgrade = 9,
	ItemLevel = 10,
	ItemSidegrade = 11,
	UpgradeCurrency = 12,
	Count = 13,
	EOfferType_MAX = 14
};

// Enum ShooterGame.EEventType
enum class EEventType : uint8 {
	AcknowledgeTerms = 0,
	EquipItem = 1,
	FavoriteItem = 2,
	InspectItem = 3,
	InspectModelViewer = 4,
	InspectItemLevels = 5,
	InspectItemChroma = 6,
	LearnMore = 7,
	PriceBreakdown = 8,
	PurchaseGift = 9,
	PurchaseStart = 10,
	PurchaseConfirm = 11,
	PurchaseCancel = 12,
	PurchaseComplete = 13,
	RefundPolicy = 14,
	RevealOffer = 15,
	SelectPurchaseCurrencyType = 16,
	Count = 17,
	EEventType_MAX = 18
};

// Enum ShooterGame.ESpecialItemStatus
enum class ESpecialItemStatus : uint8 {
	DEFAULT = 0,
	PROMO = 1,
	COUNT = 2,
	ESpecialItemStatus_MAX = 3
};

// Enum ShooterGame.EStreamedVideoQuality
enum class EStreamedVideoQuality : uint8 {
	Default = 0,
	High = 1,
	Invalid = 2,
	Count = 3,
	EStreamedVideoQuality_MAX = 4
};

// Enum ShooterGame.ESubDataBlueprintLibrary_CastResult
enum class ESubDataBlueprintLibrary_CastResult : uint8 {
	Then = 0,
	Failed = 1,
	ESubDataBlueprintLibrary_MAX = 2
};

// Enum ShooterGame.EXPBoostType
enum class EXPBoostType : uint8 {
	Invalid = 0,
	BaseOnly = 1,
	BaseAndMission = 2,
	Count = 3,
	EXPBoostType_MAX = 4
};

// Enum ShooterGame.ESubscriptionRewardType
enum class ESubscriptionRewardType : uint8 {
	Invalid = 0,
	XpBoost = 1,
	Agent = 2,
	WeaponSkin = 3,
	GunBuddy = 4,
	Spray = 5,
	PlayerCard = 6,
	PlayerTitle = 7,
	Count = 8,
	ESubscriptionRewardType_MAX = 9
};

// Enum ShooterGame.EQueuedMessageType
enum class EQueuedMessageType : uint8 {
	Event = 0,
	Log = 1,
	Metric = 2,
	EQueuedMessageType_MAX = 3
};

// Enum ShooterGame.ETelemetryContextualPostFlags
enum class ETelemetryContextualPostFlags : int32 {
	Empty = 0,
	Default = 2,
	GSLT = 4,
	ReplayPlayback = 8,
	Always = 4294967295,
	ETelemetryContextualPostFlags_MAX = 4294967296
};

// Enum ShooterGame.ETestViewModelEnum
enum class ETestViewModelEnum : uint8 {
	None = 0,
	Test = 1,
	COUNT = 2,
	ETestViewModelEnum_MAX = 3
};

// Enum ShooterGame.ETextChatInitializationState
enum class ETextChatInitializationState : uint8 {
	NotInitialized = 0,
	PendingSession = 1,
	Ready = 2,
	Failed = 3,
	ETextChatInitializationState_MAX = 4
};

// Enum ShooterGame.ETextChatRoomConnectionState
enum class ETextChatRoomConnectionState : uint8 {
	ShouldConnect = 0,
	Connecting = 1,
	Connected = 2,
	NotConnecting = 3,
	ETextChatRoomConnectionState_MAX = 4
};

// Enum ShooterGame.EThematicCategory
enum class EThematicCategory : uint8 {
	None = 0,
	Alien = 1,
	Artistic = 2,
	Clean = 3,
	Cultural = 4,
	Edgy = 5,
	Elemental = 6,
	ESports = 7,
	Fantasy = 8,
	Graphic = 9,
	Gritty = 10,
	LoreBased = 11,
	RealWorld = 12,
	Retro = 13,
	SciFi = 14,
	Stylish = 15,
	Whimsical = 16,
	Count = 17,
	EThematicCategory_MAX = 18
};

// Enum ShooterGame.EThematicContinuationCategory
enum class EThematicContinuationCategory : uint8 {
	FirstGen = 0,
	SecondGen = 1,
	ThirdGen = 2,
	FourthGen = 3,
	Rerelease = 4,
	Count = 5,
	EThematicContinuationCategory_MAX = 6
};

// Enum ShooterGame.EPromotionCategory
enum class EPromotionCategory : uint8 {
	None = 0,
	Trailer = 1,
	InfluencerBuild = 2,
	SocialTweets = 3,
	Count = 4,
	EPromotionCategory_MAX = 5
};

// Enum ShooterGame.EAresTimerDirection
enum class EAresTimerDirection : uint8 {
	AfterStateStart = 0,
	BeforeStateEnd = 1,
	Count = 2,
	Invalid = 254,
	EAresTimerDirection_MAX = 255
};

// Enum ShooterGame.EReplayTimelineInteractionType
enum class EReplayTimelineInteractionType : uint8 {
	Invalid = 0,
	Play = 1,
	Pause = 2,
	SkipBackwards = 3,
	SkipForwards = 4,
	RoundSkipForwards = 5,
	RoundSkipBackwards = 6,
	RoundExplorerRoundJump = 7,
	RoundExplorerTimeJump = 8,
	TimeJump = 9,
	ModifyPlaybackSpeed = 10,
	ToggleFreeCam = 11,
	OpenSettings = 12,
	ToggleHideUI = 13,
	CycleAgent = 14,
	EReplayTimelineInteractionType_MAX = 15
};

// Enum ShooterGame.ETipDebugState
enum class ETipDebugState : uint8 {
	Resolved = 0,
	Invalid = 1,
	Valid = 2,
	Shown = 3,
	ETipDebugState_MAX = 4
};

// Enum ShooterGame.EToggleableAbilitySetting
enum class EToggleableAbilitySetting : uint8 {
	Hold = 0,
	Toggle = 1,
	UseGlobalSetting = 2,
	Count = 3,
	EToggleableAbilitySetting_MAX = 4
};

// Enum ShooterGame.ECancellableInputType
enum class ECancellableInputType : uint8 {
	None = 0,
	Weapon = 1,
	Ability = 2,
	Run = 4,
	JumpCrouch = 8,
	Camera = 16,
	Settings = 32,
	Pinging = 64,
	All = 127,
	Count = 7,
	ECancellableInputType_MAX = 128
};

// Enum ShooterGame.EMatchupNextSteps
enum class EMatchupNextSteps : uint8 {
	CONTINUE = 0,
	KNOCKED_OUT = 1,
	WIN_WINNERS = 2,
	WIN_LOSERS = 3,
	DROP_TO_CONSOLATION = 4,
	Count = 5,
	Invalid = 6,
	EMatchupNextSteps_MAX = 7
};

// Enum ShooterGame.ETransitionWidgetType
enum class ETransitionWidgetType : uint8 {
	Invalid = 0,
	None = 1,
	Default = 2,
	TransitionToPregame = 3,
	TransitionToInGame = 4,
	TransitionToMainMenu = 5,
	TransitionToWatchingReplay = 6,
	Count = 7,
	ETransitionWidgetType_MAX = 8
};

// Enum ShooterGame.EUIActionType
enum class EUIActionType : uint8 {
	Click = 0,
	Hover = 1,
	Invalid = 2,
	EUIActionType_MAX = 3
};

// Enum ShooterGame.EPingQuality
enum class EPingQuality : uint8 {
	None = 0,
	Low = 1,
	Med = 2,
	High = 3,
	Max = 4,
	EPingQuality_MAX = 5
};

// Enum ShooterGame.ECharacterRole
enum class ECharacterRole : uint8 {
	All = 0,
	Initiator = 1,
	Duelist = 2,
	Sentinel = 3,
	Controller = 4,
	None = 5,
	ECharacterRole_MAX = 6
};

// Enum ShooterGame.EIncrementType
enum class EIncrementType : uint8 {
	Increment = 0,
	Decrement = 1,
	None = 2,
	EIncrementType_MAX = 3
};

// Enum ShooterGame.EUseCompleteMethod
enum class EUseCompleteMethod : uint8 {
	Press = 0,
	Hold = 1,
	EUseCompleteMethod_MAX = 2
};

// Enum ShooterGame.EUseKeyUIType
enum class EUseKeyUIType : uint8 {
	Default = 0,
	Alternate = 1,
	SecondaryDefault = 2,
	Count = 3,
	EUseKeyUIType_MAX = 4
};

// Enum ShooterGame.EViewTargetSearchDirection
enum class EViewTargetSearchDirection : uint8 {
	Next = 0,
	Previous = 1,
	Count = 2,
	EViewTargetSearchDirection_MAX = 3
};

// Enum ShooterGame.EVisibleInterventionListCategory
enum class EVisibleInterventionListCategory : uint8 {
	ActiveInterventions = 0,
	AtRiskInterventions = 1,
	EVisibleInterventionListCategory_MAX = 2
};

// Enum ShooterGame.EAttemptQueueVoteResult
enum class EAttemptQueueVoteResult : uint8 {
	Queued = 0,
	Active = 1,
	Invalid = 2,
	AlreadyQueued = 3,
	EAttemptQueueVoteResult_MAX = 4
};

// Enum ShooterGame.EWallSectionPhase
enum class EWallSectionPhase : uint8 {
	Uninitalized = 0,
	Sectioning = 1,
	Extending = 2,
	Building = 3,
	Finalizing = 4,
	Finished = 5,
	Count = 6,
	EWallSectionPhase_MAX = 7
};

// Enum ShooterGame.EWidgetLayoutSettingName
enum class EWidgetLayoutSettingName : uint8 {
	WalkModeThreshold = 0,
	AimPassthrough = 1,
	DeadZoneThreshold = 2,
	SprintLockThreshold = 3,
	SprintLockActivationConeAngle = 4,
	AutoADS = 5,
	AutoScope = 6,
	FireOnReleaseSnipers = 7,
	FireOnReleaseOther = 8,
	MovementPassthrough = 9,
	WalkWhileFiring = 10,
	AutoRefireOnHold = 11,
	UseButton_PlantDefuse = 12,
	WeaponDropThreshold = 13,
	JumpCrouchJumpScale = 14,
	JumpCrouchCrouchScale = 15,
	JumpCrouchWidthScale = 16,
	JumpCrouchSwipeZoneHeight = 17,
	WS_UseStaticLayout = 18,
	WS_InvertFlyoutDirection = 19,
	AlwaysShowUse = 20,
	WS_UseWeaponCycling = 21,
	WS_HotswapToMelee = 22,
	WS_SpikeWidth = 23,
	WS_MeleeWidth = 24,
	HideWhenInactive = 25,
	BurstFire = 26,
	MinimapCalloutLocation = 27,
	EWidgetLayoutSettingName_MAX = 28
};

// Enum ShooterGame.EWidgetVisibilityState
enum class EWidgetVisibilityState : uint8 {
	Visible = 0,
	Hidden = 1,
	Collapsed = 2,
	EWidgetVisibilityState_MAX = 3
};

// Enum ShooterGame.EWildcardBlueprintLibrary_CastResult
enum class EWildcardBlueprintLibrary_CastResult : uint8 {
	Then = 0,
	Failed = 1,
	EWildcardBlueprintLibrary_MAX = 2
};

// Enum ShooterGame.EZoomComponentType
enum class EZoomComponentType : uint8 {
	CameraZoom = 0,
	FirstPersonMesh = 1,
	Count = 2,
	Invalid = 254,
	EZoomComponentType_MAX = 255
};

// Enum ShooterGame.EAimModeType
enum class EAimModeType : uint8 {
	PrioritizeFocus = 0,
	PrioritizeADS = 1,
	Count = 2,
	EAimModeType_MAX = 3
};

// Enum ShooterGame.EZoomCooldownOption
enum class EZoomCooldownOption : uint8 {
	ApplyCooldownAfterZoom = 0,
	NoCooldown = 1,
	Count = 2,
	EZoomCooldownOption_MAX = 3
};

// Enum ShooterGame.EZoomTransitionState
enum class EZoomTransitionState : uint8 {
	Transitioning = 0,
	OnCooldown = 1,
	Completed = 2,
	EZoomTransitionState_MAX = 3
};

// Enum ShooterGame.EZoomTimer
enum class EZoomTimer : uint8 {
	Transition = 0,
	Cooldown = 1,
	CosmeticZoomInPercentTrigger = 2,
	Count = 3,
	EZoomTimer_MAX = 4
};

// Enum ShooterGame.EZoomStateLevel
enum class EZoomStateLevel : uint8 {
	Disabled = 0,
	Unzoomed = 1,
	ZoomLevel1 = 2,
	ZoomLevel2 = 3,
	Count = 4,
	EZoomStateLevel_MAX = 5
};

// Enum ShooterGame.EZoomFiringBehavior
enum class EZoomFiringBehavior : uint8 {
	None = 0,
	FiringBlocks = 1,
	FiringCooldownBlocks = 2,
	Count = 3,
	EZoomFiringBehavior_MAX = 4
};

// Enum ShooterGame.EZoomMultiplierType
enum class EZoomMultiplierType : uint8 {
	ADS = 0,
	Sniper = 1,
	EZoomMultiplierType_MAX = 2
};

// ScriptStruct ShooterGame.AresSocialExperienceDelegates
// Size: 0x01 (Inherited: 0x00)
struct FAresSocialExperienceDelegates {
	char pad_0[0x1]; // 0x00(0x01)
};

// ScriptStruct ShooterGame.GenericSourceDelegate_Unused
// Size: 0x01 (Inherited: 0x00)
struct FGenericSourceDelegate_Unused {
	char pad_0[0x1]; // 0x00(0x01)
};

// ScriptStruct ShooterGame.WildcardDelegates_Unused
// Size: 0x01 (Inherited: 0x00)
struct FWildcardDelegates_Unused {
	char pad_0[0x1]; // 0x00(0x01)
};

// ScriptStruct ShooterGame.ActionChord
// Size: 0x28 (Inherited: 0x00)
struct FActionChord {
	struct FKey Key; // 0x00(0x20)
	bool bShift; // 0x20(0x01)
	bool bCtrl; // 0x21(0x01)
	bool bAlt; // 0x22(0x01)
	bool bCmd; // 0x23(0x01)
	bool bGamepadShift; // 0x24(0x01)
	enum class EActionChordTapHoldType TapHoldType; // 0x25(0x01)
	char pad_26[0x2]; // 0x26(0x02)
};

// ScriptStruct ShooterGame.Wildcard
// Size: 0x40 (Inherited: 0x00)
struct FWildcard {
	char pad_0[0x38]; // 0x00(0x38)
	struct UObject* Object; // 0x38(0x08)
};

// ScriptStruct ShooterGame.FullPortraitInfo
// Size: 0x90 (Inherited: 0x00)
struct FFullPortraitInfo {
	struct TMap<enum class ECharacterPortraitScreenEnum, struct FWidgetTransform> PortraitRenderTransformOverridesMap; // 0x00(0x50)
	struct FWidgetTransform PortraitRenderTransform; // 0x50(0x38)
	bool FullPortraitRightFacing; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
};

// ScriptStruct ShooterGame.AnimationCueSource_CueEventData
// Size: 0x10 (Inherited: 0x00)
struct FAnimationCueSource_CueEventData {
	int32_t SequenceNumber; // 0x00(0x04)
	struct FName CueName; // 0x04(0x0c)
};

// ScriptStruct ShooterGame.AresTouchTrackingData
// Size: 0xd0 (Inherited: 0x00)
struct FAresTouchTrackingData {
	enum class ETouchIndex TouchIndex; // 0x00(0x01)
	enum class EAresTouchState TouchState; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct FVector2D Location; // 0x08(0x10)
	struct FVector2D StartLocation; // 0x18(0x10)
	struct FVector2D PreviousLocation; // 0x28(0x10)
	struct FAresTouchEventInfo TouchInfo; // 0x38(0x98)
};

// ScriptStruct ShooterGame.AresTouchEventInfo
// Size: 0x98 (Inherited: 0x00)
struct FAresTouchEventInfo {
	struct FPointerEvent ParentPointerEvent; // 0x00(0x80)
	enum class ETouchIndex TouchIndex; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct FVector2D TouchLocation; // 0x88(0x10)
};

// ScriptStruct ShooterGame.AresTouchDoubleTapGestureData
// Size: 0x30 (Inherited: 0x00)
struct FAresTouchDoubleTapGestureData {
	enum class ETouchIndex TouchIndex; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FVector2D Location; // 0x08(0x10)
	struct FVector2D StartLocation; // 0x18(0x10)
	bool bHold; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// ScriptStruct ShooterGame.AresTouchHoldGestureData
// Size: 0x40 (Inherited: 0x00)
struct FAresTouchHoldGestureData {
	enum class ETouchIndex TouchIndex; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FVector2D Location; // 0x08(0x10)
	struct FVector2D StartLocation; // 0x18(0x10)
	enum class EAresTouchState TouchState; // 0x28(0x01)
	char pad_29[0x17]; // 0x29(0x17)
};

// ScriptStruct ShooterGame.CharacterHandles
// Size: 0x50 (Inherited: 0x00)
struct FCharacterHandles {
	struct TMap<struct UCharacterDataAsset*, struct UCharacterHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EsportsRankingTeamRecord
// Size: 0x08 (Inherited: 0x00)
struct FEsportsRankingTeamRecord {
	int32_t Wins; // 0x00(0x04)
	int32_t Losses; // 0x04(0x04)
};

// ScriptStruct ShooterGame.EsportsScheduleEntryContainer
// Size: 0x68 (Inherited: 0x00)
struct FEsportsScheduleEntryContainer {
	struct UEsportsMatchModelV2* Match; // 0x00(0x08)
	struct FDateTime StartTime; // 0x08(0x08)
	bool bIsDayContainer; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TSet<struct FString> AssociatedLeagueIDs; // 0x18(0x50)
};

// ScriptStruct ShooterGame.EsportsStandingTeamRecord
// Size: 0x08 (Inherited: 0x00)
struct FEsportsStandingTeamRecord {
	int32_t Wins; // 0x00(0x04)
	int32_t Losses; // 0x04(0x04)
};

// ScriptStruct ShooterGame.FiringResults
// Size: 0x30 (Inherited: 0x00)
struct FFiringResults {
	struct FVector FiringDirection; // 0x00(0x18)
	struct FVector StartLocation; // 0x18(0x18)
};

// ScriptStruct ShooterGame.ForceModuleHandle
// Size: 0x08 (Inherited: 0x00)
struct FForceModuleHandle {
	uint32_t HandleNumber; // 0x00(0x04)
	enum class EForceModuleType ModuleType; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct ShooterGame.FriendRequestItemModel
// Size: 0x30 (Inherited: 0x00)
struct FFriendRequestItemModel {
	struct FString PlayerName; // 0x00(0x10)
	struct FString PlayerTag; // 0x10(0x10)
	struct FString Subject; // 0x20(0x10)
};

// ScriptStruct ShooterGame.AresAssist
// Size: 0x10 (Inherited: 0x00)
struct FAresAssist {
	enum class EAresAssistType AssistType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct AShooterPlayerState* Assister; // 0x08(0x08)
};

// ScriptStruct ShooterGame.MatchHistoryModeOption
// Size: 0x28 (Inherited: 0x00)
struct FMatchHistoryModeOption {
	struct FString QueueID; // 0x00(0x10)
	struct FText ModeText; // 0x10(0x18)
};

// ScriptStruct ShooterGame.GameModeMatchDetailsScoreboardConfig
// Size: 0x08 (Inherited: 0x00)
struct FGameModeMatchDetailsScoreboardConfig {
	bool ShowACS; // 0x00(0x01)
	bool ShowKDA; // 0x01(0x01)
	bool ShowEconRating; // 0x02(0x01)
	bool ShowFirstBloods; // 0x03(0x01)
	bool ShowBombStats; // 0x04(0x01)
	bool IsFFAMode; // 0x05(0x01)
	bool ShowPlaceholder; // 0x06(0x01)
	enum class ESortCriteria DefaultSortCriteria; // 0x07(0x01)
};

// ScriptStruct ShooterGame.EventScheduleListDTO
// Size: 0x10 (Inherited: 0x00)
struct FEventScheduleListDTO {
	struct TArray<struct FEventScheduleDTO> EventScheduleList; // 0x00(0x10)
};

// ScriptStruct ShooterGame.EventScheduleDTO
// Size: 0x90 (Inherited: 0x00)
struct FEventScheduleDTO {
	struct FString LeagueID; // 0x00(0x10)
	struct FString LeagueName; // 0x10(0x10)
	struct FString LeagueSlug; // 0x20(0x10)
	struct FString tournamentid; // 0x30(0x10)
	struct FString TournamentName; // 0x40(0x10)
	struct FString TournamentSlug; // 0x50(0x10)
	struct FString TournamentState; // 0x60(0x10)
	struct FDateTime StartTime; // 0x70(0x08)
	struct FDateTime EndTime; // 0x78(0x08)
	struct TArray<struct FMatchDTO> Matches; // 0x80(0x10)
};

// ScriptStruct ShooterGame.MatchDTO
// Size: 0x98 (Inherited: 0x00)
struct FMatchDTO {
	struct FString ID; // 0x00(0x10)
	struct FDateTime StartTime; // 0x10(0x08)
	struct FString StageName; // 0x18(0x10)
	struct FString StageSlug; // 0x28(0x10)
	struct FString Stage; // 0x38(0x10)
	struct FString Status; // 0x48(0x10)
	struct FString StructuralID; // 0x58(0x10)
	struct TArray<struct FTeamDTO> Teams; // 0x68(0x10)
	struct TArray<struct FGameDTO> Games; // 0x78(0x10)
	struct TArray<struct FStreamDTO> Streams; // 0x88(0x10)
};

// ScriptStruct ShooterGame.StreamDTO
// Size: 0x60 (Inherited: 0x00)
struct FStreamDTO {
	struct FString ID; // 0x00(0x10)
	struct FString Locale; // 0x10(0x10)
	struct FString ProviderURL; // 0x20(0x10)
	struct FMediaLocaleDTO MediaLocale; // 0x30(0x30)
};

// ScriptStruct ShooterGame.MediaLocaleDTO
// Size: 0x30 (Inherited: 0x00)
struct FMediaLocaleDTO {
	struct FString Locale; // 0x00(0x10)
	struct FString EnglishName; // 0x10(0x10)
	struct FString TranslatedName; // 0x20(0x10)
};

// ScriptStruct ShooterGame.GameDTO
// Size: 0x28 (Inherited: 0x00)
struct FGameDTO {
	struct FString ID; // 0x00(0x10)
	int32_t Number; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<struct FVODDTO> VODs; // 0x18(0x10)
};

// ScriptStruct ShooterGame.VODDTO
// Size: 0x30 (Inherited: 0x00)
struct FVODDTO {
	struct FString ID; // 0x00(0x10)
	struct FString Locale; // 0x10(0x10)
	struct FString ProviderURL; // 0x20(0x10)
};

// ScriptStruct ShooterGame.TeamDTO
// Size: 0x190 (Inherited: 0x00)
struct FTeamDTO {
	struct FString ID; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
	struct FString Code; // 0x20(0x10)
	struct FString CodeSanitized; // 0x30(0x10)
	struct FString ImageURL; // 0x40(0x10)
	struct FString ImageLowResURL; // 0x50(0x10)
	struct FString ImageHighResURL; // 0x60(0x10)
	struct FString AlternativeImageURL; // 0x70(0x10)
	struct FString BackgroundImageURL; // 0x80(0x10)
	struct FString PrimaryColor; // 0x90(0x10)
	struct FString SecondaryColor; // 0xa0(0x10)
	struct FMatchOutcomeDTO MatchOutcome; // 0xb0(0x38)
	struct FOriginDTO Origin; // 0xe8(0x28)
	struct TArray<struct FPlayerDTO> Players; // 0x110(0x10)
	struct FTeamRecordDTO Record; // 0x120(0x0c)
	char pad_12C[0x4]; // 0x12c(0x04)
	struct FHomeLeagueDTO HomeLeague; // 0x130(0x40)
	struct FString BundleID; // 0x170(0x10)
	struct FString DataAssetID; // 0x180(0x10)
};

// ScriptStruct ShooterGame.HomeLeagueDTO
// Size: 0x40 (Inherited: 0x00)
struct FHomeLeagueDTO {
	struct FString ID; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
	struct FString ImageURL; // 0x20(0x10)
	struct FString Region; // 0x30(0x10)
};

// ScriptStruct ShooterGame.TeamRecordDTO
// Size: 0x0c (Inherited: 0x00)
struct FTeamRecordDTO {
	int32_t Wins; // 0x00(0x04)
	int32_t Losses; // 0x04(0x04)
	int32_t Ties; // 0x08(0x04)
};

// ScriptStruct ShooterGame.PlayerDTO
// Size: 0x80 (Inherited: 0x00)
struct FPlayerDTO {
	struct FString ID; // 0x00(0x10)
	struct FString SummonerName; // 0x10(0x10)
	struct FString Handle; // 0x20(0x10)
	struct FString FirstName; // 0x30(0x10)
	struct FString LastName; // 0x40(0x10)
	struct FString Image; // 0x50(0x10)
	struct FString Status; // 0x60(0x10)
	struct TArray<struct FPlayerRoleDTO> Roles; // 0x70(0x10)
};

// ScriptStruct ShooterGame.PlayerRoleDTO
// Size: 0x20 (Inherited: 0x00)
struct FPlayerRoleDTO {
	struct FString Type; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
};

// ScriptStruct ShooterGame.OriginDTO
// Size: 0x28 (Inherited: 0x00)
struct FOriginDTO {
	struct FString StructuralID; // 0x00(0x10)
	struct FString Type; // 0x10(0x10)
	int32_t Slot; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct ShooterGame.MatchOutcomeDTO
// Size: 0x38 (Inherited: 0x00)
struct FMatchOutcomeDTO {
	struct FString MatchID; // 0x00(0x10)
	struct FString TeamID; // 0x10(0x10)
	struct FString Outcome; // 0x20(0x10)
	int32_t GameWins; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// ScriptStruct ShooterGame.ActRankBorderHandles
// Size: 0x50 (Inherited: 0x00)
struct FActRankBorderHandles {
	struct TMap<struct UActRankBorderDataAsset*, struct UActRankBorderHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.BracketWinLoss
// Size: 0x08 (Inherited: 0x00)
struct FBracketWinLoss {
	int32_t Wins; // 0x00(0x04)
	int32_t Losses; // 0x04(0x04)
};

// ScriptStruct ShooterGame.AntiAddictionToken
// Size: 0x10 (Inherited: 0x00)
struct FAntiAddictionToken {
	struct FString Token; // 0x00(0x10)
};

// ScriptStruct ShooterGame.AresMenuUrl
// Size: 0x60 (Inherited: 0x00)
struct FAresMenuUrl {
	struct TArray<struct FName> URL; // 0x00(0x10)
	struct TMap<struct FName, struct FWildcard> Parameters; // 0x10(0x50)
};

// ScriptStruct ShooterGame.ArmorHandles
// Size: 0x50 (Inherited: 0x00)
struct FArmorHandles {
	struct TMap<struct UArmorDataAsset*, struct UArmorHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.CinematicCameraData
// Size: 0xa0 (Inherited: 0x00)
struct FCinematicCameraData {
	struct FString Name; // 0x00(0x10)
	struct FVector Position; // 0x10(0x18)
	struct FRotator Rotation; // 0x28(0x18)
	struct FVector Forward; // 0x40(0x18)
	struct FBox ViewBox; // 0x58(0x38)
	struct FName Layer; // 0x90(0x0c)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// ScriptStruct ShooterGame.AVSSuccessData
// Size: 0x20 (Inherited: 0x00)
struct FAVSSuccessData {
	enum class EAVSConfirmationResponseType ResponseType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FDateTime PinExpiryDateTime; // 0x08(0x08)
	struct FString PhoneNumberObfuscated; // 0x10(0x10)
};

// ScriptStruct ShooterGame.MenuStackMediaSourceParams
// Size: 0x30 (Inherited: 0x00)
struct FMenuStackMediaSourceParams {
	struct TSoftObjectPtr<UMediaSource> MediaSourceAsset; // 0x00(0x30)
};

// ScriptStruct ShooterGame.BaseHandles
// Size: 0x50 (Inherited: 0x00)
struct FBaseHandles {
	struct TMap<struct UAresBasePrimaryDataAsset*, struct UBaseHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.BracketLineLayout
// Size: 0x50 (Inherited: 0x00)
struct FBracketLineLayout {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct ShooterGame.TournamentStageV2
// Size: 0x30 (Inherited: 0x00)
struct FTournamentStageV2 {
	struct FString Name; // 0x00(0x10)
	struct FString Slug; // 0x10(0x10)
	struct TArray<struct FTournamentSectionV2> Sections; // 0x20(0x10)
};

// ScriptStruct ShooterGame.TournamentSectionV2
// Size: 0x20 (Inherited: 0x00)
struct FTournamentSectionV2 {
	struct FString ID; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
};

// ScriptStruct ShooterGame.TournamentStage
// Size: 0x38 (Inherited: 0x00)
struct FTournamentStage {
	struct FString Name; // 0x00(0x10)
	struct FString Slug; // 0x10(0x10)
	struct TArray<struct FTournamentSection> Sections; // 0x20(0x10)
	int32_t Index; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// ScriptStruct ShooterGame.TournamentSection
// Size: 0x28 (Inherited: 0x00)
struct FTournamentSection {
	struct FString ID; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
	int32_t Index; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct ShooterGame.BTEHandles
// Size: 0x50 (Inherited: 0x00)
struct FBTEHandles {
	struct TMap<struct UBTEDataAsset*, struct UBTEHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.AresGunRequest
// Size: 0x10 (Inherited: 0x00)
struct FAresGunRequest {
	struct UAresPurchasableEquippable* RequestedGun; // 0x00(0x08)
	enum class EAresGunRequestState RequestState; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct ShooterGame.PregameCastVote
// Size: 0x30 (Inherited: 0x00)
struct FPregameCastVote {
	struct FString Subject; // 0x00(0x10)
	struct FGuid MapGuid; // 0x10(0x10)
	struct FName Team; // 0x20(0x0c)
	enum class EStepType StepType; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
};

// ScriptStruct ShooterGame.CharacterRoleHandles
// Size: 0x50 (Inherited: 0x00)
struct FCharacterRoleHandles {
	struct TMap<struct UCharacterRoleDataAsset*, struct UCharacterRoleHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.CompetitiveSeasonHandles
// Size: 0x50 (Inherited: 0x00)
struct FCompetitiveSeasonHandles {
	struct TMap<struct UCompetitiveSeasonDataAsset*, struct UCompetitiveSeasonHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.AresConditionalInputAction
// Size: 0x28 (Inherited: 0x00)
struct FAresConditionalInputAction {
	struct FDataTableRowHandle InputRowHandle; // 0x00(0x18)
	enum class EAresCommonInputCondition InputCondition; // 0x18(0x01)
	enum class EActivationPreference DefaultActiveState; // 0x19(0x01)
	char pad_1A[0x2]; // 0x1a(0x02)
	struct FGameplayTag ConditionalInputTag; // 0x1c(0x0c)
};

// ScriptStruct ShooterGame.ContentEditionHandles
// Size: 0x50 (Inherited: 0x00)
struct FContentEditionHandles {
	struct TMap<struct UContentEditionDataAsset*, struct UContentEditionHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.ContentTierHandles
// Size: 0x50 (Inherited: 0x00)
struct FContentTierHandles {
	struct TMap<struct UContentTierDataAsset*, struct UContentTierHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.ContractV2Handles
// Size: 0x50 (Inherited: 0x00)
struct FContractV2Handles {
	struct TMap<struct UContractDataAssetV2*, struct UContractV2Handle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.CrosshairSettings
// Size: 0x198 (Inherited: 0x00)
struct FCrosshairSettings {
	struct FLineCrosshairSettings Primary; // 0x00(0x78)
	struct FLineCrosshairSettings ADS; // 0x78(0x78)
	struct FLineCrosshairSettings FocusMode; // 0xf0(0x78)
	struct FSniperCrosshairSettings Sniper; // 0x168(0x18)
	bool bUsePrimaryCrosshairForADS; // 0x180(0x01)
	bool bUsePrimaryCrosshairForFocusMode; // 0x181(0x01)
	bool bUseCustomCrosshairOnAllPrimary; // 0x182(0x01)
	bool bUseAdvancedOptions; // 0x183(0x01)
	bool bScaleToResolution; // 0x184(0x01)
	char pad_185[0x3]; // 0x185(0x03)
	struct FString ProfileName; // 0x188(0x10)
};

// ScriptStruct ShooterGame.SniperCrosshairSettings
// Size: 0x18 (Inherited: 0x00)
struct FSniperCrosshairSettings {
	struct FColor CenterDotColor; // 0x00(0x04)
	struct FColor CenterDotColorCustom; // 0x04(0x04)
	bool bUseCustomCenterDotColor; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float CenterDotSize; // 0x0c(0x04)
	float CenterDotOpacity; // 0x10(0x04)
	bool bDisplayCenterDot; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
};

// ScriptStruct ShooterGame.LineCrosshairSettings
// Size: 0x78 (Inherited: 0x00)
struct FLineCrosshairSettings {
	struct FColor Color; // 0x00(0x04)
	struct FColor ColorCustom; // 0x04(0x04)
	bool bUseCustomColor; // 0x08(0x01)
	bool bHasOutline; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	float OutlineThickness; // 0x0c(0x04)
	struct FColor OutlineColor; // 0x10(0x04)
	float OutlineOpacity; // 0x14(0x04)
	float CenterDotSize; // 0x18(0x04)
	float CenterDotOpacity; // 0x1c(0x04)
	bool bDisplayCenterDot; // 0x20(0x01)
	bool bFadeCrosshairWithFiringError; // 0x21(0x01)
	bool bShowSpectatedPlayerCrosshair; // 0x22(0x01)
	bool bHideCrosshair; // 0x23(0x01)
	bool bFixMinErrorAcrossWeapons; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	struct FLineCrosshairSectionSettings InnerLines; // 0x28(0x28)
	struct FLineCrosshairSectionSettings OuterLines; // 0x50(0x28)
};

// ScriptStruct ShooterGame.LineCrosshairSectionSettings
// Size: 0x28 (Inherited: 0x00)
struct FLineCrosshairSectionSettings {
	float LineThickness; // 0x00(0x04)
	float LineLength; // 0x04(0x04)
	float LineLengthVertical; // 0x08(0x04)
	bool bAllowVertScaling; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float LineOffset; // 0x10(0x04)
	bool bShowMovementError; // 0x14(0x01)
	bool bShowShootingError; // 0x15(0x01)
	bool bShowMinError; // 0x16(0x01)
	char pad_17[0x1]; // 0x17(0x01)
	float Opacity; // 0x18(0x04)
	bool bShowLines; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	float FiringErrorScale; // 0x20(0x04)
	float MovementErrorScale; // 0x24(0x04)
};

// ScriptStruct ShooterGame.CurrencyHandles
// Size: 0x50 (Inherited: 0x00)
struct FCurrencyHandles {
	struct TMap<struct UCurrencyDataAsset*, struct UCurrencyHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.DestructionEffect
// Size: 0x10 (Inherited: 0x00)
struct FDestructionEffect {
	struct AEffectContainer* FXC; // 0x00(0x08)
	enum class EDestructionEffectPlayType PlayType; // 0x08(0x01)
	bool bOnlyPlayOnDeathOrDestroy; // 0x09(0x01)
	char pad_A[0x6]; // 0x0a(0x06)
};

// ScriptStruct ShooterGame.DisplayName
// Size: 0x30 (Inherited: 0x00)
struct FDisplayName {
	struct FString FullName; // 0x00(0x10)
	struct FString GameName; // 0x10(0x10)
	struct FString TagLine; // 0x20(0x10)
};

// ScriptStruct ShooterGame.EquippableAttachmentHandles
// Size: 0x50 (Inherited: 0x00)
struct FEquippableAttachmentHandles {
	struct TMap<struct UEquippableAttachmentDataAsset*, struct UEquippableAttachmentHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EquippableCharmInstanceHandles
// Size: 0x10 (Inherited: 0x00)
struct FEquippableCharmInstanceHandles {
	struct TArray<struct UEquippableCharmInstanceHandle*> Handles; // 0x00(0x10)
};

// ScriptStruct ShooterGame.EquippableCharmLevelHandles
// Size: 0x50 (Inherited: 0x00)
struct FEquippableCharmLevelHandles {
	struct TMap<struct UEquippableCharmLevelDataAsset*, struct UEquippableCharmLevelHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EquippableCharmHandles
// Size: 0x50 (Inherited: 0x00)
struct FEquippableCharmHandles {
	struct TMap<struct UEquippableCharmDataAsset*, struct UEquippableCharmHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EquippableHandles
// Size: 0x50 (Inherited: 0x00)
struct FEquippableHandles {
	struct TMap<struct UEquippableDataAsset*, struct UEquippableHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EquippableSkinChromaHandles
// Size: 0x50 (Inherited: 0x00)
struct FEquippableSkinChromaHandles {
	struct TMap<struct UEquippableSkinChromaDataAsset*, struct UEquippableSkinChromaHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EquippableSkinLevelHandles
// Size: 0x50 (Inherited: 0x00)
struct FEquippableSkinLevelHandles {
	struct TMap<struct UEquippableSkinLevelDataAsset*, struct UEquippableSkinLevelHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EquippableSkinHandles
// Size: 0x50 (Inherited: 0x00)
struct FEquippableSkinHandles {
	struct TMap<struct UEquippableSkinDataAsset*, struct UEquippableSkinHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EsportsTeamHandles
// Size: 0x50 (Inherited: 0x00)
struct FEsportsTeamHandles {
	struct TMap<struct UEsportsTeamDataAsset*, struct UEsportsTeamHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EsportsTeamsByRegionMap
// Size: 0x50 (Inherited: 0x00)
struct FEsportsTeamsByRegionMap {
	struct TMap<enum class EVCTRegion, struct FEsportsTeamIDList> TeamsByRegion; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EsportsTeamIDList
// Size: 0x10 (Inherited: 0x00)
struct FEsportsTeamIDList {
	struct TArray<struct FString> TeamIDs; // 0x00(0x10)
};

// ScriptStruct ShooterGame.TeamsListByRegionMap
// Size: 0x50 (Inherited: 0x00)
struct FTeamsListByRegionMap {
	struct TMap<enum class EVCTRegion, struct FTeamArray> RegionToTeamsListMap; // 0x00(0x50)
};

// ScriptStruct ShooterGame.TeamArray
// Size: 0x10 (Inherited: 0x00)
struct FTeamArray {
	struct TArray<struct UTeamModel*> Teams; // 0x00(0x10)
};

// ScriptStruct ShooterGame.EventHandles
// Size: 0x50 (Inherited: 0x00)
struct FEventHandles {
	struct TMap<struct UEventDataAsset*, struct UEventHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.ExpressionEquipSlotHandles
// Size: 0x50 (Inherited: 0x00)
struct FExpressionEquipSlotHandles {
	struct TMap<struct UExpressionEquipSlotDataAsset*, struct UExpressionEquipSlotHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.ExpressionHandles
// Size: 0x60 (Inherited: 0x00)
struct FExpressionHandles {
	struct TArray<struct UAresBasePrimaryDataAsset*> OrderedAssets; // 0x00(0x10)
	struct TMap<struct UAresBasePrimaryDataAsset*, struct UExpressionHandle*> Handles; // 0x10(0x50)
};

// ScriptStruct ShooterGame.PregameStep
// Size: 0x08 (Inherited: 0x00)
struct FPregameStep {
	int32_t Team; // 0x00(0x04)
	enum class EStepType StepType; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct ShooterGame.GameModeHandles
// Size: 0x50 (Inherited: 0x00)
struct FGameModeHandles {
	struct TMap<struct UGameModeDataAsset*, struct UGameModeHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.AmbassadorError
// Size: 0x38 (Inherited: 0x00)
struct FAmbassadorError {
	int32_t HTTPStatus; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString ErrorCode; // 0x08(0x10)
	struct FString Message; // 0x18(0x10)
	struct FString Details; // 0x28(0x10)
};

// ScriptStruct ShooterGame.ImmunityBlockedDamageData
// Size: 0x20 (Inherited: 0x00)
struct FImmunityBlockedDamageData {
	struct AActor* DamageCauser; // 0x00(0x08)
	float DamageIgnored; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UDamageType* DamageType; // 0x10(0x08)
	enum class EAresDamageImmunityCategory DamageImmunityCategory; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct ShooterGame.EquippedCharmInstanceMap
// Size: 0x50 (Inherited: 0x00)
struct FEquippedCharmInstanceMap {
	struct TMap<struct FGuid, struct UEquippableCharmInstanceInventoryModel*> InstanceInventory; // 0x00(0x50)
};

// ScriptStruct ShooterGame.TriggerInput
// Size: 0x02 (Inherited: 0x00)
struct FTriggerInput {
	enum class EAresEquippableInput TriggerInput; // 0x00(0x01)
	enum class EAresEquippableInputAction TriggerAction; // 0x01(0x01)
};

// ScriptStruct ShooterGame.JuiceBoxHandles
// Size: 0x50 (Inherited: 0x00)
struct FJuiceBoxHandles {
	struct TMap<struct UJuiceBoxDataAsset*, struct UJuiceBoxHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.PremierLeaderboard
// Size: 0x50 (Inherited: 0x00)
struct FPremierLeaderboard {
	char pad_0[0x30]; // 0x00(0x30)
	int32_t StartRank; // 0x30(0x04)
	int32_t EndRank; // 0x34(0x04)
	int32_t Size; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct TArray<struct FPremierLeaderboardEntry> Entries; // 0x40(0x10)
};

// ScriptStruct ShooterGame.PremierLeaderboardEntry
// Size: 0x90 (Inherited: 0x00)
struct FPremierLeaderboardEntry {
	struct FString RosterID; // 0x00(0x10)
	float Score; // 0x10(0x04)
	enum class EPremierTournamentPlacement PlayoffResult; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
	int32_t Rank; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct FString RosterName; // 0x20(0x10)
	struct FString Tag; // 0x30(0x10)
	struct FPremierRosterCustomization Customization; // 0x40(0x40)
	int32_t Wins; // 0x80(0x04)
	int32_t Losses; // 0x84(0x04)
	int32_t RoundWins; // 0x88(0x04)
	int32_t RoundLosses; // 0x8c(0x04)
};

// ScriptStruct ShooterGame.PremierRosterCustomization
// Size: 0x40 (Inherited: 0x00)
struct FPremierRosterCustomization {
	struct FString Icon; // 0x00(0x10)
	struct FString PrimaryColor; // 0x10(0x10)
	struct FString SecondaryColor; // 0x20(0x10)
	struct FString TertiaryColor; // 0x30(0x10)
};

// ScriptStruct ShooterGame.LeaderboardPlayer
// Size: 0x78 (Inherited: 0x00)
struct FLeaderboardPlayer {
	struct FString Puuid; // 0x00(0x10)
	struct FString Prefix; // 0x10(0x10)
	struct FString GameName; // 0x20(0x10)
	struct FString TagLine; // 0x30(0x10)
	struct FGuid PlayerCardId; // 0x40(0x10)
	struct FGuid TitleId; // 0x50(0x10)
	int32_t RankedRating; // 0x60(0x04)
	int32_t CompetitiveTier; // 0x64(0x04)
	int32_t LeaderboardRank; // 0x68(0x04)
	int32_t NumberOfWins; // 0x6c(0x04)
	bool IsAnonymized; // 0x70(0x01)
	bool IsBanned; // 0x71(0x01)
	bool IsSeparator; // 0x72(0x01)
	char pad_73[0x5]; // 0x73(0x05)
};

// ScriptStruct ShooterGame.LevelBorderHandles
// Size: 0x50 (Inherited: 0x00)
struct FLevelBorderHandles {
	struct TMap<struct ULevelBorderDataAsset*, struct ULevelBorderHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.MapHandles
// Size: 0x50 (Inherited: 0x00)
struct FMapHandles {
	struct TMap<struct UMapDataAsset*, struct UMapHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.MassRewardsCeremonyHandles
// Size: 0x50 (Inherited: 0x00)
struct FMassRewardsCeremonyHandles {
	struct TMap<struct UMassRewardsCeremonyDataAsset*, struct UMassRewardsCeremonyHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.MatchDetailsDTO
// Size: 0x138 (Inherited: 0x00)
struct FMatchDetailsDTO {
	struct FMatchInfoDTO MatchInfo; // 0x00(0xf8)
	struct TArray<struct FPlayerDetailsDTO> Players; // 0xf8(0x10)
	struct TArray<struct FBotDetailsDTO> Bots; // 0x108(0x10)
	struct TArray<struct FTeamDetailsDTO> Teams; // 0x118(0x10)
	struct TArray<struct FRoundResultDTO> RoundResults; // 0x128(0x10)
};

// ScriptStruct ShooterGame.RoundResultDTO
// Size: 0xa0 (Inherited: 0x00)
struct FRoundResultDTO {
	struct FName WinningTeam; // 0x00(0x0c)
	int32_t RoundNum; // 0x0c(0x04)
	struct FString RoundResult; // 0x10(0x10)
	struct FString RoundCeremony; // 0x20(0x10)
	struct FString BombPlanter; // 0x30(0x10)
	int32_t PlantRoundTime; // 0x40(0x04)
	struct FMapLocationDTO PlantLocation; // 0x44(0x08)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct FPlayerLocationDTO> PlantPlayerLocations; // 0x50(0x10)
	struct FString BombDefuser; // 0x60(0x10)
	int32_t DefuseRoundTime; // 0x70(0x04)
	struct FMapLocationDTO DefuseLocation; // 0x74(0x08)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct TArray<struct FPlayerLocationDTO> DefusePlayerLocations; // 0x80(0x10)
	struct TArray<struct FPlayerStatDTO> PlayerStats; // 0x90(0x10)
};

// ScriptStruct ShooterGame.PlayerStatDTO
// Size: 0x1b8 (Inherited: 0x00)
struct FPlayerStatDTO {
	struct FString Subject; // 0x00(0x10)
	struct TArray<struct FKillDetailsDTO> Kills; // 0x10(0x10)
	struct TArray<struct FPlayerRoundDamageDTOV2> Damage; // 0x20(0x10)
	int32_t Score; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FPlayerRoundEconomyInfoDTO Economy; // 0x38(0x40)
	struct FAbilityEffectDTO Ability; // 0x78(0x140)
};

// ScriptStruct ShooterGame.AbilityEffectDTO
// Size: 0x140 (Inherited: 0x00)
struct FAbilityEffectDTO {
	struct TMap<struct FString, int32_t> GrenadeEffects; // 0x00(0x50)
	struct TMap<struct FString, int32_t> Ability1Effects; // 0x50(0x50)
	struct TMap<struct FString, int32_t> Ability2Effects; // 0xa0(0x50)
	struct TMap<struct FString, int32_t> UltimateEffects; // 0xf0(0x50)
};

// ScriptStruct ShooterGame.PlayerRoundEconomyInfoDTO
// Size: 0x40 (Inherited: 0x00)
struct FPlayerRoundEconomyInfoDTO {
	struct FString Subject; // 0x00(0x10)
	int32_t LoadoutValue; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString Weapon; // 0x18(0x10)
	struct FString Armor; // 0x28(0x10)
	int32_t Remaining; // 0x38(0x04)
	int32_t Spent; // 0x3c(0x04)
};

// ScriptStruct ShooterGame.PlayerRoundDamageDTOV2
// Size: 0x20 (Inherited: 0x00)
struct FPlayerRoundDamageDTOV2 {
	struct FString Receiver; // 0x00(0x10)
	int32_t Damage; // 0x10(0x04)
	int32_t Headshots; // 0x14(0x04)
	int32_t Bodyshots; // 0x18(0x04)
	int32_t Legshots; // 0x1c(0x04)
};

// ScriptStruct ShooterGame.KillDetailsDTO
// Size: 0x80 (Inherited: 0x00)
struct FKillDetailsDTO {
	int64_t GameTime; // 0x00(0x08)
	int32_t RoundTime; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString Killer; // 0x10(0x10)
	struct FString Victim; // 0x20(0x10)
	struct FMapLocationDTO VictimLocation; // 0x30(0x08)
	struct TArray<struct FString> Assistants; // 0x38(0x10)
	struct TArray<struct FPlayerLocationDTO> PlayerLocations; // 0x48(0x10)
	struct FDamageInfoDTO FinishingDamage; // 0x58(0x28)
};

// ScriptStruct ShooterGame.DamageInfoDTO
// Size: 0x28 (Inherited: 0x00)
struct FDamageInfoDTO {
	struct FString DamageType; // 0x00(0x10)
	struct FString DamageItem; // 0x10(0x10)
	bool bIsSecondaryFireMode; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
};

// ScriptStruct ShooterGame.PlayerLocationDTO
// Size: 0x20 (Inherited: 0x00)
struct FPlayerLocationDTO {
	struct FMapLocationDTO Location; // 0x00(0x08)
	float ViewRadians; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString Subject; // 0x10(0x10)
};

// ScriptStruct ShooterGame.MapLocationDTO
// Size: 0x08 (Inherited: 0x00)
struct FMapLocationDTO {
	float X; // 0x00(0x04)
	float Y; // 0x04(0x04)
};

// ScriptStruct ShooterGame.TeamDetailsDTO
// Size: 0xa0 (Inherited: 0x00)
struct FTeamDetailsDTO {
	struct FName TeamID; // 0x00(0x0c)
	bool Won; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	int64_t RoundsPlayed; // 0x10(0x08)
	int32_t RoundsWon; // 0x18(0x04)
	int32_t NumPoints; // 0x1c(0x04)
	struct FTournamentRosterInfo RosterInfo; // 0x20(0x80)
};

// ScriptStruct ShooterGame.TournamentRosterInfo
// Size: 0x80 (Inherited: 0x00)
struct FTournamentRosterInfo {
	struct FString RosterID; // 0x00(0x10)
	struct TArray<struct FTournamentRosterMember> Members; // 0x10(0x10)
	struct FString Name; // 0x20(0x10)
	struct FString Tag; // 0x30(0x10)
	struct FString Icon; // 0x40(0x10)
	struct FString PrimaryColor; // 0x50(0x10)
	struct FString SecondaryColor; // 0x60(0x10)
	struct FString TertiaryColor; // 0x70(0x10)
};

// ScriptStruct ShooterGame.TournamentRosterMember
// Size: 0x10 (Inherited: 0x00)
struct FTournamentRosterMember {
	struct FString Subject; // 0x00(0x10)
};

// ScriptStruct ShooterGame.BotDetailsDTO
// Size: 0x68 (Inherited: 0x00)
struct FBotDetailsDTO {
	struct FString Subject; // 0x00(0x10)
	struct FName TeamID; // 0x10(0x0c)
	struct FGuid CharacterID; // 0x1c(0x10)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FPlayerStatsDTO Stats; // 0x30(0x38)
};

// ScriptStruct ShooterGame.PlayerStatsDTO
// Size: 0x38 (Inherited: 0x00)
struct FPlayerStatsDTO {
	int32_t Score; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	int64_t RoundsPlayed; // 0x08(0x08)
	int32_t Kills; // 0x10(0x04)
	int32_t Deaths; // 0x14(0x04)
	int32_t Assists; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	int64_t PlaytimeMillis; // 0x20(0x08)
	struct FAbilityUsageDTO AbilityCasts; // 0x28(0x10)
};

// ScriptStruct ShooterGame.AbilityUsageDTO
// Size: 0x10 (Inherited: 0x00)
struct FAbilityUsageDTO {
	int32_t GrenadeCasts; // 0x00(0x04)
	int32_t Ability1Casts; // 0x04(0x04)
	int32_t Ability2Casts; // 0x08(0x04)
	int32_t UltimateCasts; // 0x0c(0x04)
};

// ScriptStruct ShooterGame.PlayerDetailsDTO
// Size: 0x178 (Inherited: 0x00)
struct FPlayerDetailsDTO {
	struct FString Subject; // 0x00(0x10)
	struct FString GameName; // 0x10(0x10)
	struct FString TagLine; // 0x20(0x10)
	struct FPlatformInfoDTO PlatformInfo; // 0x30(0x50)
	enum class EAresTempType PlatformType; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	struct FName TeamID; // 0x84(0x0c)
	struct FString PartyId; // 0x90(0x10)
	struct FGuid CharacterID; // 0xa0(0x10)
	struct FPlayerStatsDTO Stats; // 0xb0(0x38)
	int32_t CompetitiveTier; // 0xe8(0x04)
	bool IsObserver; // 0xec(0x01)
	char pad_ED[0x3]; // 0xed(0x03)
	struct FGuid PlayerCard; // 0xf0(0x10)
	struct FGuid PlayerTitle; // 0x100(0x10)
	struct FGuid PreferredLevelBorder; // 0x110(0x10)
	int32_t AccountLevel; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct FPremierPrestigeDetailsDTO PremierPrestige; // 0x128(0x50)
};

// ScriptStruct ShooterGame.PremierPrestigeDetailsDTO
// Size: 0x50 (Inherited: 0x00)
struct FPremierPrestigeDetailsDTO {
	struct FString RosterID; // 0x00(0x10)
	struct FString RosterName; // 0x10(0x10)
	struct FString RosterTag; // 0x20(0x10)
	bool ShowTag; // 0x30(0x01)
	bool ShowPlating; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
	struct FString Plating; // 0x38(0x10)
	bool ShowAura; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct ShooterGame.PlatformInfoDTO
// Size: 0x50 (Inherited: 0x00)
struct FPlatformInfoDTO {
	struct FString PlatformType; // 0x00(0x10)
	struct FString PlatformOS; // 0x10(0x10)
	struct FString PlatformOSVersion; // 0x20(0x10)
	struct FString PlatformChipset; // 0x30(0x10)
	struct FString PlatformDevice; // 0x40(0x10)
};

// ScriptStruct ShooterGame.MatchInfoDTO
// Size: 0xf8 (Inherited: 0x00)
struct FMatchInfoDTO {
	struct FString MatchID; // 0x00(0x10)
	struct FString MapID; // 0x10(0x10)
	struct FString GameMode; // 0x20(0x10)
	int32_t MatchType; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FString GamePodID; // 0x38(0x10)
	struct FString GameVersion; // 0x48(0x10)
	int64_t GameLengthMillis; // 0x58(0x08)
	int64_t GameStartMillis; // 0x60(0x08)
	struct FString ProvisioningFlowID; // 0x68(0x10)
	enum class EProvisioningFlowID ProvisioningFlowEnum; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct FString QueueID; // 0x80(0x10)
	struct FString tournamentid; // 0x90(0x10)
	struct FPremierMatchInfoDTO PremierMatchInfo; // 0xa0(0x40)
	struct FGuid SeasonID; // 0xe0(0x10)
	bool IsCompleted; // 0xf0(0x01)
	bool IsRanked; // 0xf1(0x01)
	bool IsReplayRecorded; // 0xf2(0x01)
	char pad_F3[0x1]; // 0xf3(0x01)
	float NewMapLossReductionModifier; // 0xf4(0x04)
};

// ScriptStruct ShooterGame.PremierMatchInfoDTO
// Size: 0x40 (Inherited: 0x00)
struct FPremierMatchInfoDTO {
	struct FString tournamentid; // 0x00(0x10)
	struct FString MatchupID; // 0x10(0x10)
	struct FGuid PremierSeasonID; // 0x20(0x10)
	struct FGuid PremierEventID; // 0x30(0x10)
};

// ScriptStruct ShooterGame.AresMatchResult
// Size: 0x10 (Inherited: 0x00)
struct FAresMatchResult {
	struct UBaseTeamComponent* WinningTeam; // 0x00(0x08)
	enum class EMatchCompletionState CompletionState; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct ShooterGame.FullMatchHistory
// Size: 0x20 (Inherited: 0x00)
struct FFullMatchHistory {
	struct TArray<struct FMatchDetailsDTO> History; // 0x00(0x10)
	struct FString Subject; // 0x10(0x10)
};

// ScriptStruct ShooterGame.MatchmakingQueueHandles
// Size: 0x50 (Inherited: 0x00)
struct FMatchmakingQueueHandles {
	struct TMap<struct UMatchmakingQueueDataAsset*, struct UMatchmakingQueueHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.CurrentTeamViewState
// Size: 0x38 (Inherited: 0x00)
struct FCurrentTeamViewState {
	char pad_0[0x30]; // 0x00(0x30)
	struct UEsportsImageLoaderBase* Logo; // 0x30(0x08)
};

// ScriptStruct ShooterGame.CurrentTeamViewStateV2
// Size: 0x18 (Inherited: 0x00)
struct FCurrentTeamViewStateV2 {
	char pad_0[0x10]; // 0x00(0x10)
	struct TWeakObjectPtr<struct UEsportsTeamModelV2> TeamModel; // 0x10(0x08)
};

// ScriptStruct ShooterGame.MenuMusic
// Size: 0x10 (Inherited: 0x00)
struct FMenuMusic {
	struct UAkAudioEvent* Default; // 0x00(0x08)
	struct UAkAudioEvent* FindMatch; // 0x08(0x08)
};

// ScriptStruct ShooterGame.UnifiedChatMessage
// Size: 0xd8 (Inherited: 0x00)
struct FUnifiedChatMessage {
	struct FText SenderDisplayName; // 0x00(0x18)
	struct FString SenderSubject; // 0x18(0x10)
	bool SenderIsMe; // 0x28(0x01)
	enum class EMessageContentType ContentType; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
	struct FText DisplayMessage; // 0x30(0x18)
	struct TArray<struct FMessagePart> MessageParts; // 0x48(0x10)
	struct TArray<struct FMessagePart> OriginalMessageParts; // 0x58(0x10)
	struct FDateTime Timestamp; // 0x68(0x08)
	enum class EAresAlliance SenderTeamAlliance; // 0x70(0x01)
	enum class EChatRoomType RoomType; // 0x71(0x01)
	char pad_72[0x2]; // 0x72(0x02)
	struct FName Team; // 0x74(0x0c)
	struct FString ConversationID; // 0x80(0x10)
	struct FString MessageID; // 0x90(0x10)
	struct FString RecipientDisplayName; // 0xa0(0x10)
	bool bRead; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct FString OriginatingSystem; // 0xb8(0x10)
	bool bNotificationShown; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)
	struct UEmojiMapping* EmojiMapping; // 0xd0(0x08)
};

// ScriptStruct ShooterGame.MessagePart
// Size: 0x40 (Inherited: 0x00)
struct FMessagePart {
	enum class EMessagePartType Type; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString Message; // 0x08(0x10)
	struct FText NotificationTarget; // 0x18(0x18)
	struct FString EmojiKey; // 0x30(0x10)
};

// ScriptStruct ShooterGame.MUCMessage
// Size: 0xd0 (Inherited: 0x00)
struct FMUCMessage {
	struct FText Body; // 0x00(0x18)
	struct FString Pid; // 0x18(0x10)
	struct FString Time; // 0x28(0x10)
	struct FString Cid; // 0x38(0x10)
	struct FString ID; // 0x48(0x10)
	struct FText Name; // 0x58(0x18)
	bool Read; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct FString GameName; // 0x78(0x10)
	struct FString GameTag; // 0x88(0x10)
	enum class ETextChatRoomType MessageType; // 0x98(0x01)
	bool DroppedDueToThrottle; // 0x99(0x01)
	char pad_9A[0x6]; // 0x9a(0x06)
	struct FString Type; // 0xa0(0x10)
	struct FString game_name; // 0xb0(0x10)
	struct FString game_tag; // 0xc0(0x10)
};

// ScriptStruct ShooterGame.MissionHandles
// Size: 0x50 (Inherited: 0x00)
struct FMissionHandles {
	struct TMap<struct UMissionDataAsset*, struct UMissionHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.MMRCompetitiveUpdates
// Size: 0x28 (Inherited: 0x00)
struct FMMRCompetitiveUpdates {
	struct FString Subject; // 0x00(0x10)
	struct TArray<struct FMMRMatchInfo> Matches; // 0x10(0x10)
	int64_t Version; // 0x20(0x08)
};

// ScriptStruct ShooterGame.MMRMatchInfo
// Size: 0x38 (Inherited: 0x00)
struct FMMRMatchInfo {
	struct FString MatchID; // 0x00(0x10)
	int32_t TierBeforeUpdate; // 0x10(0x04)
	int32_t TierAfterUpdate; // 0x14(0x04)
	int32_t RankedRatingBeforeUpdate; // 0x18(0x04)
	int32_t RankedRatingAfterUpdate; // 0x1c(0x04)
	int32_t RankedRatingEarned; // 0x20(0x04)
	int32_t AFKPenalty; // 0x24(0x04)
	int32_t RankedRatingPerformanceBonus; // 0x28(0x04)
	int32_t RankedRatingRefundApplied; // 0x2c(0x04)
	int32_t NewMapIncentiveRRForgiven; // 0x30(0x04)
	bool WasDerankProtected; // 0x34(0x01)
	bool WasDerankProtectionReplenished; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
};

// ScriptStruct ShooterGame.Leaderboard
// Size: 0x88 (Inherited: 0x00)
struct FLeaderboard {
	struct FGuid SeasonID; // 0x00(0x10)
	struct TMap<int32_t, struct FLeaderboardTierDetails> TierDetails; // 0x10(0x50)
	int32_t TotalPlayers; // 0x60(0x04)
	int32_t StartIndex; // 0x64(0x04)
	struct FString Query; // 0x68(0x10)
	struct TArray<struct FLeaderboardPlayer> Players; // 0x78(0x10)
};

// ScriptStruct ShooterGame.LeaderboardTierDetails
// Size: 0x0c (Inherited: 0x00)
struct FLeaderboardTierDetails {
	int32_t RankedRatingThreshold; // 0x00(0x04)
	int32_t StartingPage; // 0x04(0x04)
	int32_t StartingIndex; // 0x08(0x04)
};

// ScriptStruct ShooterGame.MMRPlayer
// Size: 0xd8 (Inherited: 0x00)
struct FMMRPlayer {
	struct FString Subject; // 0x00(0x10)
	bool NewPlayerExperienceFinished; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FMMRMatchInfo LatestCompetitiveUpdate; // 0x18(0x38)
	int64_t Version; // 0x50(0x08)
	struct TMap<struct FString, struct FMMRQueueSkill> QueueSkills; // 0x58(0x50)
	bool IsLeaderboardAnonymized; // 0xa8(0x01)
	bool IsActRankBadgeHidden; // 0xa9(0x01)
	char pad_AA[0x6]; // 0xaa(0x06)
	struct FString OnboardingStatus; // 0xb0(0x10)
	bool OnboardingFlowV2Enabled; // 0xc0(0x01)
	bool IsAtDerankProtectedTier; // 0xc1(0x01)
	char pad_C2[0x6]; // 0xc2(0x06)
	int64_t DerankProtectedGamesRemaining; // 0xc8(0x08)
	enum class EDerankProtectionStatus DerankProtectedStatus; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)
};

// ScriptStruct ShooterGame.MMRQueueSkill
// Size: 0x68 (Inherited: 0x00)
struct FMMRQueueSkill {
	int32_t CompetitiveTier; // 0x00(0x04)
	int32_t TotalGamesNeededForRating; // 0x04(0x04)
	int32_t RecentGamesNeededForRating; // 0x08(0x04)
	int32_t CurrentSeasonGamesNeededForRating; // 0x0c(0x04)
	int32_t TotalGamesNeededForLeaderboard; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TMap<struct FGuid, struct FMMRSeasonInfo> SeasonalInfoBySeasonID; // 0x18(0x50)
};

// ScriptStruct ShooterGame.MMRSeasonInfo
// Size: 0x88 (Inherited: 0x00)
struct FMMRSeasonInfo {
	struct FGuid SeasonID; // 0x00(0x10)
	int32_t NumberOfWins; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TMap<int32_t, int32_t> WinsByTier; // 0x18(0x50)
	int32_t CapstoneWins; // 0x68(0x04)
	int32_t Rank; // 0x6c(0x04)
	int32_t TotalWinsNeededForRank; // 0x70(0x04)
	int32_t LeaderboardRank; // 0x74(0x04)
	int32_t RankedRating; // 0x78(0x04)
	int32_t CompetitiveTier; // 0x7c(0x04)
	int32_t GamesNeededForRating; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
};

// ScriptStruct ShooterGame.AresMonitorInfo
// Size: 0x78 (Inherited: 0x00)
struct FAresMonitorInfo {
	struct FString Name; // 0x00(0x10)
	bool bIsPrimary; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<struct FAresResolutionInfo> ResolutionInfo; // 0x18(0x10)
	int32_t NativeWidth; // 0x28(0x04)
	int32_t NativeHeight; // 0x2c(0x04)
	int32_t MaxResolutionWidth; // 0x30(0x04)
	int32_t MaxResolutionHeight; // 0x34(0x04)
	char pad_38[0x40]; // 0x38(0x40)
};

// ScriptStruct ShooterGame.AresResolutionInfo
// Size: 0x0c (Inherited: 0x00)
struct FAresResolutionInfo {
	int32_t Width; // 0x00(0x04)
	int32_t Height; // 0x04(0x04)
	int32_t RefreshRate; // 0x08(0x04)
};

// ScriptStruct ShooterGame.EventIDs
// Size: 0x20 (Inherited: 0x00)
struct FEventIDs {
	struct FString LeagueID; // 0x00(0x10)
	struct FString tournamentid; // 0x10(0x10)
};

// ScriptStruct ShooterGame.RGICommonNavBarDetails
// Size: 0x78 (Inherited: 0x00)
struct FRGICommonNavBarDetails {
	struct FText Text; // 0x00(0x18)
	struct UTexture2D* Icon; // 0x18(0x08)
	struct UAresCommonButton* ButtonClass; // 0x20(0x08)
	struct FString NavUrl; // 0x28(0x10)
	struct FWildcard Data; // 0x38(0x40)
};

// ScriptStruct ShooterGame.NPEObjectiveEvent
// Size: 0x68 (Inherited: 0x00)
struct FNPEObjectiveEvent {
	enum class EObjectiveEventType EventType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString ModuleName; // 0x08(0x10)
	struct FString MissionName; // 0x18(0x10)
	struct FString ObjectiveName; // 0x28(0x10)
	float TotalTimeTaken; // 0x38(0x04)
	float TimeAFK; // 0x3c(0x04)
	int32_t Retries; // 0x40(0x04)
	int32_t ShotsFired; // 0x44(0x04)
	int32_t ShotsLanded; // 0x48(0x04)
	int32_t Headshots; // 0x4c(0x04)
	int32_t Deaths; // 0x50(0x04)
	float DamageTaken; // 0x54(0x04)
	float StartTime; // 0x58(0x04)
	float LastAFKStart; // 0x5c(0x04)
	bool bIsComplete; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
};

// ScriptStruct ShooterGame.ObjectiveHandles
// Size: 0x50 (Inherited: 0x00)
struct FObjectiveHandles {
	struct TMap<struct UObjectiveDataAsset*, struct UObjectiveHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.ActiveOverhealHandle
// Size: 0x04 (Inherited: 0x00)
struct FActiveOverhealHandle {
	char pad_0[0x4]; // 0x00(0x04)
};

// ScriptStruct ShooterGame.PartyData
// Size: 0x68 (Inherited: 0x00)
struct FPartyData {
	struct FString ID; // 0x00(0x10)
	struct FString PartyLeaderID; // 0x10(0x10)
	struct TArray<struct FPartyMemberData> MemberList; // 0x20(0x10)
	struct TArray<struct FPartyMemberData> FilteredMemberList; // 0x30(0x10)
	int32_t PartySize; // 0x40(0x04)
	int32_t MaxPartySize; // 0x44(0x04)
	enum class EAresPartyAccessibility PartyAccessibility; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
	struct FString ClientVersion; // 0x50(0x10)
	enum class EAresTempType PrecisePlatformTypes; // 0x60(0x01)
	bool IsCrossPlayEnabled; // 0x61(0x01)
	char pad_62[0x6]; // 0x62(0x06)
};

// ScriptStruct ShooterGame.PartyMemberData
// Size: 0x48 (Inherited: 0x00)
struct FPartyMemberData {
	struct FString ID; // 0x00(0x10)
	struct FString FullName; // 0x10(0x10)
	struct FString GameName; // 0x20(0x10)
	struct FString TagLine; // 0x30(0x10)
	struct FAresSocialPresenceState PresenceState; // 0x40(0x05)
	char pad_45[0x3]; // 0x45(0x03)
};

// ScriptStruct ShooterGame.AresSocialPresenceState
// Size: 0x05 (Inherited: 0x00)
struct FAresSocialPresenceState {
	enum class EAresSocialPresenceType PresenceType; // 0x00(0x01)
	enum class EAresSocialStatusTemplate StatusTemplate; // 0x01(0x01)
	enum class EAresSocialPartyCompatibility PartyJoinCompatibility; // 0x02(0x01)
	enum class EAresSocialPartyCompatibility PartyInviteCompatibility; // 0x03(0x01)
	bool bIsInParty; // 0x04(0x01)
};

// ScriptStruct ShooterGame.PatchNotes
// Size: 0x40 (Inherited: 0x00)
struct FPatchNotes {
	struct FString ID; // 0x00(0x10)
	struct FString BuildVersion; // 0x10(0x10)
	struct FString Language; // 0x20(0x10)
	struct TArray<struct FTopLevelPatchNoteElement> Content; // 0x30(0x10)
};

// ScriptStruct ShooterGame.TopLevelPatchNoteElement
// Size: 0x38 (Inherited: 0x00)
struct FTopLevelPatchNoteElement {
	struct FString Type; // 0x00(0x10)
	struct FString Content; // 0x10(0x10)
	bool Title; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct TArray<struct FPatchNoteListItem> Items; // 0x28(0x10)
};

// ScriptStruct ShooterGame.PatchNoteListItem
// Size: 0x20 (Inherited: 0x00)
struct FPatchNoteListItem {
	struct FString Type; // 0x00(0x10)
	struct FString Content; // 0x10(0x10)
};

// ScriptStruct ShooterGame.MatchupTeamViewModelPairV2
// Size: 0x20 (Inherited: 0x00)
struct FMatchupTeamViewModelPairV2 {
	struct UPickemMatchupTeamViewModelV2* TeamOne; // 0x00(0x08)
	struct UPickemMatchupTeamViewModelV2* TeamTwo; // 0x08(0x08)
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct ShooterGame.PingInfo
// Size: 0x18 (Inherited: 0x00)
struct FPingInfo {
	struct FString GamePodID; // 0x00(0x10)
	int32_t Ping; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct ShooterGame.PlayerCardHandles
// Size: 0x50 (Inherited: 0x00)
struct FPlayerCardHandles {
	struct TMap<struct UPlayerCardDataAsset*, struct UPlayerCardHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.PlayerKillData
// Size: 0x70 (Inherited: 0x00)
struct FPlayerKillData {
	struct AShooterPlayerState* Victim; // 0x00(0x08)
	struct FKillingEquippableInfo KillingEquippableInfo; // 0x08(0x38)
	struct TArray<struct AShooterPlayerState*> AssistingPlayers; // 0x40(0x10)
	struct FKillingDamageInfo DamageInfo; // 0x50(0x10)
	float GameTimeElapsed; // 0x60(0x04)
	float RoundTimestamp; // 0x64(0x04)
	int32_t RoundNumber; // 0x68(0x04)
	bool bDidKillTriggerFinisher; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
};

// ScriptStruct ShooterGame.KillingDamageInfo
// Size: 0x10 (Inherited: 0x00)
struct FKillingDamageInfo {
	struct UDamageType* DamageType; // 0x00(0x08)
	float DamageTaken; // 0x08(0x04)
	enum class EAresRegionalDamage DamageRegion; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct ShooterGame.KillingEquippableInfo
// Size: 0x38 (Inherited: 0x00)
struct FKillingEquippableInfo {
	struct AAresEquippable* KillingEquippableClass; // 0x00(0x08)
	struct TSoftClassPtr<UObject> WeaponTheme; // 0x08(0x30)
};

// ScriptStruct ShooterGame.EsportsPlayerStatsListDTO
// Size: 0x10 (Inherited: 0x00)
struct FEsportsPlayerStatsListDTO {
	struct TArray<struct FEsportsPlayerStatsDTO> PlayerStatsList; // 0x00(0x10)
};

// ScriptStruct ShooterGame.EsportsPlayerStatsDTO
// Size: 0x78 (Inherited: 0x00)
struct FEsportsPlayerStatsDTO {
	struct FString Handle; // 0x00(0x10)
	struct FString FirstName; // 0x10(0x10)
	struct FString LastName; // 0x20(0x10)
	int32_t Year; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FString ID; // 0x38(0x10)
	int32_t TotalGames; // 0x48(0x04)
	float AvgCombatScore; // 0x4c(0x04)
	float KDA; // 0x50(0x04)
	float KD; // 0x54(0x04)
	float HeadshotPercent; // 0x58(0x04)
	float AvgDamagePerRound; // 0x5c(0x04)
	float AvgKillsPerRound; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<struct FEsportsPlayerAgentStatsDTO> StatsPerAgent; // 0x68(0x10)
};

// ScriptStruct ShooterGame.EsportsPlayerAgentStatsDTO
// Size: 0x30 (Inherited: 0x00)
struct FEsportsPlayerAgentStatsDTO {
	struct FString AgentGuid; // 0x00(0x10)
	int32_t NumAgentGames; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString MostPlayedMap; // 0x18(0x10)
	int32_t MostPlayedMapGames; // 0x28(0x04)
	float MostPlayedMapWinrate; // 0x2c(0x04)
};

// ScriptStruct ShooterGame.PlayerTitleHandles
// Size: 0x50 (Inherited: 0x00)
struct FPlayerTitleHandles {
	struct TMap<struct UPlayerTitleDataAsset*, struct UPlayerTitleHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.PreferredGamePodMap
// Size: 0x50 (Inherited: 0x00)
struct FPreferredGamePodMap {
	struct TMap<struct FString, bool> PreferredGamePods; // 0x00(0x50)
};

// ScriptStruct ShooterGame.PremierConferenceHandles
// Size: 0x50 (Inherited: 0x00)
struct FPremierConferenceHandles {
	struct TMap<struct UPremierConferenceDataAsset*, struct UPremierConferenceHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.PremierEligibility
// Size: 0x48 (Inherited: 0x00)
struct FPremierEligibility {
	struct FString Subject; // 0x00(0x10)
	bool AccountVerificationStatus; // 0x10(0x01)
	bool LevelRequirementStatus; // 0x11(0x01)
	bool RankedPlacementCompletionStatus; // 0x12(0x01)
	char pad_13[0x5]; // 0x13(0x05)
	struct FPlayerRestrictions PlayerRestrictions; // 0x18(0x30)
};

// ScriptStruct ShooterGame.PlayerRestrictions
// Size: 0x30 (Inherited: 0x00)
struct FPlayerRestrictions {
	int64_t TimeUntilIneligibilityExpiresInSeconds; // 0x00(0x08)
	int64_t TimeUntilDisqualificationExpiresInSeconds; // 0x08(0x08)
	struct FString DisqualificationSeasonID; // 0x10(0x10)
	struct TArray<struct FString> Sources; // 0x20(0x10)
};

// ScriptStruct ShooterGame.PremierPlayerCrests
// Size: 0x68 (Inherited: 0x00)
struct FPremierPlayerCrests {
	struct FString Puuid; // 0x00(0x10)
	struct FDateTime ContenderEligibilityExpiry; // 0x10(0x08)
	struct TMap<struct FGuid, struct FPremierPlayerSeason> Seasons; // 0x18(0x50)
};

// ScriptStruct ShooterGame.PremierPlayerSeason
// Size: 0xc0 (Inherited: 0x00)
struct FPremierPlayerSeason {
	struct FString SeasonID; // 0x00(0x10)
	struct FString RosterID; // 0x10(0x10)
	struct FString RosterName; // 0x20(0x10)
	struct FString RosterTag; // 0x30(0x10)
	struct FString Conference; // 0x40(0x10)
	int32_t Division; // 0x50(0x04)
	bool IsProvisionalDivision; // 0x54(0x01)
	bool PromotionApplied; // 0x55(0x01)
	char pad_56[0x2]; // 0x56(0x02)
	int64_t Points; // 0x58(0x08)
	struct TMap<enum class EPremierEventType, int64_t> GamesPlayedByEventType; // 0x60(0x50)
	enum class EPremierCrestType Crest; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	int64_t ChampionshipPointRequirement; // 0xb8(0x08)
};

// ScriptStruct ShooterGame.PremierRosterRestrictions
// Size: 0x50 (Inherited: 0x00)
struct FPremierRosterRestrictions {
	struct TMap<struct FString, struct FPlayerRestrictions> PlayerRestrictions; // 0x00(0x50)
};

// ScriptStruct ShooterGame.PremierRosterV2
// Size: 0x268 (Inherited: 0x00)
struct FPremierRosterV2 {
	struct FString RosterID; // 0x00(0x10)
	struct FString Affinity; // 0x10(0x10)
	struct FString Name; // 0x20(0x10)
	struct FString Tag; // 0x30(0x10)
	struct FPremierRosterCustomization Customization; // 0x40(0x40)
	struct TArray<struct FPremierRosterV2Member> Members; // 0x80(0x10)
	struct TArray<struct FPremierRosterV2Invite> Invites; // 0x90(0x10)
	struct TArray<struct FPremierRosterV2Lock> Locks; // 0xa0(0x10)
	struct FPremierRosterV2SeasonData Season; // 0xb0(0x118)
	struct TMap<struct FString, struct FPremierRosterV2SeasonData> SeasonalInfoBySeasonID; // 0x1c8(0x50)
	struct FPremierRosterPrestige Prestige; // 0x218(0x18)
	int32_t MinimumRequiredMembersForEnrollment; // 0x230(0x04)
	int32_t MatchesSinceReset; // 0x234(0x04)
	int32_t TournamentsSinceReset; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct FPremierRosterV2Version Version; // 0x240(0x10)
	int64_t UpdatedAt; // 0x250(0x08)
	int64_t CreatedAt; // 0x258(0x08)
	bool IsForceRenamed; // 0x260(0x01)
	char pad_261[0x7]; // 0x261(0x07)
};

// ScriptStruct ShooterGame.PremierRosterV2Version
// Size: 0x10 (Inherited: 0x00)
struct FPremierRosterV2Version {
	int64_t SocialVersion; // 0x00(0x08)
	int64_t PremierVersion; // 0x08(0x08)
};

// ScriptStruct ShooterGame.PremierRosterPrestige
// Size: 0x18 (Inherited: 0x00)
struct FPremierRosterPrestige {
	bool EarnedPrestige; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString Plating; // 0x08(0x10)
};

// ScriptStruct ShooterGame.PremierRosterV2SeasonData
// Size: 0x118 (Inherited: 0x00)
struct FPremierRosterV2SeasonData {
	struct FGuid ID; // 0x00(0x10)
	bool IsEnrolled; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct FString Conference; // 0x18(0x10)
	int32_t Division; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FString RosterType; // 0x30(0x10)
	bool IsProvisionalDivision; // 0x40(0x01)
	bool PromotionApplied; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	int64_t Points; // 0x48(0x08)
	int32_t Wins; // 0x50(0x04)
	int32_t GamesPlayed; // 0x54(0x04)
	enum class EPremierCrestType Crest; // 0x58(0x01)
	enum class EPremierPrestigePlating Plating; // 0x59(0x01)
	char pad_5A[0x6]; // 0x5a(0x06)
	struct TMap<struct FString, struct FPremierMatch> Matches; // 0x60(0x50)
	struct TMap<struct FString, struct FPremierTournament> Tournaments; // 0xb0(0x50)
	struct TArray<struct FPremierBye> Byes; // 0x100(0x10)
	bool HasEarnedPromotionForNextSeason; // 0x110(0x01)
	bool HasEarnedPrestige; // 0x111(0x01)
	char pad_112[0x6]; // 0x112(0x06)
};

// ScriptStruct ShooterGame.PremierBye
// Size: 0x50 (Inherited: 0x00)
struct FPremierBye {
	struct FString SeasonID; // 0x00(0x10)
	struct FString EventID; // 0x10(0x10)
	int64_t ByeAwardedMillis; // 0x20(0x08)
	struct FPointDeltas PointDeltas; // 0x28(0x18)
	struct TArray<struct FString> Participants; // 0x40(0x10)
};

// ScriptStruct ShooterGame.PointDeltas
// Size: 0x18 (Inherited: 0x00)
struct FPointDeltas {
	int64_t Before; // 0x00(0x08)
	int64_t After; // 0x08(0x08)
	int64_t Earned; // 0x10(0x08)
};

// ScriptStruct ShooterGame.PremierTournament
// Size: 0x98 (Inherited: 0x00)
struct FPremierTournament {
	struct FString tournamentid; // 0x00(0x10)
	struct FString EventID; // 0x10(0x10)
	int32_t Placement; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FPointDeltas PointDeltas; // 0x28(0x18)
	int64_t StartTime; // 0x40(0x08)
	struct TMap<struct FString, struct FPremierTournamentMatch> Matches; // 0x48(0x50)
};

// ScriptStruct ShooterGame.PremierTournamentMatch
// Size: 0x28 (Inherited: 0x00)
struct FPremierTournamentMatch {
	struct FString MatchID; // 0x00(0x10)
	struct FString BracketType; // 0x10(0x10)
	int32_t TotalRounds; // 0x20(0x04)
	int32_t RoundNumber; // 0x24(0x04)
};

// ScriptStruct ShooterGame.PremierMatch
// Size: 0x78 (Inherited: 0x00)
struct FPremierMatch {
	struct FString MatchID; // 0x00(0x10)
	struct FString SeasonID; // 0x10(0x10)
	struct FString EventID; // 0x20(0x10)
	int64_t StartTime; // 0x30(0x08)
	struct FPointDeltas PointDeltas; // 0x38(0x18)
	enum class EMatchOutcome Outcome; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct TArray<struct FString> Participants; // 0x58(0x10)
	struct FString OpponentRosterID; // 0x68(0x10)
};

// ScriptStruct ShooterGame.PremierRosterV2Lock
// Size: 0x30 (Inherited: 0x00)
struct FPremierRosterV2Lock {
	struct FString Name; // 0x00(0x10)
	struct FString ClientName; // 0x10(0x10)
	int64_t CreatedAt; // 0x20(0x08)
	int64_t ExpiresAt; // 0x28(0x08)
};

// ScriptStruct ShooterGame.PremierRosterV2Invite
// Size: 0x58 (Inherited: 0x00)
struct FPremierRosterV2Invite {
	struct FString RosterID; // 0x00(0x10)
	struct FString RosterName; // 0x10(0x10)
	struct FString RosterTag; // 0x20(0x10)
	struct FString Puuid; // 0x30(0x10)
	struct FString SenderPuuid; // 0x40(0x10)
	int64_t CreatedAt; // 0x50(0x08)
};

// ScriptStruct ShooterGame.PremierRosterV2Member
// Size: 0x30 (Inherited: 0x00)
struct FPremierRosterV2Member {
	struct FString Puuid; // 0x00(0x10)
	struct FString Role; // 0x10(0x10)
	int64_t RoleID; // 0x20(0x08)
	int64_t CreatedAt; // 0x28(0x08)
};

// ScriptStruct ShooterGame.Roster
// Size: 0xf8 (Inherited: 0x00)
struct FRoster {
	struct FString Name; // 0x00(0x10)
	struct FString Tag; // 0x10(0x10)
	struct FString RosterID; // 0x20(0x10)
	int64_t Version; // 0x30(0x08)
	struct FString Realm; // 0x38(0x10)
	struct TArray<struct FRosterMember> Members; // 0x48(0x10)
	struct TArray<struct FRosterInvite> Invites; // 0x58(0x10)
	struct FRosterMetadata MetaData; // 0x68(0x70)
	struct TArray<struct FRosterLock> Locks; // 0xd8(0x10)
	int64_t UpdatedAt; // 0xe8(0x08)
	int64_t CreatedAt; // 0xf0(0x08)
};

// ScriptStruct ShooterGame.RosterLock
// Size: 0x30 (Inherited: 0x00)
struct FRosterLock {
	struct FString Name; // 0x00(0x10)
	struct FString ClientName; // 0x10(0x10)
	int64_t CreatedAt; // 0x20(0x08)
	int64_t ExpiresAt; // 0x28(0x08)
};

// ScriptStruct ShooterGame.RosterMetadata
// Size: 0x70 (Inherited: 0x00)
struct FRosterMetadata {
	struct FRosterVerifiedMetadata Verified; // 0x00(0x30)
	struct FRosterUnverifiedMetadata Unverified; // 0x30(0x40)
};

// ScriptStruct ShooterGame.RosterUnverifiedMetadata
// Size: 0x40 (Inherited: 0x00)
struct FRosterUnverifiedMetadata {
	struct FUnverifiedMetadataPersonalization Personalization; // 0x00(0x40)
};

// ScriptStruct ShooterGame.UnverifiedMetadataPersonalization
// Size: 0x40 (Inherited: 0x00)
struct FUnverifiedMetadataPersonalization {
	struct FString Icon; // 0x00(0x10)
	struct FString PrimaryColor; // 0x10(0x10)
	struct FString SecondaryColor; // 0x20(0x10)
	struct FString TertiaryColor; // 0x30(0x10)
};

// ScriptStruct ShooterGame.RosterVerifiedMetadata
// Size: 0x30 (Inherited: 0x00)
struct FRosterVerifiedMetadata {
	struct FRosterProductAffinityMetadata ProductAffinity; // 0x00(0x30)
};

// ScriptStruct ShooterGame.RosterProductAffinityMetadata
// Size: 0x30 (Inherited: 0x00)
struct FRosterProductAffinityMetadata {
	struct FString Name; // 0x00(0x10)
	struct FString GameShardZone; // 0x10(0x10)
	struct FString Affinity; // 0x20(0x10)
};

// ScriptStruct ShooterGame.RosterInvite
// Size: 0x58 (Inherited: 0x00)
struct FRosterInvite {
	struct FString RosterID; // 0x00(0x10)
	struct FString RosterName; // 0x10(0x10)
	struct FString RosterTag; // 0x20(0x10)
	struct FString Puuid; // 0x30(0x10)
	struct FString SenderPuuid; // 0x40(0x10)
	int64_t CreatedAt; // 0x50(0x08)
};

// ScriptStruct ShooterGame.RosterMember
// Size: 0x30 (Inherited: 0x00)
struct FRosterMember {
	struct FString Puuid; // 0x00(0x10)
	struct FString Role; // 0x10(0x10)
	enum class ERosterMemberRole RoleEnum; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	int64_t CreatedAt; // 0x28(0x08)
};

// ScriptStruct ShooterGame.PremierSeasonHandles
// Size: 0x50 (Inherited: 0x00)
struct FPremierSeasonHandles {
	struct TMap<struct UPremierSeasonDataAsset*, struct UPremierSeasonHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.TournamentMatchupScores
// Size: 0x70 (Inherited: 0x00)
struct FTournamentMatchupScores {
	int32_t GameIndex; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString GameID; // 0x08(0x10)
	int64_t UpdateDate; // 0x18(0x08)
	struct TMap<struct FString, int64_t> Scores; // 0x20(0x50)
};

// ScriptStruct ShooterGame.TournamentOverview
// Size: 0x80 (Inherited: 0x00)
struct FTournamentOverview {
	struct FTournament Tournament; // 0x00(0x50)
	struct TArray<struct FParticipant> Participants; // 0x50(0x10)
	struct TArray<struct FMatchup> Matchups; // 0x60(0x10)
	struct TArray<struct FRoundConfig> Rounds; // 0x70(0x10)
};

// ScriptStruct ShooterGame.RoundConfig
// Size: 0x20 (Inherited: 0x00)
struct FRoundConfig {
	int32_t RoundNumber; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	int64_t ScheduledStartDateEpochSeconds; // 0x08(0x08)
	int64_t ScheduledEndDateEpochSeconds; // 0x10(0x08)
	int32_t BestOfN; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct ShooterGame.Matchup
// Size: 0x60 (Inherited: 0x00)
struct FMatchup {
	struct FString MatchupID; // 0x00(0x10)
	int32_t RoundNumber; // 0x10(0x04)
	enum class EMatchupBracketType BracketType; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
	int32_t WinnersNextMatchupNumber; // 0x18(0x04)
	int32_t LosersNextMatchupNumber; // 0x1c(0x04)
	int32_t MatchupNumber; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct TArray<struct FMatchupParticipant> Participants; // 0x28(0x10)
	enum class EMatchupStatus Status; // 0x38(0x01)
	bool Complete; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	int64_t ScheduledStartDateInEpochSeconds; // 0x40(0x08)
	struct TArray<struct FMatchupGame> Games; // 0x48(0x10)
	int32_t BestOfN; // 0x58(0x04)
	bool Bye; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
};

// ScriptStruct ShooterGame.MatchupGame
// Size: 0xa0 (Inherited: 0x00)
struct FMatchupGame {
	struct FString GameID; // 0x00(0x10)
	int32_t GameIndex; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString MetaData; // 0x18(0x10)
	int64_t ScheduledStartDateInEpochSeconds; // 0x28(0x08)
	struct TArray<struct FMatchupGameScore> Scores; // 0x30(0x10)
	struct TArray<struct FMatchupGamePlacement> Placements; // 0x40(0x10)
	char pad_50[0x50]; // 0x50(0x50)
};

// ScriptStruct ShooterGame.MatchupGamePlacement
// Size: 0x18 (Inherited: 0x00)
struct FMatchupGamePlacement {
	struct FString ParticipantID; // 0x00(0x10)
	int32_t Placement; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct ShooterGame.MatchupGameScore
// Size: 0x18 (Inherited: 0x00)
struct FMatchupGameScore {
	struct FString ParticipantID; // 0x00(0x10)
	int32_t Score; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct ShooterGame.MatchupParticipant
// Size: 0x38 (Inherited: 0x00)
struct FMatchupParticipant {
	struct FString ParticipantID; // 0x00(0x10)
	bool IsBye; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	int64_t Points; // 0x18(0x08)
	int64_t Seed; // 0x20(0x08)
	int64_t PreviousMatchupNumber; // 0x28(0x08)
	enum class EMatchupParticipantOutcome Outcome; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// ScriptStruct ShooterGame.Participant
// Size: 0xa0 (Inherited: 0x00)
struct FParticipant {
	struct FString ParticipantID; // 0x00(0x10)
	int64_t Seed; // 0x10(0x08)
	int32_t TournamentPoints; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct FString MetaData; // 0x20(0x10)
	struct FParticipantInfo ParticipantInfo; // 0x30(0x60)
	struct FString CurrentMatchupID; // 0x90(0x10)
};

// ScriptStruct ShooterGame.ParticipantInfo
// Size: 0x60 (Inherited: 0x00)
struct FParticipantInfo {
	struct FString Name; // 0x00(0x10)
	struct FString Tag; // 0x10(0x10)
	struct FPremierRosterCustomization Customization; // 0x20(0x40)
};

// ScriptStruct ShooterGame.Tournament
// Size: 0x50 (Inherited: 0x00)
struct FTournament {
	struct FString tournamentid; // 0x00(0x10)
	struct FString OrganizerID; // 0x10(0x10)
	struct FString Name; // 0x20(0x10)
	struct FString Region; // 0x30(0x10)
	enum class ETournamentType Type; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32_t TournamentSize; // 0x44(0x04)
	int32_t BestOfN; // 0x48(0x04)
	enum class ETournamentStatus Status; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
};

// ScriptStruct ShooterGame.AresTrackedReward
// Size: 0x50 (Inherited: 0x00)
struct FAresTrackedReward {
	struct FAresGameReward TotalReward; // 0x00(0x24)
	struct FName RewardName; // 0x24(0x0c)
	struct FText LocalizedRewardName; // 0x30(0x18)
	int32_t InstancesOfReward; // 0x48(0x04)
	enum class EAresRewardGrantStrategy RewardGrantStrategy; // 0x4c(0x01)
	enum class ERewardSource Source; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
};

// ScriptStruct ShooterGame.AresGameReward
// Size: 0x24 (Inherited: 0x00)
struct FAresGameReward {
	int32_t Rewards[0x9]; // 0x00(0x24)
};

// ScriptStruct ShooterGame.PurchaseResponse
// Size: 0x10 (Inherited: 0x00)
struct FPurchaseResponse {
	struct FGuid OrderID; // 0x00(0x10)
};

// ScriptStruct ShooterGame.ReplayLocalFileMatchEntryUpdateInfo
// Size: 0x50 (Inherited: 0x00)
struct FReplayLocalFileMatchEntryUpdateInfo {
	enum class EReplayLocalFileMatchEntryUpdateCode UpdateCode; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FReplayAmbassadorError OptionalAmbassadorError; // 0x08(0x48)
};

// ScriptStruct ShooterGame.ReplayAmbassadorError
// Size: 0x48 (Inherited: 0x38)
struct FReplayAmbassadorError : FAmbassadorError {
	struct FString MatchID; // 0x38(0x10)
};

// ScriptStruct ShooterGame.OrderResponse
// Size: 0xd0 (Inherited: 0x00)
struct FOrderResponse {
	struct FGuid OrderID; // 0x00(0x10)
	struct FString Status; // 0x10(0x10)
	struct FOrderRewards OrderRewards; // 0x20(0xb0)
};

// ScriptStruct ShooterGame.OrderRewards
// Size: 0xb0 (Inherited: 0x00)
struct FOrderRewards {
	struct TArray<struct FOrderReward> SkinLevels; // 0x00(0x10)
	struct TArray<struct FOrderReward> Variants; // 0x10(0x10)
	struct TArray<struct FOrderReward> Sprays; // 0x20(0x10)
	struct TArray<struct FOrderReward> Cards; // 0x30(0x10)
	struct TArray<struct FOrderReward> Buddies; // 0x40(0x10)
	struct TArray<struct FOrderReward> Totems; // 0x50(0x10)
	struct TArray<struct FOrderReward> GunShards; // 0x60(0x10)
	struct TArray<struct FOrderReward> Titles; // 0x70(0x10)
	struct TArray<struct FOrderReward> Characters; // 0x80(0x10)
	struct TArray<struct FOrderReward> JuiceBoxes; // 0x90(0x10)
	struct TArray<struct FOrderReward> Currencies; // 0xa0(0x10)
};

// ScriptStruct ShooterGame.OrderReward
// Size: 0x14 (Inherited: 0x00)
struct FOrderReward {
	struct FGuid RewardID; // 0x00(0x10)
	int32_t Amount; // 0x10(0x04)
};

// ScriptStruct ShooterGame.PartyMemberSeasonalInfo
// Size: 0x30 (Inherited: 0x00)
struct FPartyMemberSeasonalInfo {
	struct FGuid SeasonID; // 0x00(0x10)
	int32_t NumberOfWins; // 0x10(0x04)
	int32_t RankTier; // 0x14(0x04)
	int32_t CapstoneTier; // 0x18(0x04)
	int32_t CapstoneWins; // 0x1c(0x04)
	struct TArray<int32_t> TopWins; // 0x20(0x10)
};

// ScriptStruct ShooterGame.SeasonHandles
// Size: 0x50 (Inherited: 0x00)
struct FSeasonHandles {
	struct TMap<struct USeasonDataAsset*, struct USeasonHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.SpawnPointData
// Size: 0x78 (Inherited: 0x00)
struct FSpawnPointData {
	struct AShooterTeamStart* SpawnPoint; // 0x00(0x08)
	struct TMap<enum class EAresTeamRole, struct FSpawnPointTeamRoleData> TeamRoleData; // 0x08(0x50)
	int32_t ArrayIndex; // 0x58(0x04)
	float LastUpdateTimestamp; // 0x5c(0x04)
	struct TArray<int32_t> SpawnPointIndicesInVision; // 0x60(0x10)
	int32_t NumTicksUntilUpdate; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct ShooterGame.SpawnPointTeamRoleData
// Size: 0x10 (Inherited: 0x00)
struct FSpawnPointTeamRoleData {
	float Score; // 0x00(0x04)
	int32_t NumVisibleEnemyCharacters; // 0x04(0x04)
	float EngageDistanceScore; // 0x08(0x04)
	bool bSpawnPointDataStale; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct ShooterGame.SprayEquipSlotHandles
// Size: 0x50 (Inherited: 0x00)
struct FSprayEquipSlotHandles {
	struct TMap<struct USprayEquipSlotDataAsset*, struct USprayEquipSlotHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.SprayLevelHandles
// Size: 0x50 (Inherited: 0x00)
struct FSprayLevelHandles {
	struct TMap<struct USprayLevelDataAsset*, struct USprayLevelHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.SprayHandles
// Size: 0x50 (Inherited: 0x00)
struct FSprayHandles {
	struct TMap<struct USprayDataAsset*, struct USprayHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.EffectData
// Size: 0x58 (Inherited: 0x00)
struct FEffectData {
	struct TWeakObjectPtr<struct AActor> WaitOnReplicationActor; // 0x00(0x08)
	struct TArray<struct FEffectDataFloat> FloatValues; // 0x08(0x10)
	struct TArray<struct FEffectDataVector> VectorValues; // 0x18(0x10)
	struct TArray<struct FEffectDataObject> ObjectValues; // 0x28(0x10)
	struct TArray<struct FEffectDataClass> ClassValues; // 0x38(0x10)
	struct TArray<struct FEffectDataText> TextValues; // 0x48(0x10)
};

// ScriptStruct ShooterGame.EffectDataText
// Size: 0x28 (Inherited: 0x00)
struct FEffectDataText {
	struct FGameplayTag Name; // 0x00(0x0c)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FText Text; // 0x10(0x18)
};

// ScriptStruct ShooterGame.EffectDataClass
// Size: 0x40 (Inherited: 0x00)
struct FEffectDataClass {
	struct FGameplayTag Name; // 0x00(0x0c)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TSoftClassPtr<UObject> Class; // 0x10(0x30)
};

// ScriptStruct ShooterGame.EffectDataObject
// Size: 0x14 (Inherited: 0x00)
struct FEffectDataObject {
	struct FGameplayTag Name; // 0x00(0x0c)
	struct TWeakObjectPtr<struct UObject> Object; // 0x0c(0x08)
};

// ScriptStruct ShooterGame.EffectDataVector
// Size: 0x28 (Inherited: 0x00)
struct FEffectDataVector {
	struct FGameplayTag Name; // 0x00(0x0c)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FVector Vector; // 0x10(0x18)
};

// ScriptStruct ShooterGame.EffectDataFloat
// Size: 0x10 (Inherited: 0x00)
struct FEffectDataFloat {
	struct FGameplayTag Name; // 0x00(0x0c)
	float float; // 0x0c(0x04)
};

// ScriptStruct ShooterGame.StorefrontItemHandles
// Size: 0x50 (Inherited: 0x00)
struct FStorefrontItemHandles {
	struct TMap<struct UStorefrontItemDataAsset*, struct UStorefrontItemHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.StoreGift
// Size: 0xf0 (Inherited: 0x00)
struct FStoreGift {
	struct FGuid GiftID; // 0x00(0x10)
	struct FGuid PurchaserID; // 0x10(0x10)
	struct FGuid RecipientId; // 0x20(0x10)
	struct FGuid StoreID; // 0x30(0x10)
	struct FString StoreName; // 0x40(0x10)
	struct FGuid CatalogEntryID; // 0x50(0x10)
	struct FString CatalogEntryName; // 0x60(0x10)
	struct FGuid PurchaserTransactionID; // 0x70(0x10)
	struct FGuid RecipientTransactionID; // 0x80(0x10)
	struct FDateTime CreatedTime; // 0x90(0x08)
	struct FDateTime CompletedTime; // 0x98(0x08)
	struct FString State; // 0xa0(0x10)
	struct FString Source; // 0xb0(0x10)
	struct FString MessageToRecipient; // 0xc0(0x10)
	struct FGuid RecipientMailID; // 0xd0(0x10)
	struct FGuid PurchaserMailID; // 0xe0(0x10)
};

// ScriptStruct ShooterGame.GetGiftByIdResponse
// Size: 0x208 (Inherited: 0x00)
struct FGetGiftByIdResponse {
	struct FStoreGift StoreGift; // 0x00(0xf0)
	struct FPluginStoreOffer StoreOffer; // 0xf0(0x118)
};

// ScriptStruct ShooterGame.PluginStoreOffer
// Size: 0x118 (Inherited: 0x00)
struct FPluginStoreOffer {
	struct FPluginStorePurchaseInformation PurchaseInformation; // 0x00(0x108)
	struct TArray<struct FPluginStoreSubOffer> SubOffers; // 0x108(0x10)
};

// ScriptStruct ShooterGame.PluginStoreSubOffer
// Size: 0x108 (Inherited: 0x00)
struct FPluginStoreSubOffer {
	struct FPluginStorePurchaseInformation PurchaseInformation; // 0x00(0x108)
};

// ScriptStruct ShooterGame.PluginStorePurchaseInformation
// Size: 0x108 (Inherited: 0x00)
struct FPluginStorePurchaseInformation {
	struct FGuid DataAssetID; // 0x00(0x10)
	struct FGuid OfferId; // 0x10(0x10)
	struct FDateTime StartDate; // 0x20(0x08)
	struct FGuid PrimaryCurrencyID; // 0x28(0x10)
	struct TMap<struct FGuid, int32_t> Cost; // 0x38(0x50)
	struct TMap<struct FGuid, int32_t> DiscountedCost; // 0x88(0x50)
	int32_t DiscountedPercentage; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct UStoreOffer* Offer; // 0xe0(0x08)
	enum class EStoreOfferType OfferType; // 0xe8(0x01)
	char pad_E9[0x7]; // 0xe9(0x07)
	struct TArray<struct FPluginStoreReward> Rewards; // 0xf0(0x10)
	bool WholeSaleOnly; // 0x100(0x01)
	enum class EGiftingType IsGiftable; // 0x101(0x01)
	char pad_102[0x6]; // 0x102(0x06)
};

// ScriptStruct ShooterGame.PluginStoreReward
// Size: 0x24 (Inherited: 0x00)
struct FPluginStoreReward {
	struct FGuid ItemTypeID; // 0x00(0x10)
	struct FGuid ItemId; // 0x10(0x10)
	int32_t Quantity; // 0x20(0x04)
};

// ScriptStruct ShooterGame.SubscriptionHandles
// Size: 0x50 (Inherited: 0x00)
struct FSubscriptionHandles {
	struct TMap<struct USubscriptionDataAsset*, struct USubscriptionHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.TeamRecord
// Size: 0x0c (Inherited: 0x00)
struct FTeamRecord {
	int32_t Wins; // 0x00(0x04)
	int32_t Losses; // 0x04(0x04)
	int32_t Ties; // 0x08(0x04)
};

// ScriptStruct ShooterGame.UITelemetryEventTarget
// Size: 0x10 (Inherited: 0x00)
struct FUITelemetryEventTarget {
	struct FString ActionTarget; // 0x00(0x10)
};

// ScriptStruct ShooterGame.ThemeHandles
// Size: 0x50 (Inherited: 0x00)
struct FThemeHandles {
	struct TMap<struct UThemeDataAsset*, struct UThemeHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.ReplayTimeJumpRequestDetails
// Size: 0x10 (Inherited: 0x00)
struct FReplayTimeJumpRequestDetails {
	float GotoTimeDestSeconds; // 0x00(0x04)
	float TimeDilationCatchupDestSeconds; // 0x04(0x04)
	float TimeJumpDestSeconds; // 0x08(0x04)
	bool bIsRoundJumping; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct ShooterGame.TotemHandles
// Size: 0x50 (Inherited: 0x00)
struct FTotemHandles {
	struct TMap<struct UTotemDataAsset*, struct UTotemHandle*> Handles; // 0x00(0x50)
};

// ScriptStruct ShooterGame.TournamentData
// Size: 0xd0 (Inherited: 0x00)
struct FTournamentData {
	struct FString RosterID; // 0x00(0x10)
	struct FString tournamentid; // 0x10(0x10)
	struct FString EventID; // 0x20(0x10)
	struct FString PremierEventID; // 0x30(0x10)
	struct FString PremierSeasonID; // 0x40(0x10)
