// WidgetBlueprintGeneratedClass StatsVideo_StatsSettings.StatsVideo_StatsSettings_C
// Size: 0x580 (Inherited: 0x318)
struct UStatsVideo_StatsSettings_C : USettingsSubsectionBase_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UVerticalBox* AT; // 0x320(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ATB; // 0x328(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ClientIncomingMoveProcessingDelay; // 0x330(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* DownloadedBytes; // 0x338(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* EquippableCorrections; // 0x340(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* FiringErrors; // 0x348(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* FullEndtoEndLatency; // 0x350(0x08)
	struct UVerticalBox* GameplayStats; // 0x358(0x08)
	struct USettingsV2_Subheader_C* Header-AT; // 0x360(0x08)
	struct USettingsV2_Subheader_C* Header-GameplayStats; // 0x368(0x08)
	struct USettingsV2_Subheader_C* Header-InputLatency; // 0x370(0x08)
	struct USettingsV2_Subheader_C* Header-Network; // 0x378(0x08)
	struct USettingsV2_Subheader_C* Header-Performance_2; // 0x380(0x08)
	struct USettingsV2_Subheader_C* Header-Presets; // 0x388(0x08)
	struct USettingsV2_Subheader_C* Header-RGIInputLatency; // 0x390(0x08)
	struct USettingsV2_Subheader_C* Header-SystemHealth; // 0x398(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* IncomingPacketSizeAvg+Max; // 0x3a0(0x08)
	struct UVerticalBox* InputLatency; // 0x3a8(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* MoveCorrectionMagnitude; // 0x3b0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* MoveTimelineShift; // 0x3b8(0x08)
	struct UVerticalBox* Network; // 0x3c0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* OutgoingInputQueueLength; // 0x3c8(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* OutgoingMoveQueueLength; // 0x3d0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* OutgoingPacketSizeAvg+Max; // 0x3d8(0x08)
	struct UVerticalBox* Performance; // 0x3e0(0x08)
	struct UPlayerFacingPerfSettingsPresetWidget_C* PlayerFacingPerfSettingsPreset_Widget; // 0x3e8(0x08)
	struct UVerticalBox* RGIInputLatency; // 0x3f0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ServerIncomingMoveProcessingDelay; // 0x3f8(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowAvailablePhysicalMemory; // 0x400(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowConsecutiveRemoteForwardPredictions; // 0x408(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowCPUGameTimePerfWidget; // 0x410(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowCPURenderTimePerfWidget; // 0x418(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowCPURHITimePerfWidget; // 0x420(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowFrameCountPerfWidget; // 0x428(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowFrameRatePerfWidget; // 0x430(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowFrameTimePerfWidget; // 0x438(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowGPURenderTimePerfWidget; // 0x440(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowIdleTimePerfWidget; // 0x448(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowIncomingPacketLossPerfWidget; // 0x450(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowInputLatencyCPU; // 0x458(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowInputLatencyCPU+GPU; // 0x460(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowInputLatencyGPU; // 0x468(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowInputLatencyPresent; // 0x470(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowNetworkJitterPerfWidget; // 0x478(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowNetworkRTTPerfWidget; // 0x480(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowOutgoingPacketLossPerfWidget; // 0x488(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowPacketLossPerfWidget; // 0x490(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowPacketsLostIncoming; // 0x498(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowPacketsLostOutgoing; // 0x4a0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowPacketsLostTotal; // 0x4a8(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowPacketsReceived; // 0x4b0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowPacketsSent; // 0x4b8(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowQueuedRemoteMoves; // 0x4c0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowRemoteInterpDelay; // 0x4c8(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowRenderWait; // 0x4d0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowServerFrameRatePerfWidget; // 0x4d8(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowTotalLatency; // 0x4e0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowTotalSlop; // 0x4e8(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowTotalWork; // 0x4f0(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* ShowUsedPhysicalMemory; // 0x4f8(0x08)
	struct UVerticalBox* StatsSubsection; // 0x500(0x08)
	struct UVerticalBox* SystemHealth; // 0x508(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* TotalTransferredBytes; // 0x510(0x08)
	struct UPlayerFacingPerfSettingsWidget_C* UploadedBytes; // 0x518(0x08)
	struct TArray<struct UWidget*> WidgetsToToggleVisibility; // 0x520(0x10)
	struct TMap<enum class EAresIntSettingName, int32_t> SavedPlayerSettings; // 0x530(0x50)

	void EnableIndividualButtonStates(bool IsEnable); // Function StatsVideo_StatsSettings.StatsVideo_StatsSettings_C.EnableIndividualButtonStates // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void Construct(); // Function StatsVideo_StatsSettings.StatsVideo_StatsSettings_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void ChangeButtonDisabledState(bool ButtonState); // Function StatsVideo_StatsSettings.StatsVideo_StatsSettings_C.ChangeButtonDisabledState // (BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void ExecuteUbergraph_StatsVideo_StatsSettings(int32_t EntryPoint); // Function StatsVideo_StatsSettings.StatsVideo_StatsSettings_C.ExecuteUbergraph_StatsVideo_StatsSettings // (Final|UbergraphFunction) // @ game+0x19be2f0
};

