// ScriptStruct TP_Core_AnimGraph_v2.TP_Core_AnimGraph_v2_C.AnimBlueprintGeneratedConstantData
// Size: 0x338 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<float> __ArrayProperty_3071; // 0x08(0x10)
	struct FName __NameProperty_3072; // 0x18(0x0c)
	char pad_24[0x4]; // 0x24(0x04)
	struct TArray<float> __ArrayProperty_3073; // 0x28(0x10)
	struct FName __NameProperty_3074; // 0x38(0x0c)
	struct FName __NameProperty_3075; // 0x44(0x0c)
	float __FloatProperty_3076; // 0x50(0x04)
	struct FName __NameProperty_3077; // 0x54(0x0c)
	struct FName __NameProperty_3078; // 0x60(0x0c)
	struct FName __NameProperty_3079; // 0x6c(0x0c)
	struct FName __NameProperty_3080; // 0x78(0x0c)
	struct FName __NameProperty_3081; // 0x84(0x0c)
	struct FName __NameProperty_3082; // 0x90(0x0c)
	struct FName __NameProperty_3083; // 0x9c(0x0c)
	struct FName __NameProperty_3084; // 0xa8(0x0c)
	struct FName __NameProperty_3085; // 0xb4(0x0c)
	struct FName __NameProperty_3086; // 0xc0(0x0c)
	int32_t __IntProperty_3087; // 0xcc(0x04)
	struct TArray<float> __ArrayProperty_3088; // 0xd0(0x10)
	enum class EAnimGroupRole __ByteProperty_3089; // 0xe0(0x01)
	char pad_E1[0x3]; // 0xe1(0x03)
	struct FName __NameProperty_3090; // 0xe4(0x0c)
	struct FName __NameProperty_3091; // 0xf0(0x0c)
	int32_t __IntProperty_3092; // 0xfc(0x04)
	struct FName __NameProperty_3093; // 0x100(0x0c)
	int32_t __IntProperty_3094; // 0x10c(0x04)
	struct FName __NameProperty_3095; // 0x110(0x0c)
	int32_t __IntProperty_3096; // 0x11c(0x04)
	struct FName __NameProperty_3097; // 0x120(0x0c)
	int32_t __IntProperty_3098; // 0x12c(0x04)
	struct FName __NameProperty_3099; // 0x130(0x0c)
	int32_t __IntProperty_3100; // 0x13c(0x04)
	struct FName __NameProperty_3101; // 0x140(0x0c)
	int32_t __IntProperty_3102; // 0x14c(0x04)
	struct FName __NameProperty_3103; // 0x150(0x0c)
	struct FName __NameProperty_3104; // 0x15c(0x0c)
	struct FName __NameProperty_3105; // 0x168(0x0c)
	struct FName __NameProperty_3106; // 0x174(0x0c)
	struct FName __NameProperty_3107; // 0x180(0x0c)
	int32_t __IntProperty_3108; // 0x18c(0x04)
	struct FName __NameProperty_3109; // 0x190(0x0c)
	struct FName __NameProperty_3110; // 0x19c(0x0c)
	struct FName __NameProperty_3111; // 0x1a8(0x0c)
	struct FName __NameProperty_3112; // 0x1b4(0x0c)
	struct TArray<float> __ArrayProperty_3113; // 0x1c0(0x10)
	enum class EAnimSyncMethod __EnumProperty_3114; // 0x1d0(0x01)
	char pad_1D1[0x3]; // 0x1d1(0x03)
	struct FName __NameProperty_3115; // 0x1d4(0x0c)
	struct FName __NameProperty_3116; // 0x1e0(0x0c)
	int32_t __IntProperty_3117; // 0x1ec(0x04)
	struct FName __NameProperty_3118; // 0x1f0(0x0c)
	int32_t __IntProperty_3119; // 0x1fc(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_3120; // 0x200(0x2c)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct UBlendProfile* __BlendProfile_3121; // 0x230(0x08)
	struct UCurveFloat* __CurveFloat_3122; // 0x238(0x08)
	enum class EAlphaBlendOption __EnumProperty_3123; // 0x240(0x01)
	enum class EBlendListTransitionType __EnumProperty_3124; // 0x241(0x01)
	char pad_242[0x6]; // 0x242(0x06)
	struct TArray<float> __ArrayProperty_3125; // 0x248(0x10)
	struct FAnimNodeFunctionRef __StructProperty_3126; // 0x258(0x28)
	float __FloatProperty_3127; // 0x280(0x04)
	bool __BoolProperty_3128; // 0x284(0x01)
	char pad_285[0x3]; // 0x285(0x03)
	float __FloatProperty_3129; // 0x288(0x04)
	bool __BoolProperty_3130; // 0x28c(0x01)
	enum class EAnimSyncMethod __EnumProperty_3131; // 0x28d(0x01)
	enum class EAnimGroupRole __ByteProperty_3132; // 0x28e(0x01)
	char pad_28F[0x1]; // 0x28f(0x01)
	struct FName __NameProperty_3133; // 0x290(0x0c)
	char pad_29C[0x4]; // 0x29c(0x04)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x2a0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x320(0x18)
};

// ScriptStruct TP_Core_AnimGraph_v2.TP_Core_AnimGraph_v2_C.AnimBlueprintGeneratedMutableData
// Size: 0x500 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct TArray<float> __ArrayProperty_1; // 0x08(0x10)
	int32_t __IntProperty_2; // 0x18(0x04)
	float __FloatProperty_3; // 0x1c(0x04)
	float __FloatProperty_4; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct TArray<float> __ArrayProperty_5; // 0x28(0x10)
	int32_t __IntProperty_6; // 0x38(0x04)
	float __FloatProperty_7; // 0x3c(0x04)
	float __FloatProperty_8; // 0x40(0x04)
	float __FloatProperty_9; // 0x44(0x04)
	float __FloatProperty_10; // 0x48(0x04)
	bool __BoolProperty_11; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	struct TArray<float> __ArrayProperty_12; // 0x50(0x10)
	int32_t __IntProperty_13; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TArray<float> __ArrayProperty_14; // 0x68(0x10)
	int32_t __IntProperty_15; // 0x78(0x04)
	bool __BoolProperty_16; // 0x7c(0x01)
	bool __BoolProperty_17; // 0x7d(0x01)
	char pad_7E[0x2]; // 0x7e(0x02)
	float __FloatProperty_18; // 0x80(0x04)
	float __FloatProperty_19; // 0x84(0x04)
	float __FloatProperty_20; // 0x88(0x04)
	float __FloatProperty_21; // 0x8c(0x04)
	bool __BoolProperty_22; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	float __FloatProperty_23; // 0x94(0x04)
	float __FloatProperty_24; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct TArray<float> __ArrayProperty_25; // 0xa0(0x10)
	int32_t __IntProperty_26; // 0xb0(0x04)
	float __FloatProperty_27; // 0xb4(0x04)
	float __FloatProperty_28; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct TArray<float> __ArrayProperty_29; // 0xc0(0x10)
	int32_t __IntProperty_30; // 0xd0(0x04)
	float __FloatProperty_31; // 0xd4(0x04)
	float __FloatProperty_32; // 0xd8(0x04)
	float __FloatProperty_33; // 0xdc(0x04)
	float __FloatProperty_34; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct TArray<float> __ArrayProperty_35; // 0xe8(0x10)
	int32_t __IntProperty_36; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct TArray<float> __ArrayProperty_37; // 0x100(0x10)
	int32_t __IntProperty_38; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct TArray<float> __ArrayProperty_39; // 0x118(0x10)
	int32_t __IntProperty_40; // 0x128(0x04)
	char pad_12C[0x4]; // 0x12c(0x04)
	struct TArray<float> __ArrayProperty_41; // 0x130(0x10)
	int32_t __IntProperty_42; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct TArray<float> __ArrayProperty_43; // 0x148(0x10)
	int32_t __IntProperty_44; // 0x158(0x04)
	float __FloatProperty_45; // 0x15c(0x04)
	float __FloatProperty_46; // 0x160(0x04)
	int32_t __IntProperty_47; // 0x164(0x04)
	bool __BoolProperty_48; // 0x168(0x01)
	bool __BoolProperty_49; // 0x169(0x01)
	char pad_16A[0x6]; // 0x16a(0x06)
	struct TArray<float> __ArrayProperty_50; // 0x170(0x10)
	int32_t __IntProperty_51; // 0x180(0x04)
	int32_t __IntProperty_52; // 0x184(0x04)
	bool __BoolProperty_53; // 0x188(0x01)
	char pad_189[0x3]; // 0x189(0x03)
	int32_t __IntProperty_54; // 0x18c(0x04)
	bool __BoolProperty_55; // 0x190(0x01)
	char pad_191[0x7]; // 0x191(0x07)
	struct TArray<float> __ArrayProperty_56; // 0x198(0x10)
	int32_t __IntProperty_57; // 0x1a8(0x04)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	struct TArray<float> __ArrayProperty_58; // 0x1b0(0x10)
	int32_t __IntProperty_59; // 0x1c0(0x04)
	float __FloatProperty_60; // 0x1c4(0x04)
	float __FloatProperty_61; // 0x1c8(0x04)
	float __FloatProperty_62; // 0x1cc(0x04)
	float __FloatProperty_63; // 0x1d0(0x04)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	struct TArray<float> __ArrayProperty_64; // 0x1d8(0x10)
	int32_t __IntProperty_65; // 0x1e8(0x04)
	float __FloatProperty_66; // 0x1ec(0x04)
	float __FloatProperty_67; // 0x1f0(0x04)
	float __FloatProperty_68; // 0x1f4(0x04)
	float __FloatProperty_69; // 0x1f8(0x04)
	char pad_1FC[0x4]; // 0x1fc(0x04)
	struct TArray<float> __ArrayProperty_70; // 0x200(0x10)
	int32_t __IntProperty_71; // 0x210(0x04)
	float __FloatProperty_72; // 0x214(0x04)
	float __FloatProperty_73; // 0x218(0x04)
	float __FloatProperty_74; // 0x21c(0x04)
	float __FloatProperty_75; // 0x220(0x04)
	char pad_224[0x4]; // 0x224(0x04)
	struct TArray<float> __ArrayProperty_76; // 0x228(0x10)
	int32_t __IntProperty_77; // 0x238(0x04)
	float __FloatProperty_78; // 0x23c(0x04)
	float __FloatProperty_79; // 0x240(0x04)
	float __FloatProperty_80; // 0x244(0x04)
	float __FloatProperty_81; // 0x248(0x04)
	char pad_24C[0x4]; // 0x24c(0x04)
	struct TArray<float> __ArrayProperty_82; // 0x250(0x10)
	int32_t __IntProperty_83; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	struct TArray<float> __ArrayProperty_84; // 0x268(0x10)
	int32_t __IntProperty_85; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct TArray<float> __ArrayProperty_86; // 0x280(0x10)
	int32_t __IntProperty_87; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	struct TArray<float> __ArrayProperty_88; // 0x298(0x10)
	int32_t __IntProperty_89; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	struct TArray<float> __ArrayProperty_90; // 0x2b0(0x10)
	int32_t __IntProperty_91; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct TArray<float> __ArrayProperty_92; // 0x2c8(0x10)
	int32_t __IntProperty_93; // 0x2d8(0x04)
	char pad_2DC[0x4]; // 0x2dc(0x04)
	struct TArray<float> __ArrayProperty_94; // 0x2e0(0x10)
	int32_t __IntProperty_95; // 0x2f0(0x04)
	float __FloatProperty_96; // 0x2f4(0x04)
	float __FloatProperty_97; // 0x2f8(0x04)
	float __FloatProperty_98; // 0x2fc(0x04)
	float __FloatProperty_99; // 0x300(0x04)
	float __FloatProperty_100; // 0x304(0x04)
	float __FloatProperty_101; // 0x308(0x04)
	float __FloatProperty_102; // 0x30c(0x04)
	float __FloatProperty_103; // 0x310(0x04)
	float __FloatProperty_104; // 0x314(0x04)
	float __FloatProperty_105; // 0x318(0x04)
	bool __BoolProperty_106; // 0x31c(0x01)
	bool __BoolProperty_107; // 0x31d(0x01)
	char pad_31E[0x2]; // 0x31e(0x02)
	struct TArray<float> __ArrayProperty_108; // 0x320(0x10)
	int32_t __IntProperty_109; // 0x330(0x04)
	float __FloatProperty_110; // 0x334(0x04)
	float __FloatProperty_111; // 0x338(0x04)
	float __FloatProperty_112; // 0x33c(0x04)
	float __FloatProperty_113; // 0x340(0x04)
	char pad_344[0x4]; // 0x344(0x04)
	struct TArray<float> __ArrayProperty_114; // 0x348(0x10)
	int32_t __IntProperty_115; // 0x358(0x04)
	float __FloatProperty_116; // 0x35c(0x04)
	float __FloatProperty_117; // 0x360(0x04)
	float __FloatProperty_118; // 0x364(0x04)
	float __FloatProperty_119; // 0x368(0x04)
	float __FloatProperty_120; // 0x36c(0x04)
	float __FloatProperty_121; // 0x370(0x04)
	float __FloatProperty_122; // 0x374(0x04)
	float __FloatProperty_123; // 0x378(0x04)
	bool __BoolProperty_124; // 0x37c(0x01)
	bool __BoolProperty_125; // 0x37d(0x01)
	char pad_37E[0x2]; // 0x37e(0x02)
	struct TArray<float> __ArrayProperty_126; // 0x380(0x10)
	int32_t __IntProperty_127; // 0x390(0x04)
	float __FloatProperty_128; // 0x394(0x04)
	float __FloatProperty_129; // 0x398(0x04)
	float __FloatProperty_130; // 0x39c(0x04)
	float __FloatProperty_131; // 0x3a0(0x04)
	char pad_3A4[0x4]; // 0x3a4(0x04)
	struct TArray<float> __ArrayProperty_132; // 0x3a8(0x10)
	int32_t __IntProperty_133; // 0x3b8(0x04)
	float __FloatProperty_134; // 0x3bc(0x04)
	float __FloatProperty_135; // 0x3c0(0x04)
	float __FloatProperty_136; // 0x3c4(0x04)
	float __FloatProperty_137; // 0x3c8(0x04)
	bool __BoolProperty_138; // 0x3cc(0x01)
	bool __BoolProperty_139; // 0x3cd(0x01)
	bool __BoolProperty_140; // 0x3ce(0x01)
	char pad_3CF[0x1]; // 0x3cf(0x01)
	int32_t __IntProperty_141; // 0x3d0(0x04)
	char pad_3D4[0x4]; // 0x3d4(0x04)
	struct TArray<float> __ArrayProperty_142; // 0x3d8(0x10)
	int32_t __IntProperty_143; // 0x3e8(0x04)
	float __FloatProperty_144; // 0x3ec(0x04)
	float __FloatProperty_145; // 0x3f0(0x04)
	float __FloatProperty_146; // 0x3f4(0x04)
	float __FloatProperty_147; // 0x3f8(0x04)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	struct TArray<float> __ArrayProperty_148; // 0x400(0x10)
	int32_t __IntProperty_149; // 0x410(0x04)
	float __FloatProperty_150; // 0x414(0x04)
	float __FloatProperty_151; // 0x418(0x04)
	float __FloatProperty_152; // 0x41c(0x04)
	float __FloatProperty_153; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct TArray<float> __ArrayProperty_154; // 0x428(0x10)
	int32_t __IntProperty_155; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct TArray<float> __ArrayProperty_156; // 0x440(0x10)
	int32_t __IntProperty_157; // 0x450(0x04)
	int32_t __IntProperty_158; // 0x454(0x04)
	struct TArray<float> __ArrayProperty_159; // 0x458(0x10)
	int32_t __IntProperty_160; // 0x468(0x04)
	float __FloatProperty_161; // 0x46c(0x04)
	float __FloatProperty_162; // 0x470(0x04)
	char pad_474[0x4]; // 0x474(0x04)
	struct TArray<float> __ArrayProperty_163; // 0x478(0x10)
	int32_t __IntProperty_164; // 0x488(0x04)
	float __FloatProperty_165; // 0x48c(0x04)
	float __FloatProperty_166; // 0x490(0x04)
	int32_t __IntProperty_167; // 0x494(0x04)
	struct TArray<float> __ArrayProperty_168; // 0x498(0x10)
	int32_t __IntProperty_169; // 0x4a8(0x04)
	float __FloatProperty_170; // 0x4ac(0x04)
	float __FloatProperty_171; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct TArray<float> __ArrayProperty_172; // 0x4b8(0x10)
	int32_t __IntProperty_173; // 0x4c8(0x04)
	float __FloatProperty_174; // 0x4cc(0x04)
	float __FloatProperty_175; // 0x4d0(0x04)
	char pad_4D4[0x4]; // 0x4d4(0x04)
	struct TArray<float> __ArrayProperty_176; // 0x4d8(0x10)
	int32_t __IntProperty_177; // 0x4e8(0x04)
	bool __BoolProperty_178; // 0x4ec(0x01)
	char pad_4ED[0x3]; // 0x4ed(0x03)
	float __FloatProperty_179; // 0x4f0(0x04)
	float __FloatProperty_180; // 0x4f4(0x04)
	float __FloatProperty_181; // 0x4f8(0x04)
	float __FloatProperty_182; // 0x4fc(0x04)
};

