// WidgetBlueprintGeneratedClass WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C
// Size: 0x460 (Inherited: 0x3e0)
struct UWBP_Panel_CustomLobbyTeams_C : UAresCommonUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3e0(0x08)
	struct UWBP_Button_Pill_C* Balance_Button; // 0x3e8(0x08)
	struct UHorizontalBox* HorizontalBox_Coaches; // 0x3f0(0x08)
	struct UWBP_Button_Pill_C* Invite_Button; // 0x3f8(0x08)
	struct UWBP_Panel_CustomLobbyTeam_C* PnlAttackers; // 0x400(0x08)
	struct UWBP_Panel_CustomLobbyTeam_C* PnlAttackersCoach; // 0x408(0x08)
	struct UWBP_Panel_CustomLobbyTeam_C* PnlDefenders; // 0x410(0x08)
	struct UWBP_Panel_CustomLobbyTeam_C* PnlDefendersCoach; // 0x418(0x08)
	struct UWBP_Panel_CustomLobbyTeam_C* PnlObservers; // 0x420(0x08)
	struct UVM_CustomGame_TeamInfo_C* VM_TeamInfo; // 0x428(0x08)
	struct FMulticastInlineDelegate OnInviteCicked; // 0x430(0x10)
	struct FMulticastInlineDelegate OnPlayerClicked; // 0x440(0x10)
	struct UVM_CustomGame_Balance_C* BalanceViewModel; // 0x450(0x08)
	int32_t NumObserverCells; // 0x458(0x04)
	int32_t NumObserverCellsTournament; // 0x45c(0x04)

	void SetBalanceButtonEnabled(bool IsEnabled); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.SetBalanceButtonEnabled // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void SetBalanceButtonVisibility(bool IsVisible); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.SetBalanceButtonVisibility // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void BindCustomGameBalanceViewModel(bool bBind); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BindCustomGameBalanceViewModel // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void SetCustomGameBalanceViewModel(struct UVM_CustomGame_Balance_C* InBalanceViewModel); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.SetCustomGameBalanceViewModel // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void MakeCustomGameBalanceViewModel(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.MakeCustomGameBalanceViewModel // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnAttackersCoachesChanged(struct TSet<struct FString> AttackersCoachers); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.OnAttackersCoachesChanged // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnDefendersCoachesChanged(struct TSet<struct FString> DefendersCoaches); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.OnDefendersCoachesChanged // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void UpdateForTournamentMode(bool bTournamentModeEnabled); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.UpdateForTournamentMode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	struct UWidget* BP_GetDesiredFocusTarget(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BP_GetDesiredFocusTarget // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x19be2f0
	void RefreshView(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.RefreshView // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnSpectatorsChanged(struct TSet<struct FString> Spectators); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.OnSpectatorsChanged // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnDefendersChanged(struct TSet<struct FString> Defenders); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.OnDefendersChanged // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnAttackersChanged(struct TSet<struct FString> Attackers); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.OnAttackersChanged // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void BindTeamInfoViewModel(bool bBind); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BindTeamInfoViewModel // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void SetTeamInfoViewModel(struct UVM_CustomGame_TeamInfo_C* ViewModel); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.SetTeamInfoViewModel // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void MakeTeamInfoViewModel(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.MakeTeamInfoViewModel // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void InitViewModels(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.InitViewModels // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackers_K2Node_ComponentBoundEvent_3_OnRequestInvite__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackers_K2Node_ComponentBoundEvent_3_OnRequestInvite__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefenders_K2Node_ComponentBoundEvent_4_OnRequestInvite__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefenders_K2Node_ComponentBoundEvent_4_OnRequestInvite__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlObservers_K2Node_ComponentBoundEvent_5_OnRequestInvite__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlObservers_K2Node_ComponentBoundEvent_5_OnRequestInvite__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackers_K2Node_ComponentBoundEvent_6_OnPlayerClicked__DelegateSignature(struct FString PlayerSubject); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackers_K2Node_ComponentBoundEvent_6_OnPlayerClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_PlayerCategories_PnlObservers_K2Node_ComponentBoundEvent_2_OnRequestMove__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_PlayerCategories_PnlObservers_K2Node_ComponentBoundEvent_2_OnRequestMove__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefenders_K2Node_ComponentBoundEvent_7_OnPlayerClicked__DelegateSignature(struct FString PlayerSubject); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefenders_K2Node_ComponentBoundEvent_7_OnPlayerClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlObservers_K2Node_ComponentBoundEvent_8_OnPlayerClicked__DelegateSignature(struct FString PlayerSubject); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlObservers_K2Node_ComponentBoundEvent_8_OnPlayerClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackersCoach_K2Node_ComponentBoundEvent_9_OnRequestInvite__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackersCoach_K2Node_ComponentBoundEvent_9_OnRequestInvite__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_PlayerCategories_PnlDefenders_K2Node_ComponentBoundEvent_1_OnRequestMove__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_PlayerCategories_PnlDefenders_K2Node_ComponentBoundEvent_1_OnRequestMove__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackersCoach_K2Node_ComponentBoundEvent_10_OnRequestMove__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackersCoach_K2Node_ComponentBoundEvent_10_OnRequestMove__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackersCoach_K2Node_ComponentBoundEvent_11_OnPlayerClicked__DelegateSignature(struct FString PlayerSubject); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlAttackersCoach_K2Node_ComponentBoundEvent_11_OnPlayerClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_PlayerCategories_PnlAttackers_K2Node_ComponentBoundEvent_0_OnRequestMove__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_PlayerCategories_PnlAttackers_K2Node_ComponentBoundEvent_0_OnRequestMove__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void K2_BindToViewModel(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.K2_BindToViewModel // (Event|Public|BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefendersCoach_K2Node_ComponentBoundEvent_12_OnRequestInvite__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefendersCoach_K2Node_ComponentBoundEvent_12_OnRequestInvite__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefendersCoach_K2Node_ComponentBoundEvent_13_OnRequestMove__DelegateSignature(); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefendersCoach_K2Node_ComponentBoundEvent_13_OnRequestMove__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefendersCoach_K2Node_ComponentBoundEvent_14_OnPlayerClicked__DelegateSignature(struct FString PlayerSubject); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_PnlDefendersCoach_K2Node_ComponentBoundEvent_14_OnPlayerClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_Balance_Button_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_Balance_Button_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_Invite_Button_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_Invite_Button_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_Invite_Button_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_Invite_Button_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void BndEvt__WBP_Panel_CustomLobbyTeams_Balance_Button_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.BndEvt__WBP_Panel_CustomLobbyTeams_Balance_Button_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x19be2f0
	void ExecuteUbergraph_WBP_Panel_CustomLobbyTeams(int32_t EntryPoint); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.ExecuteUbergraph_WBP_Panel_CustomLobbyTeams // (Final|UbergraphFunction) // @ game+0x19be2f0
	void OnPlayerClicked__DelegateSignature(enum class ECustomGameTeam Team, struct FString PlayerSubject); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.OnPlayerClicked__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
	void OnInviteCicked__DelegateSignature(enum class ECustomGameTeam Team); // Function WBP_Panel_CustomLobbyTeams.WBP_Panel_CustomLobbyTeams_C.OnInviteCicked__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x19be2f0
};

